{
  "surf": [
    {"english": "The waves are calm this morning, perfect for beginners to practice standing on their boards.", "spanish": "Las olas están tranquilas esta mañana, perfectas para que los principiantes practiquen pararse en sus tablas.", "level": 1},
    {"english": "He paddled carefully, trying to catch a small wave near the shore without falling.", "spanish": "Remaba con cuidado, intentando atrapar una ola pequeña cerca de la orilla sin caerse.", "level": 1},
    {"english": "She spent an hour learning how to balance properly on the board.", "spanish": "Pasó una hora aprendiendo a mantener el equilibrio correctamente sobre la tabla.", "level": 1},
    {"english": "The instructor showed them how to position their feet to catch the wave correctly.", "spanish": "El instructor les mostró cómo colocar los pies para atrapar la ola correctamente.", "level": 1},
    {"english": "It is easier to stand up when the waves are small and slow.", "spanish": "Es más fácil pararse cuando las olas son pequeñas y lentas.", "level": 1},
    {"english": "The morning sun made the water sparkle, giving beginners more confidence.", "spanish": "El sol de la mañana hacía que el agua brillara, dando más confianza a los principiantes.", "level": 1},
    {"english": "He practiced getting on his knees first before standing up on the board.", "spanish": "Practicó primero arrodillarse antes de pararse sobre la tabla.", "level": 1},
    {"english": "A gentle wave pushed them toward the shore slowly and safely.", "spanish": "Una ola suave los empujó hacia la orilla lentamente y de manera segura.", "level": 1},
    {"english": "Breathing deeply helps beginners stay relaxed while paddling.", "spanish": "Respirar profundamente ayuda a los principiantes a mantenerse relajados mientras reman.", "level": 1},
    {"english": "Watching others surf helps learners understand timing and balance.", "spanish": "Observar a otros surfear ayuda a los aprendices a entender el tiempo y el equilibrio.", "level": 1},
    {"english": "He learned to fall safely to avoid hitting the board.", "spanish": "Aprendió a caerse de manera segura para no golpearse con la tabla.", "level": 1},
    {"english": "They practiced catching waves near the sandbar for safety.", "spanish": "Practicaron atrapar olas cerca del banco de arena por seguridad.", "level": 1},
    {"english": "The instructor corrected their posture to improve balance.", "spanish": "El instructor corrigió su postura para mejorar el equilibrio.", "level": 1},
    {"english": "Wearing a leash ensures the board stays close after a fall.", "spanish": "Usar un leash asegura que la tabla se mantenga cerca después de una caída.", "level": 1},
    {"english": "He focused on keeping his eyes forward while paddling.", "spanish": "Se concentró en mantener la vista hacia adelante mientras remaba.", "level": 1},
    {"english": "Practicing in small waves builds confidence for larger waves later.", "spanish": "Practicar en olas pequeñas genera confianza para olas más grandes después.", "level": 1},
    {"english": "She enjoyed the feeling of standing on the board for the first time.", "spanish": "Disfrutó la sensación de pararse en la tabla por primera vez.", "level": 1},
    {"english": "It is important to warm up before going into the water.", "spanish": "Es importante calentar antes de entrar al agua.", "level": 1},
    {"english": "They learned to paddle through white water to reach the clean waves.", "spanish": "Aprendieron a remar a través de la espuma para llegar a las olas limpias.", "level": 1},
    {"english": "The calm sea allowed everyone to practice without fear.", "spanish": "El mar tranquilo permitió que todos practicaran sin miedo.", "level": 1},
    {"english": "He practiced popping up quickly to catch the wave on time.", "spanish": "Practicó levantarse rápido para atrapar la ola a tiempo.", "level": 1},
    {"english": "They learned to turn their board gently while riding small waves.", "spanish": "Aprendieron a girar la tabla suavemente mientras surfeaban olas pequeñas.", "level": 1},
    {"english": "Keeping knees bent helps maintain balance on the board.", "spanish": "Mantener las rodillas dobladas ayuda a mantener el equilibrio sobre la tabla.", "level": 1},
    {"english": "He enjoyed the cool water while learning new surfing skills.", "spanish": "Disfrutó del agua fresca mientras aprendía nuevas habilidades de surf.", "level": 1},
    {"english": "Practicing with friends made learning more fun and safe.", "spanish": "Practicar con amigos hizo que aprender fuera más divertido y seguro.", "level": 1},
    {"english": "The instructor encouraged them to try different starting positions.", "spanish": "El instructor los animó a probar diferentes posiciones iniciales.", "level": 1},
    {"english": "They learned to fall flat to minimize the impact on the water.", "spanish": "Aprendieron a caer planos para minimizar el impacto en el agua.", "level": 1},
    {"english": "Keeping arms forward helps with paddling efficiency.", "spanish": "Mantener los brazos hacia adelante ayuda con la eficiencia al remar.", "level": 1},
    {"english": "He practiced timing the wave to stand up at the right moment.", "spanish": "Practicó el tiempo de la ola para pararse en el momento correcto.", "level": 1},
    {"english": "The small waves allowed him to focus on technique rather than speed.", "spanish": "Las olas pequeñas le permitieron concentrarse en la técnica más que en la velocidad.", "level": 1},
    {"english": "Learning to surf takes patience and repeated practice.", "spanish": "Aprender a surfear requiere paciencia y práctica repetida.", "level": 1},
    {"english": "He was careful to avoid colliding with other surfers.", "spanish": "Tuvo cuidado de no chocar con otros surfistas.", "level": 1},
    {"english": "They enjoyed the warm sun while waiting for the next wave.", "spanish": "Disfrutaron del sol cálido mientras esperaban la siguiente ola.", "level": 1},
    {"english": "Practicing in shallow water helps beginners gain confidence.", "spanish": "Practicar en agua poco profunda ayuda a los principiantes a ganar confianza.", "level": 1},
    {"english": "He watched the waves carefully to understand their pattern.", "spanish": "Observó las olas cuidadosamente para entender su patrón.", "level": 1},
    {"english": "Keeping the board pointed straight helps with stability.", "spanish": "Mantener la tabla apuntando derecho ayuda con la estabilidad.", "level": 1},
    {"english": "She learned to fall safely without hurting herself.", "spanish": "Aprendió a caerse de manera segura sin lastimarse.", "level": 1},
    {"english": "The instructor corrected small mistakes to improve performance.", "spanish": "El instructor corrigió pequeños errores para mejorar el rendimiento.", "level": 1},
    {"english": "Paddling steadily helps catch the wave smoothly.", "spanish": "Remar de manera constante ayuda a atrapar la ola suavemente.", "level": 1},
    {"english": "They practiced standing up in the white water repeatedly.", "spanish": "Practicaron pararse repetidamente en la espuma.", "level": 1},
    {"english": "The calm water made it easier to learn how to balance.", "spanish": "El agua tranquila hizo más fácil aprender a mantener el equilibrio.", "level": 1},
    {"english": "He was excited to ride a wave without falling for the first time.", "spanish": "Estaba emocionado de surfear una ola sin caerse por primera vez.", "level": 1},
    {"english": "Practicing every day helps beginners improve faster.", "spanish": "Practicar todos los días ayuda a los principiantes a mejorar más rápido.", "level": 1},
    {"english": "The waves near the shore were ideal for learning basic turns.", "spanish": "Las olas cerca de la orilla eran ideales para aprender giros básicos.", "level": 1},
    {"english": "He learned to push the board into the wave correctly.", "spanish": "Aprendió a empujar la tabla correctamente hacia la ola.", "level": 1},
    {"english": "Keeping eyes forward helps maintain balance on the wave.", "spanish": "Mantener la vista hacia adelante ayuda a mantener el equilibrio sobre la ola.", "level": 1},
    {"english": "She practiced catching the wave at the right speed.", "spanish": "Practicó atrapar la ola a la velocidad correcta.", "level": 1},
    {"english": "Small mistakes are normal when learning to surf.", "spanish": "Los pequeños errores son normales al aprender a surfear.", "level": 1},
    {"english": "He focused on his posture to avoid falling.", "spanish": "Se concentró en su postura para evitar caerse.", "level": 1},
    {"english": "Practicing with a friend helps spot errors quickly.", "spanish": "Practicar con un amigo ayuda a detectar errores rápidamente.", "level": 1},
    {"english": "The morning breeze made paddling more comfortable.", "spanish": "La brisa de la mañana hizo más cómodo remar.", "level": 1},
    {"english": "He learned how to stand quickly when the wave rises.", "spanish": "Aprendió a pararse rápidamente cuando la ola sube.", "level": 1},
    {"english": "Watching the instructor closely helps beginners improve.", "spanish": "Observar al instructor de cerca ayuda a los principiantes a mejorar.", "level": 1},
    {"english": "They enjoyed the feeling of gliding over the water.", "spanish": "Disfrutaron la sensación de deslizarse sobre el agua.", "level": 1},
    {"english": "Keeping a steady pace helps maintain balance on small waves.", "spanish": "Mantener un ritmo constante ayuda a mantener el equilibrio en olas pequeñas.", "level": 1},
    {"english": "He practiced turning gently while riding the wave.", "spanish": "Practicó girar suavemente mientras surfeaba la ola.", "level": 1},
    {"english": "The instructor encouraged them to try different waves.", "spanish": "El instructor los animó a probar diferentes olas.", "level": 1},
    {"english": "Practicing in shallow water reduces the risk of injury.", "spanish": "Practicar en agua poco profunda reduce el riesgo de lesiones.", "level": 1},
    {"english": "He learned to fall safely to avoid hitting the board.", "spanish": "Aprendió a caerse de manera segura para no golpearse con la tabla.", "level": 1},
    {"english": "Keeping knees bent helps with stability on the board.", "spanish": "Mantener las rodillas dobladas ayuda con la estabilidad sobre la tabla.", "level": 1},
    {"english": "They practiced paddling in a straight line to catch waves properly.", "spanish": "Practicaron remar en línea recta para atrapar las olas correctamente.", "level": 1},
    {"english": "He focused on timing to stand up at the right moment.", "spanish": "Se concentró en el tiempo para pararse en el momento correcto.", "level": 1},
    {"english": "The gentle waves allowed him to practice safely.", "spanish": "Las olas suaves le permitieron practicar de manera segura.", "level": 1},
    {"english": "Practicing daily helps improve balance and confidence.", "spanish": "Practicar a diario ayuda a mejorar el equilibrio y la confianza.", "level": 1},
    {"english": "He learned to position his feet correctly on the board.", "spanish": "Aprendió a colocar los pies correctamente sobre la tabla.", "level": 1},
    {"english": "Watching others surf helps beginners understand wave patterns.", "spanish": "Observar a otros surfear ayuda a los principiantes a entender los patrones de las olas.", "level": 1},
    {"english": "Keeping arms forward improves paddling efficiency.", "spanish": "Mantener los brazos hacia adelante mejora la eficiencia al remar.", "level": 1},
    {"english": "She learned to read the waves to choose the right one.", "spanish": "Aprendió a leer las olas para elegir la correcta.", "level": 1},
    {"english": "The calm sea made it easier to learn new techniques.", "spanish": "El mar tranquilo hizo más fácil aprender nuevas técnicas.", "level": 1},
    {"english": "He practiced standing up smoothly without falling.", "spanish": "Practicó pararse suavemente sin caerse.", "level": 1},
    {"english": "Practicing with guidance helps avoid bad habits.", "spanish": "Practicar con guía ayuda a evitar malos hábitos.", "level": 1},
    {"english": "They enjoyed learning new skills in a safe environment.", "spanish": "Disfrutaron aprender nuevas habilidades en un entorno seguro.", "level": 1},
    {"english": "He learned to control the board while catching small waves.", "spanish": "Aprendió a controlar la tabla mientras atrapaba olas pequeñas.", "level": 1},
    {"english": "Focusing on balance helps beginners ride waves longer.", "spanish": "Concentrarse en el equilibrio ayuda a los principiantes a surfear olas por más tiempo.", "level": 1},
    {"english": "He practiced quickly popping up when the wave arrives.", "spanish": "Practicó levantarse rápidamente cuando llega la ola.", "level": 1},
    {"english": "The instructor encouraged practicing in different water conditions.", "spanish": "El instructor animó a practicar en diferentes condiciones de agua.", "level": 1},
    {"english": "Learning to surf requires patience and persistence.", "spanish": "Aprender a surfear requiere paciencia y persistencia.", "level": 1},
    {"english": "He practiced safely and avoided risky maneuvers.", "spanish": "Practicó de manera segura y evitó maniobras arriesgadas.", "level": 1},
    {"english": "Keeping eyes on the wave helps maintain balance.", "spanish": "Mantener la vista en la ola ayuda a mantener el equilibrio.", "level": 1},
    {"english": "She enjoyed the excitement of catching her first wave.", "spanish": "Disfrutó la emoción de atrapar su primera ola.", "level": 1},
    {"english": "Practicing in small waves builds confidence for larger ones.", "spanish": "Practicar en olas pequeñas genera confianza para olas más grandes.", "level": 1},
    {"english": "He learned to anticipate the wave’s movement to stand on time.", "spanish": "Aprendió a anticipar el movimiento de la ola para pararse a tiempo.", "level": 1},
    {"english": "Practicing with friends makes learning more enjoyable.", "spanish": "Practicar con amigos hace que aprender sea más divertido.", "level": 1},
    {"english": "He focused on keeping balance while paddling through waves.", "spanish": "Se concentró en mantener el equilibrio mientras remaba entre las olas.", "level": 1},
    {"english": "Learning from mistakes helps beginners improve faster.", "spanish": "Aprender de los errores ayuda a los principiantes a mejorar más rápido.", "level": 1},
    {"english": "They practiced in the shallow area to feel safe.", "spanish": "Practicaron en la zona poco profunda para sentirse seguros.", "level": 1},
    {"english": "He enjoyed the feeling of gliding on the water.", "spanish": "Disfrutó la sensación de deslizarse sobre el agua.", "level": 1},
    {"english": "The instructor gave clear instructions to improve skills.", "spanish": "El instructor dio instrucciones claras para mejorar las habilidades.", "level": 1},
    {"english": "He practiced turning the board gently on small waves.", "spanish": "Practicó girar la tabla suavemente sobre olas pequeñas.", "level": 1},
    {"english": "Learning slowly and steadily leads to better progress.", "spanish": "Aprender despacio y de manera constante conduce a un mejor progreso.", "level": 1},
    {"english": "They focused on posture and balance during every attempt.", "spanish": "Se concentraron en la postura y el equilibrio en cada intento.", "level": 1},
    {"english": "He practiced popping up from his knees to standing position.", "spanish": "Practicó levantarse desde las rodillas hasta la posición de pie.", "level": 1},
    {"english": "The calm water allowed everyone to enjoy surfing safely.", "spanish": "El agua tranquila permitió que todos disfrutaran del surf de manera segura.", "level": 1},
    {"english": "He learned how to paddle efficiently to catch more waves.", "spanish": "Aprendió a remar eficientemente para atrapar más olas.", "level": 1},
    {"english": "Practicing regularly helps build confidence and skill.", "spanish": "Practicar regularmente ayuda a desarrollar confianza y habilidad.", "level": 1},
    {"english": "They learned to fall without hitting the board hard.", "spanish": "Aprendieron a caerse sin golpearse fuerte con la tabla.", "level": 1},
    {"english": "Keeping eyes forward helps with direction and balance.", "spanish": "Mantener la vista hacia adelante ayuda con la dirección y el equilibrio.", "level": 1},
    {"english": "He focused on timing and balance to ride the wave.", "spanish": "Se concentró en el tiempo y el equilibrio para surfear la ola.", "level": 1},
    {"english": "Practicing in groups helps beginners learn faster.", "spanish": "Practicar en grupos ayuda a los principiantes a aprender más rápido.", "level": 1},
    {"english": "He enjoyed learning new techniques in calm conditions.", "spanish": "Disfrutó aprender nuevas técnicas en condiciones tranquilas.", "level": 1},
    {"english": "Standing on the board for the first time was exciting.", "spanish": "Pararse en la tabla por primera vez fue emocionante.", "level": 1},
    {"english": "He practiced regularly to improve balance and stability.", "spanish": "Practicó regularmente para mejorar el equilibrio y la estabilidad.", "level": 1},
    {"english": "Watching experienced surfers helps beginners understand the waves.", "spanish": "Observar a surfistas experimentados ayuda a los principiantes a entender las olas.", "level": 1},
    {"english": "He learned to position his body correctly while paddling.", "spanish": "Aprendió a colocar su cuerpo correctamente mientras remaba.", "level": 1},
    {"english": "Practicing safely reduces the risk of injuries.", "spanish": "Practicar de manera segura reduce el riesgo de lesiones.", "level": 1},
    {"english": "He enjoyed gliding over small waves without fear.", "spanish": "Disfrutó deslizarse sobre olas pequeñas sin miedo.", "level": 1},
    {"english": "Learning from others’ advice improves technique quickly.", "spanish": "Aprender de los consejos de otros mejora la técnica rápidamente.", "level": 1},
    {"english": "He focused on gentle movements to maintain control.", "spanish": "Se concentró en movimientos suaves para mantener el control.", "level": 1},
    {"english": "The calm morning waves were perfect for learning basic skills.", "spanish": "Las olas tranquilas de la mañana eran perfectas para aprender habilidades básicas.", "level": 1},

    {"english": "The waves were getting stronger, and he had to adjust his timing to catch them properly.", "spanish": "Las olas se estaban haciendo más fuertes, y tuvo que ajustar su tiempo para atraparlas correctamente.", "level": 2},
    {"english": "She paddled past the breaking waves to reach the deeper water where the waves were cleaner.", "spanish": "Remó más allá de las olas rompientes para llegar a aguas más profundas donde las olas eran más limpias.", "level": 2},
    {"english": "He practiced turning sharply to follow the wave's direction.", "spanish": "Practicó girar bruscamente para seguir la dirección de la ola.", "level": 2},
    {"english": "Maintaining balance while performing small maneuvers became more challenging as the waves grew.", "spanish": "Mantener el equilibrio mientras realizaba pequeñas maniobras se volvió más desafiante a medida que las olas crecían.", "level": 2},
    {"english": "She learned to read the wave’s shape to anticipate the best moment to stand up.", "spanish": "Aprendió a leer la forma de la ola para anticipar el mejor momento para pararse.", "level": 2},
    {"english": "Timing the pop-up correctly allowed him to ride longer waves successfully.", "spanish": "Levantar la tabla a tiempo le permitió surfear olas más largas con éxito.", "level": 2},
    {"english": "He adjusted his feet placement to improve speed and stability on steeper waves.", "spanish": "Ajustó la colocación de sus pies para mejorar la velocidad y estabilidad en olas más inclinadas.", "level": 2},
    {"english": "She practiced duck-diving under incoming waves to avoid being pushed back.", "spanish": "Practicó pasar por debajo de las olas entrantes para evitar ser empujada hacia atrás.", "level": 2},
    {"english": "Keeping low and bending the knees helped him maintain control on the faster waves.", "spanish": "Mantenerse bajo y con las rodillas dobladas le ayudó a mantener el control en olas más rápidas.", "level": 2},
    {"english": "Observing the swell pattern helped her decide which waves to attempt.", "spanish": "Observar el patrón del oleaje le ayudó a decidir qué olas intentar.", "level": 2},
    {"english": "He practiced cutting back to stay on the power section of the wave.", "spanish": "Practicó el giro de regreso para mantenerse en la sección más potente de la ola.", "level": 2},
    {"english": "She learned to angle her board to ride along the face of the wave smoothly.", "spanish": "Aprendió a anglar su tabla para deslizarse por la cara de la ola suavemente.", "level": 2},
    {"english": "Adjusting the paddle speed was essential to catch faster waves.", "spanish": "Ajustar la velocidad del remo era esencial para atrapar olas más rápidas.", "level": 2},
    {"english": "He practiced trimming on the wave to maintain momentum.", "spanish": "Practicó el trimado sobre la ola para mantener el impulso.", "level": 2},
    {"english": "Watching other surfers gave her ideas for new maneuvers.", "spanish": "Observar a otros surfistas le dio ideas para nuevas maniobras.", "level": 2},
    {"english": "He learned to fall safely in deep water without hitting the board.", "spanish": "Aprendió a caerse de manera segura en aguas profundas sin golpear la tabla.", "level": 2},
    {"english": "Practicing turns and cutbacks improved her overall surfing control.", "spanish": "Practicar giros y cortes mejoró su control general del surf.", "level": 2},
    {"english": "He adjusted his stance depending on the wave's speed and size.", "spanish": "Ajustó su postura dependiendo de la velocidad y tamaño de la ola.", "level": 2},
    {"english": "Reading the wave before paddling helped him choose the right take-off point.", "spanish": "Leer la ola antes de remar le ayudó a elegir el punto correcto de salida.", "level": 2},
    {"english": "She learned to shift her weight to generate more speed on the wave.", "spanish": "Aprendió a cambiar su peso para generar más velocidad sobre la ola.", "level": 2},
    {"english": "Practicing in various water conditions helped him adapt to different waves.", "spanish": "Practicar en diferentes condiciones de agua le ayudó a adaptarse a distintas olas.", "level": 2},
    {"english": "He noticed subtle changes in the wave and adjusted accordingly.", "spanish": "Notó cambios sutiles en la ola y se ajustó en consecuencia.", "level": 2},
    {"english": "She focused on keeping the board balanced during longer rides.", "spanish": "Se concentró en mantener la tabla equilibrada durante recorridos más largos.", "level": 2},
    {"english": "Timing the drop correctly is key to successfully catching the wave.", "spanish": "El momento correcto para bajar es clave para atrapar la ola con éxito.", "level": 2},
    {"english": "He learned to pump the board to generate speed in flat sections.", "spanish": "Aprendió a bombear la tabla para generar velocidad en secciones planas.", "level": 2},
    {"english": "Practicing with feedback from instructors improved his technique quickly.", "spanish": "Practicar con retroalimentación de los instructores mejoró su técnica rápidamente.", "level": 2},
    {"english": "She used the wave’s power to perform smooth turns.", "spanish": "Usó la potencia de la ola para realizar giros suaves.", "level": 2},
    {"english": "He learned to anticipate the wave’s breaking point to adjust his ride.", "spanish": "Aprendió a anticipar el punto de rompimiento de la ola para ajustar su recorrido.", "level": 2},
    {"english": "Practicing in slightly bigger waves prepared her for more challenging conditions.", "spanish": "Practicar en olas un poco más grandes la preparó para condiciones más desafiantes.", "level": 2},
    {"english": "He focused on trimming and carving to maximize his wave ride.", "spanish": "Se concentró en trimar y tallar para maximizar su recorrido sobre la ola.", "level": 2},
    {"english": "She practiced navigating through white water to reach the open face of the wave.", "spanish": "Practicó navegar a través de la espuma para llegar a la cara abierta de la ola.", "level": 2},
    {"english": "Keeping a flexible stance allowed him to adapt quickly to wave changes.", "spanish": "Mantener una postura flexible le permitió adaptarse rápidamente a los cambios de la ola.", "level": 2},
    {"english": "He learned to read the wind and adjust his positioning accordingly.", "spanish": "Aprendió a leer el viento y ajustar su posición en consecuencia.", "level": 2},
    {"english": "Practicing late take-offs helped her improve timing on faster waves.", "spanish": "Practicar salidas tardías le ayudó a mejorar el tiempo en olas más rápidas.", "level": 2},
    {"english": "He refined his turns to maintain speed and flow on the wave.", "spanish": "Refinó sus giros para mantener velocidad y fluidez en la ola.", "level": 2},
    {"english": "Using the board’s rail effectively helped her control sharper turns.", "spanish": "Usar el canto de la tabla eficazmente la ayudó a controlar giros más cerrados.", "level": 2},
    {"english": "He learned to adjust paddle strokes to match the wave’s rhythm.", "spanish": "Aprendió a ajustar los remos para coincidir con el ritmo de la ola.", "level": 2},
    {"english": "Practicing in different swell directions increased his adaptability.", "spanish": "Practicar en diferentes direcciones del oleaje aumentó su adaptabilidad.", "level": 2},
    {"english": "She focused on weight distribution to enhance board control.", "spanish": "Se concentró en la distribución del peso para mejorar el control de la tabla.", "level": 2},
    {"english": "He anticipated changes in wave speed to stay ahead.", "spanish": "Anticipó cambios en la velocidad de la ola para mantenerse adelante.", "level": 2},
    {"english": "Practicing maneuvers repeatedly improved her consistency.", "spanish": "Practicar maniobras repetidamente mejoró su consistencia.", "level": 2},
    {"english": "He learned to pump the board efficiently to maintain momentum.", "spanish": "Aprendió a bombear la tabla eficientemente para mantener el impulso.", "level": 2},
    {"english": "Adjusting stance and body position allowed her to ride steeper waves.", "spanish": "Ajustar la postura y posición corporal le permitió surfear olas más inclinadas.", "level": 2},
    {"english": "He focused on smooth transitions between maneuvers to keep speed.", "spanish": "Se concentró en transiciones suaves entre maniobras para mantener la velocidad.", "level": 2},
    {"english": "Practicing in different sections of the wave helped her find the best line.", "spanish": "Practicar en diferentes secciones de la ola la ayudó a encontrar la mejor línea.", "level": 2},
    {"english": "He observed the wave’s shape to decide the optimal turn points.", "spanish": "Observó la forma de la ola para decidir los puntos óptimos de giro.", "level": 2},
    {"english": "Using subtle weight shifts improved control during fast rides.", "spanish": "Usar cambios sutiles de peso mejoró el control durante recorridos rápidos.", "level": 2},
    {"english": "He practiced reading the wave while paddling to choose the right timing.", "spanish": "Practicó leer la ola mientras remaba para elegir el momento adecuado.", "level": 2},
    {"english": "She learned to maintain flow by combining turns and trim.", "spanish": "Aprendió a mantener la fluidez combinando giros y trim.", "level": 2},
    {"english": "Practicing in slightly rough conditions prepared him for real surf situations.", "spanish": "Practicar en condiciones un poco agitadas lo preparó para situaciones reales de surf.", "level": 2},

    {"english": "He skillfully navigated the powerful waves, anticipating their shape and speed to execute precise maneuvers.", "spanish": "Navegó hábilmente las olas poderosas, anticipando su forma y velocidad para ejecutar maniobras precisas.", "level": 3},
    {"english": "Understanding the swell patterns allowed her to select the waves that offered the longest rides and smoothest faces.", "spanish": "Comprender los patrones del oleaje le permitió seleccionar las olas que ofrecían los recorridos más largos y las caras más suaves.", "level": 3},
    {"english": "He performed a series of cutbacks and bottom turns, maintaining optimal speed while avoiding wipeouts.", "spanish": "Realizó una serie de cortes y giros de fondo, manteniendo la velocidad óptima mientras evitaba caídas.", "level": 3},
    {"english": "She analyzed the wind and tide conditions to determine the ideal moment to paddle out beyond the breaking waves.", "spanish": "Analizó las condiciones de viento y marea para determinar el momento ideal de remar más allá de las olas rompientes.", "level": 3},
    {"english": "Maintaining a low center of gravity and subtle weight shifts allowed him to control the board on steep and fast-moving waves.", "spanish": "Mantener un centro de gravedad bajo y cambios sutiles de peso le permitió controlar la tabla en olas empinadas y rápidas.", "level": 3},
    {"english": "She executed a complex aerial maneuver, launching off the lip of the wave and landing smoothly back on the face.", "spanish": "Ejecutó una maniobra aérea compleja, despegando del labio de la ola y aterrizando suavemente en la cara.", "level": 3},
    {"english": "He anticipated the wave’s breaking point several seconds in advance, adjusting his line to maximize the ride.", "spanish": "Anticipó el punto de rompimiento de la ola varios segundos antes, ajustando su línea para maximizar el recorrido.", "level": 3},
    {"english": "Practicing in varying swell heights and directions improved her adaptability and decision-making in challenging conditions.", "spanish": "Practicar en diferentes alturas y direcciones del oleaje mejoró su adaptabilidad y toma de decisiones en condiciones desafiantes.", "level": 3},
    {"english": "He focused on combining speed, flow, and precise rail usage to execute advanced maneuvers on powerful waves.", "spanish": "Se concentró en combinar velocidad, fluidez y uso preciso del canto para ejecutar maniobras avanzadas en olas poderosas.", "level": 3},
    {"english": "She learned to read the subtle changes in swell direction to optimize her positioning on the wave.", "spanish": "Aprendió a leer los cambios sutiles en la dirección del oleaje para optimizar su posición sobre la ola.", "level": 3},
    {"english": "Executing backhand and frontside turns with finesse required perfect timing and balance.", "spanish": "Ejecutar giros de revés y frontales con destreza requería un tiempo y equilibrio perfectos.", "level": 3},
    {"english": "He used a combination of trimming and pumping to maintain momentum on flatter sections of the wave.", "spanish": "Usó una combinación de trimado y bombeo para mantener el impulso en secciones más planas de la ola.", "level": 3},
    {"english": "Reading the wave and anticipating its changes allowed her to perform multiple maneuvers in a single ride.", "spanish": "Leer la ola y anticipar sus cambios le permitió realizar múltiples maniobras en un solo recorrido.", "level": 3},
    {"english": "He practiced precise bottom turns to generate speed for powerful cutbacks on the wave’s shoulder.", "spanish": "Practicó giros de fondo precisos para generar velocidad en cortes potentes sobre el hombro de la ola.", "level": 3},
    {"english": "Maintaining fluid motion and weight distribution allowed her to link maneuvers seamlessly.", "spanish": "Mantener un movimiento fluido y una distribución adecuada del peso le permitió enlazar maniobras sin problemas.", "level": 3},
    {"english": "He refined his aerials by studying the wave’s lip and timing his pop-ups accurately.", "spanish": "Refinó sus maniobras aéreas estudiando el labio de la ola y sincronizando sus despegues con precisión.", "level": 3},
    {"english": "Practicing tube riding in hollow waves required perfect positioning and subtle adjustments of body weight.", "spanish": "Practicar el surf dentro del tubo en olas huecas requería una posición perfecta y ajustes sutiles del peso corporal.", "level": 3},
    {"english": "She focused on reading the wave’s energy to choose the optimal path for each ride.", "spanish": "Se concentró en leer la energía de la ola para elegir la trayectoria óptima en cada recorrido.", "level": 3},
    {"english": "He combined aggressive turns with smooth transitions to maintain speed and style.", "spanish": "Combinó giros agresivos con transiciones suaves para mantener velocidad y estilo.", "level": 3},
    {"english": "Anticipating the wave’s section changes allowed her to perform maneuvers at maximum efficiency.", "spanish": "Anticipar los cambios de sección de la ola le permitió realizar maniobras con máxima eficiencia.", "level": 3},
    {"english": "He learned to adjust the board’s angle dynamically to match the wave’s curve.", "spanish": "Aprendió a ajustar dinámicamente el ángulo de la tabla para coincidir con la curva de la ola.", "level": 3},
    {"english": "Practicing in challenging conditions enhanced her decision-making and confidence on big waves.", "spanish": "Practicar en condiciones desafiantes mejoró su toma de decisiones y confianza en olas grandes.", "level": 3},
    {"english": "He studied wave patterns to identify the sections with the most potential for maneuvers.", "spanish": "Estudió los patrones de las olas para identificar las secciones con mayor potencial para maniobras.", "level": 3},
    {"english": "She perfected her rail control to maintain stability while executing advanced carves.", "spanish": "Perfeccionó el control del canto para mantener la estabilidad mientras ejecutaba giros avanzados.", "level": 3},
    {"english": "He used subtle foot movements to adjust speed and trajectory mid-ride.", "spanish": "Usó movimientos sutiles de pies para ajustar la velocidad y trayectoria durante el recorrido.", "level": 3},
    {"english": "Practicing in different swell intervals helped her anticipate wave peaks and troughs.", "spanish": "Practicar en diferentes intervalos de oleaje la ayudó a anticipar crestas y valles de las olas.", "level": 3},
    {"english": "He mastered the timing of snap maneuvers to maintain flow and rhythm.", "spanish": "Dominó el tiempo de los giros cerrados para mantener fluidez y ritmo.", "level": 3},
    {"english": "Understanding the physics of wave energy allowed her to maximize her speed and control.", "spanish": "Comprender la física de la energía de la ola le permitió maximizar su velocidad y control.", "level": 3},
    {"english": "He practiced advanced cutbacks to maintain position in critical sections of the wave.", "spanish": "Practicó cortes avanzados para mantener la posición en secciones críticas de la ola.", "level": 3},
    {"english": "She learned to shift her weight dynamically to adapt to steep and hollow waves.", "spanish": "Aprendió a cambiar su peso dinámicamente para adaptarse a olas empinadas y huecas.", "level": 3},
    {"english": "He combined multiple maneuvers in a single ride, maintaining both speed and style.", "spanish": "Combinó múltiples maniobras en un solo recorrido, manteniendo velocidad y estilo.", "level": 3},
    {"english": "Practicing high-performance surfing required precise timing, balance, and wave reading.", "spanish": "Practicar surf de alto rendimiento requería sincronización precisa, equilibrio y lectura de la ola.", "level": 3},
    {"english": "She focused on anticipating the wave’s break to choose the optimal take-off spot.", "spanish": "Se concentró en anticipar el rompimiento de la ola para elegir el punto de salida óptimo.", "level": 3},
    {"english": "He refined his approach to barrels, ensuring perfect alignment and entry speed.", "spanish": "Refinó su enfoque en los tubos, asegurando alineación perfecta y velocidad de entrada.", "level": 3},
    {"english": "Maintaining composure under large, fast-moving waves allowed her to execute maneuvers confidently.", "spanish": "Mantener la compostura bajo olas grandes y rápidas le permitió ejecutar maniobras con confianza.", "level": 3},
    {"english": "He adjusted his paddle technique to conserve energy while reaching the lineup efficiently.", "spanish": "Ajustó su técnica de remo para conservar energía mientras llegaba al lineup eficientemente.", "level": 3},
    {"english": "Studying wave direction and wind patterns allowed her to select the cleanest waves.", "spanish": "Estudiar la dirección de las olas y los patrones de viento le permitió elegir las olas más limpias.", "level": 3},
    {"english": "He focused on combining fluid motion and aggressive maneuvers to maximize performance.", "spanish": "Se concentró en combinar movimiento fluido y maniobras agresivas para maximizar el rendimiento.", "level": 3},
    {"english": "She learned to anticipate wave behavior several seconds ahead, adjusting stance and speed.", "spanish": "Aprendió a anticipar el comportamiento de la ola varios segundos antes, ajustando postura y velocidad.", "level": 3},
    {"english": "Practicing advanced maneuvers under supervision improved both skill and safety.", "spanish": "Practicar maniobras avanzadas bajo supervisión mejoró tanto la habilidad como la seguridad.", "level": 3},
    {"english": "He used a combination of weight shifts and trimming to stay in the wave’s power zone.", "spanish": "Usó una combinación de cambios de peso y trimado para mantenerse en la zona de potencia de la ola.", "level": 3},
    {"english": "She perfected her approach to high-speed sections to maintain flow and stability.", "spanish": "Perfeccionó su enfoque en secciones de alta velocidad para mantener fluidez y estabilidad.", "level": 3},
    {"english": "Understanding the timing and shape of the wave allowed him to execute complex aerials successfully.", "spanish": "Comprender el tiempo y la forma de la ola le permitió ejecutar maniobras aéreas complejas con éxito.", "level": 3},
    {"english": "He practiced linking multiple maneuvers while preserving momentum and style.", "spanish": "Practicó enlazar múltiples maniobras mientras conservaba impulso y estilo.", "level": 3},
    {"english": "She learned to read subtle changes in swell to maintain optimal positioning.", "spanish": "Aprendió a leer cambios sutiles en el oleaje para mantener la posición óptima.", "level": 3},
    {"english": "Practicing under varying conditions enhanced his confidence and adaptability in all types of waves.", "spanish": "Practicar en condiciones variables mejoró su confianza y adaptabilidad en todo tipo de olas.", "level": 3},
    {"english": "He focused on rail-to-rail transitions to generate maximum speed while maintaining control.", "spanish": "Se concentró en transiciones canto a canto para generar máxima velocidad mientras mantenía el control.", "level": 3},
    {"english": "She anticipated the wave’s energy changes to perform multiple maneuvers fluidly.", "spanish": "Anticipó los cambios de energía de la ola para realizar múltiples maniobras con fluidez.", "level": 3},
    {"english": "He refined his tube riding technique by adjusting speed and body position dynamically.", "spanish": "Refinó su técnica en tubos ajustando dinámicamente la velocidad y la posición corporal.", "level": 3},
    {"english": "Maintaining rhythm and flow between maneuvers allowed her to ride longer waves effectively.", "spanish": "Mantener el ritmo y la fluidez entre maniobras le permitió surfear olas más largas eficazmente.", "level": 3},
    {"english": "He used observation of other surfers to improve strategy and wave selection.", "spanish": "Usó la observación de otros surfistas para mejorar la estrategia y la selección de olas.", "level": 3},
    {"english": "Practicing advanced maneuvers in hollow waves built both skill and confidence.", "spanish": "Practicar maniobras avanzadas en olas huecas desarrolló tanto habilidad como confianza.", "level": 3},
    {"english": "She combined aggressive snaps with smooth carves to maintain energy through the wave.", "spanish": "Combinó giros agresivos con tallas suaves para mantener la energía durante la ola.", "level": 3},
    {"english": "He adapted his technique to varying swell heights to consistently perform at a high level.", "spanish": "Adaptó su técnica a diferentes alturas de oleaje para rendir consistentemente a alto nivel.", "level": 3},
    {"english": "Reading the wave’s power zones allowed her to position perfectly for optimal maneuvers.", "spanish": "Leer las zonas de potencia de la ola le permitió posicionarse perfectamente para maniobras óptimas.", "level": 3},
    {"english": "He mastered combining timing, balance, and speed to execute complex wave sequences.", "spanish": "Dominó la combinación de tiempo, equilibrio y velocidad para ejecutar secuencias complejas de olas.", "level": 3},
    {"english": "Practicing under changing tides enhanced her awareness and responsiveness.", "spanish": "Practicar bajo mareas cambiantes mejoró su conciencia y capacidad de reacción.", "level": 3},
    {"english": "He focused on minimizing drag while maximizing momentum during tight maneuvers.", "spanish": "Se concentró en minimizar la resistencia mientras maximizaba el impulso durante maniobras cerradas.", "level": 3},
    {"english": "She refined her take-off technique to handle steeper and faster waves.", "spanish": "Refinó su técnica de salida para manejar olas más empinadas y rápidas.", "level": 3},
    {"english": "He analyzed the wave’s face to identify the best moments for top turns and cutbacks.", "spanish": "Analizó la cara de la ola para identificar los mejores momentos para giros superiores y cortes.", "level": 3},
    {"english": "Practicing with a focus on flow allowed her to combine maneuvers seamlessly.", "spanish": "Practicar con un enfoque en la fluidez le permitió combinar maniobras sin problemas.", "level": 3},
    {"english": "He learned to adjust weight distribution precisely to maintain control on critical sections.", "spanish": "Aprendió a ajustar la distribución del peso con precisión para mantener el control en secciones críticas.", "level": 3},
    {"english": "She anticipated changes in wave energy to execute high-level maneuvers consistently.", "spanish": "Anticipó cambios en la energía de la ola para ejecutar maniobras de alto nivel consistentemente.", "level": 3},
    {"english": "He focused on linking bottom turns, top turns, and cutbacks fluidly.", "spanish": "Se concentró en enlazar giros de fondo, giros superiores y cortes de manera fluida.", "level": 3},
    {"english": "Practicing on long, powerful waves helped her develop advanced wave reading skills.", "spanish": "Practicar en olas largas y potentes le ayudó a desarrollar habilidades avanzadas de lectura de ola.", "level": 3},
    {"english": "He refined aerial maneuvers by studying wave lip geometry and timing take-offs perfectly.", "spanish": "Refinó las maniobras aéreas estudiando la geometría del labio de la ola y sincronizando los despegues a la perfección.", "level": 3},
    {"english": "She maintained flow and style while performing multiple advanced maneuvers in succession.", "spanish": "Mantuvo fluidez y estilo mientras realizaba múltiples maniobras avanzadas en sucesión.", "level": 3},
    {"english": "He used subtle adjustments in stance and rail pressure to navigate steep and hollow waves.", "spanish": "Usó ajustes sutiles en la postura y presión del canto para navegar olas empinadas y huecas.", "level": 3},
    {"english": "Practicing in variable swell and wind conditions enhanced her overall surfing strategy.", "spanish": "Practicar en condiciones variables de oleaje y viento mejoró su estrategia general de surf.", "level": 3}
  
 
  ],
  "football": [
    {"english": "He scored a goal.", "spanish": "Él marcó un gol.", "level": 1},
    {"english": "The player passed the ball to his teammate.", "spanish": "El jugador pasó la pelota a su compañero.", "level": 1},
    {"english": "She kicked the ball into the net.", "spanish": "Ella pateó la pelota hacia la portería.", "level": 1},
    {"english": "The team is practicing on the field.", "spanish": "El equipo está practicando en el campo.", "level": 1},
    {"english": "He is the goalkeeper.", "spanish": "Él es el portero.", "level": 1},
    {"english": "They are playing a match today.", "spanish": "Están jugando un partido hoy.", "level": 1},
    {"english": "The referee blew the whistle.", "spanish": "El árbitro sopló el silbato.", "level": 1},
    {"english": "She scored her first goal.", "spanish": "Ella marcó su primer gol.", "level": 1},
    {"english": "He dribbled past the defenders.", "spanish": "Él dribló a los defensores.", "level": 1},
    {"english": "The ball is in the corner.", "spanish": "La pelota está en la esquina.", "level": 1},
    {"english": "He celebrated after scoring.", "spanish": "Él celebró después de marcar.", "level": 1},
    {"english": "The team is winning.", "spanish": "El equipo está ganando.", "level": 1},
    {"english": "She passed the ball quickly.", "spanish": "Ella pasó la pelota rápidamente.", "level": 1},
    {"english": "The fans are cheering.", "spanish": "Los aficionados están animando.", "level": 1},
    {"english": "He saved a penalty.", "spanish": "Él detuvo un penalti.", "level": 1},
    {"english": "The coach gave instructions.", "spanish": "El entrenador dio instrucciones.", "level": 1},
    {"english": "They are training every day.", "spanish": "Están entrenando todos los días.", "level": 1},
    {"english": "The match ended in a draw.", "spanish": "El partido terminó en empate.", "level": 1},
    {"english": "He passed the ball to the forward.", "spanish": "Él pasó la pelota al delantero.", "level": 1},
    {"english": "She blocked the shot.", "spanish": "Ella bloqueó el tiro.", "level": 1},
    {"english": "The referee showed a yellow card.", "spanish": "El árbitro mostró una tarjeta amarilla.", "level": 1},
    {"english": "He scored from outside the box.", "spanish": "Él marcó desde fuera del área.", "level": 1},
    {"english": "They are preparing for the next match.", "spanish": "Se están preparando para el próximo partido.", "level": 1},
    {"english": "The striker missed the goal.", "spanish": "El delantero falló el gol.", "level": 1},
    {"english": "He ran fast down the wing.", "spanish": "Él corrió rápido por la banda.", "level": 1},
    {"english": "The team is defending well.", "spanish": "El equipo está defendiendo bien.", "level": 1},
    {"english": "She scored with a header.", "spanish": "Ella marcó de cabeza.", "level": 1},
    {"english": "The goalkeeper caught the ball.", "spanish": "El portero atrapó la pelota.", "level": 1},
    {"english": "He made a great pass.", "spanish": "Él hizo un gran pase.", "level": 1},
    {"english": "The players are warming up.", "spanish": "Los jugadores están calentando.", "level": 1},
    {"english": "The referee stopped the game.", "spanish": "El árbitro detuvo el juego.", "level": 1},
    {"english": "She is a skilled midfielder.", "spanish": "Ella es una mediocampista habilidosa.", "level": 1},
    {"english": "The ball went out of bounds.", "spanish": "La pelota salió del campo.", "level": 1},
    {"english": "He made a tackle.", "spanish": "Él hizo una entrada.", "level": 1},
    {"english": "The team celebrated the victory.", "spanish": "El equipo celebró la victoria.", "level": 1},
    {"english": "She assisted in the goal.", "spanish": "Ella asistió en el gol.", "level": 1},
    {"english": "He kicked the ball hard.", "spanish": "Él pateó la pelota fuerte.", "level": 1},
    {"english": "The defender cleared the ball.", "spanish": "El defensor despejó la pelota.", "level": 1},
    {"english": "They are playing in the stadium.", "spanish": "Están jugando en el estadio.", "level": 1},
    {"english": "The team is losing.", "spanish": "El equipo está perdiendo.", "level": 1},
    {"english": "He is a fast winger.", "spanish": "Él es un extremo rápido.", "level": 1},
    {"english": "She made a strong shot.", "spanish": "Ella hizo un tiro fuerte.", "level": 1},
    {"english": "The referee gave a free kick.", "spanish": "El árbitro dio un tiro libre.", "level": 1},
    {"english": "He controlled the ball well.", "spanish": "Él controló bien la pelota.", "level": 1},
    {"english": "The team scored two goals.", "spanish": "El equipo marcó dos goles.", "level": 1},
    {"english": "She passed the ball accurately.", "spanish": "Ella pasó la pelota con precisión.", "level": 1},
    {"english": "The goalkeeper dived to save it.", "spanish": "El portero se lanzó para salvarla.", "level": 1},
    {"english": "He is playing in defense.", "spanish": "Él está jugando en defensa.", "level": 1},
    {"english": "They practiced penalty kicks.", "spanish": "Practicaron penales.", "level": 1},
    {"english": "She dribbled past her opponent.", "spanish": "Ella dribló a su oponente.", "level": 1},
    {"english": "The ball rolled across the field.", "spanish": "La pelota rodó por el campo.", "level": 1},
    {"english": "He took a corner kick.", "spanish": "Él lanzó un tiro de esquina.", "level": 1},
    {"english": "The striker is ready to shoot.", "spanish": "El delantero está listo para disparar.", "level": 1},
    {"english": "She defended her goal successfully.", "spanish": "Ella defendió su portería con éxito.", "level": 1},
    {"english": "The team trained together.", "spanish": "El equipo entrenó junto.", "level": 1},
    {"english": "He passed the ball under pressure.", "spanish": "Él pasó la pelota bajo presión.", "level": 1},
    {"english": "The referee blew for a foul.", "spanish": "El árbitro pitó una falta.", "level": 1},
    {"english": "She is practicing free kicks.", "spanish": "Ella está practicando tiros libres.", "level": 1},
    {"english": "He kicked the ball into the goal.", "spanish": "Él pateó la pelota hacia el gol.", "level": 1},
    {"english": "The team is preparing for the tournament.", "spanish": "El equipo se está preparando para el torneo.", "level": 1},
    {"english": "She passed quickly to the forward.", "spanish": "Ella pasó rápidamente al delantero.", "level": 1},
    {"english": "He is the captain of the team.", "spanish": "Él es el capitán del equipo.", "level": 1},
    {"english": "The fans are celebrating the goal.", "spanish": "Los aficionados están celebrando el gol.", "level": 1},
    {"english": "She blocked the ball from entering the goal.", "spanish": "Ella bloqueó la pelota para que no entrara al gol.", "level": 1},
    {"english": "He tackled the opponent fairly.", "spanish": "Él hizo una entrada limpia al oponente.", "level": 1},
    {"english": "The team won the match.", "spanish": "El equipo ganó el partido.", "level": 1},
    {"english": "She dribbled down the field.", "spanish": "Ella dribló por el campo.", "level": 1},
    {"english": "He scored a goal from a free kick.", "spanish": "Él marcó un gol de tiro libre.", "level": 1},
    {"english": "The goalkeeper kicked the ball far.", "spanish": "El portero pateó la pelota lejos.", "level": 1},
    {"english": "The team practiced passing drills.", "spanish": "El equipo practicó ejercicios de pase.", "level": 1},
    {"english": "She is running fast to reach the ball.", "spanish": "Ella corre rápido para alcanzar la pelota.", "level": 1},
    {"english": "He dribbled past the defender.", "spanish": "Él dribló al defensor.", "level": 1},
    {"english": "The match started on time.", "spanish": "El partido comenzó a tiempo.", "level": 1},
    {"english": "She scored in the last minute.", "spanish": "Ella marcó en el último minuto.", "level": 1},
    {"english": "He is practicing shooting.", "spanish": "Él está practicando disparos.", "level": 1},
    {"english": "The team is defending the lead.", "spanish": "El equipo está defendiendo la ventaja.", "level": 1},
    {"english": "She passed to the winger.", "spanish": "Ella pasó al extremo.", "level": 1},
    {"english": "He ran past the midfielders.", "spanish": "Él corrió pasando a los mediocampistas.", "level": 1},
    {"english": "The fans are singing in the stands.", "spanish": "Los aficionados están cantando en las gradas.", "level": 1},
    {"english": "She took the ball from her opponent.", "spanish": "Ella tomó la pelota de su oponente.", "level": 1},
    {"english": "He scored a header goal.", "spanish": "Él marcó un gol de cabeza.", "level": 1},
    {"english": "The coach is giving advice.", "spanish": "El entrenador está dando consejos.", "level": 1},
    {"english": "She is celebrating the victory.", "spanish": "Ella está celebrando la victoria.", "level": 1},
    {"english": "He passed to the captain.", "spanish": "Él pasó al capitán.", "level": 1},
    {"english": "The goalkeeper is jumping to catch the ball.", "spanish": "El portero está saltando para atrapar la pelota.", "level": 1},
    {"english": "She shot the ball into the goal.", "spanish": "Ella disparó la pelota hacia el gol.", "level": 1},
    {"english": "The team is playing well.", "spanish": "El equipo está jugando bien.", "level": 1},
    {"english": "He is controlling the ball in the midfield.", "spanish": "Él está controlando la pelota en el mediocampo.", "level": 1},
    {"english": "She defended against the striker.", "spanish": "Ella defendió contra el delantero.", "level": 1},
    {"english": "The referee is watching the play closely.", "spanish": "El árbitro está observando la jugada de cerca.", "level": 1},
    {"english": "He ran to intercept the ball.", "spanish": "Él corrió para interceptar la pelota.", "level": 1},
    {"english": "The team scored a goal quickly.", "spanish": "El equipo marcó un gol rápidamente.", "level": 1},
    {"english": "She dribbled around the defenders.", "spanish": "Ella dribló alrededor de los defensores.", "level": 1},
    {"english": "He is practicing long passes.", "spanish": "Él está practicando pases largos.", "level": 1},
    {"english": "The goalkeeper saved the shot easily.", "spanish": "El portero detuvo el tiro fácilmente.", "level": 1},
    {"english": "She kicked the ball to the corner.", "spanish": "Ella pateó la pelota hacia la esquina.", "level": 1},
    {"english": "He passed quickly to avoid losing the ball.", "spanish": "Él pasó rápidamente para no perder la pelota.", "level": 1},
    {"english": "The team is preparing to attack.", "spanish": "El equipo se está preparando para atacar.", "level": 1},
    {"english": "She is a fast forward.", "spanish": "Ella es una delantera rápida.", "level": 1},
    {"english": "He is defending his goal carefully.", "spanish": "Él está defendiendo su portería cuidadosamente.", "level": 1},
    {"english": "The referee signaled a throw-in.", "spanish": "El árbitro señaló un saque de banda.", "level": 1},
    {"english": "She passed the ball to the midfielder.", "spanish": "Ella pasó la pelota al mediocampista.", "level": 1},
    {"english": "He scored from a corner kick.", "spanish": "Él marcó desde un tiro de esquina.", "level": 1},
    {"english": "The team is training hard.", "spanish": "El equipo está entrenando duro.", "level": 1},
    {"english": "She is practicing dribbling skills.", "spanish": "Ella está practicando habilidades de dribbling.", "level": 1},
    {"english": "He kicked the ball towards the goal.", "spanish": "Él pateó la pelota hacia el gol.", "level": 1},
    {"english": "The goalkeeper is preparing to dive.", "spanish": "El portero se está preparando para lanzarse.", "level": 1},
    {"english": "She assisted the striker.", "spanish": "Ella asistió al delantero.", "level": 1},
    {"english": "He is running to receive the ball.", "spanish": "Él está corriendo para recibir la pelota.", "level": 1},

    {"english": "The coach decided to change the formation at halftime.", "spanish": "El entrenador decidió cambiar la formación en el entretiempo.", "level": 2},
    {"english": "He dribbled past three defenders before shooting.", "spanish": "Él dribló a tres defensores antes de disparar.", "level": 2},
    {"english": "The striker received a perfect through ball.", "spanish": "El delantero recibió un pase filtrado perfecto.", "level": 2},
    {"english": "She timed her run to avoid being offside.", "spanish": "Ella calculó su carrera para no quedar en fuera de juego.", "level": 2},
    {"english": "The goalkeeper made a crucial save in the last minute.", "spanish": "El portero hizo una atajada crucial en el último minuto.", "level": 2},
    {"english": "The midfielder controlled the tempo of the game.", "spanish": "El mediocampista controló el ritmo del juego.", "level": 2},
    {"english": "He volleyed the ball into the top corner.", "spanish": "Él remató de volea al ángulo superior.", "level": 2},
    {"english": "The team is focusing on building from the back.", "spanish": "El equipo se está enfocando en construir desde la defensa.", "level": 2},
    {"english": "She made an accurate long pass to the winger.", "spanish": "Ella hizo un pase largo preciso al extremo.", "level": 2},
    {"english": "The referee awarded a penalty after a handball.", "spanish": "El árbitro otorgó un penal tras una mano.", "level": 2},
    {"english": "He intercepted the ball in the midfield.", "spanish": "Él interceptó la pelota en el mediocampo.", "level": 2},
    {"english": "The team is pressing high to win the ball back.", "spanish": "El equipo está presionando alto para recuperar la pelota.", "level": 2},
    {"english": "She took a powerful shot from outside the box.", "spanish": "Ella disparó con potencia desde fuera del área.", "level": 2},
    {"english": "The defender blocked the cross effectively.", "spanish": "El defensor bloqueó el centro de manera efectiva.", "level": 2},
    {"english": "He made a sliding tackle to stop the attacker.", "spanish": "Él hizo una entrada deslizante para detener al atacante.", "level": 2},
    {"english": "The winger delivered a perfect cross into the box.", "spanish": "El extremo envió un centro perfecto al área.", "level": 2},
    {"english": "She anticipated the pass and intercepted it.", "spanish": "Ella anticipó el pase y lo interceptó.", "level": 2},
    {"english": "The team is trying to exploit the opponent's weak side.", "spanish": "El equipo está intentando explotar el lado débil del rival.", "level": 2},
    {"english": "He chipped the ball over the goalkeeper.", "spanish": "Él picó la pelota sobre el portero.", "level": 2},
    {"english": "The midfielder delivered a clever through ball.", "spanish": "El mediocampista entregó un pase filtrado inteligente.", "level": 2},
    {"english": "She dribbled skillfully through the defense.", "spanish": "Ella dribló hábilmente a través de la defensa.", "level": 2},
    {"english": "The team is maintaining possession to control the game.", "spanish": "El equipo está manteniendo la posesión para controlar el juego.", "level": 2},
    {"english": "He scored with a precise curling shot.", "spanish": "Él marcó con un tiro curvado preciso.", "level": 2},
    {"english": "The goalkeeper rushed out to clear the ball.", "spanish": "El portero salió rápido para despejar la pelota.", "level": 2},
    {"english": "She made a tactical foul to stop a counterattack.", "spanish": "Ella cometió una falta táctica para detener un contraataque.", "level": 2},
    {"english": "The team adjusted their defensive line.", "spanish": "El equipo ajustó su línea defensiva.", "level": 2},
    {"english": "He took a quick free kick catching the opponents off guard.", "spanish": "Él lanzó un tiro libre rápido tomando por sorpresa a los rivales.", "level": 2},
    {"english": "The forward timed his run perfectly.", "spanish": "El delantero calculó su carrera a la perfección.", "level": 2},
    {"english": "She pressed the opponent to win the ball back.", "spanish": "Ella presionó al oponente para recuperar la pelota.", "level": 2},
    {"english": "The team is exploiting the flanks effectively.", "spanish": "El equipo está explotando las bandas de manera efectiva.", "level": 2},
    {"english": "He played a one-two with his teammate.", "spanish": "Él hizo un uno-dos con su compañero.", "level": 2},
    {"english": "The goalkeeper distributed the ball quickly to start a counterattack.", "spanish": "El portero distribuyó rápidamente la pelota para iniciar un contraataque.", "level": 2},
    {"english": "She made a decisive interception in midfield.", "spanish": "Ella hizo una intercepción decisiva en el mediocampo.", "level": 2},
    {"english": "The team is using a high defensive line.", "spanish": "El equipo está usando una línea defensiva alta.", "level": 2},
    {"english": "He executed a perfect bicycle kick.", "spanish": "Él ejecutó una chilena perfecta.", "level": 2},
    {"english": "The winger cut inside to create space.", "spanish": "El extremo se metió hacia adentro para crear espacio.", "level": 2},
    {"english": "She maintained possession under pressure.", "spanish": "Ella mantuvo la posesión bajo presión.", "level": 2},
    {"english": "The team is rotating the ball to tire the opponent.", "spanish": "El equipo está rotando la pelota para cansar al oponente.", "level": 2},
    {"english": "He delivered a cross with pace and accuracy.", "spanish": "Él entregó un centro con velocidad y precisión.", "level": 2},
    {"english": "The midfielder launched a long ball to the striker.", "spanish": "El mediocampista lanzó un pase largo al delantero.", "level": 2},
    {"english": "She cut off the passing lane effectively.", "spanish": "Ella cortó la línea de pase de manera efectiva.", "level": 2},
    {"english": "The team is exploiting numerical superiority in attack.", "spanish": "El equipo está explotando la superioridad numérica en ataque.", "level": 2},
    {"english": "He positioned himself well to receive the ball.", "spanish": "Él se posicionó bien para recibir la pelota.", "level": 2},
    {"english": "The goalkeeper parried the shot away from danger.", "spanish": "El portero desvió el tiro fuera de peligro.", "level": 2},
    {"english": "She switched the play to the opposite wing.", "spanish": "Ella cambió el juego hacia la banda opuesta.", "level": 2},
    {"english": "The defender marked the striker tightly.", "spanish": "El defensor marcó al delantero de cerca.", "level": 2},
    {"english": "He made a perfectly timed tackle.", "spanish": "Él hizo una entrada perfectamente cronometrada.", "level": 2},
    {"english": "The team is using overlapping runs to create width.", "spanish": "El equipo está usando desdoblamientos para crear amplitud.", "level": 2},
    {"english": "She received the ball in space and turned quickly.", "spanish": "Ella recibió la pelota en espacio y giró rápidamente.", "level": 2},
    {"english": "The forward found the back of the net with a low shot.", "spanish": "El delantero encontró la red con un tiro bajo.", "level": 2},
    {"english": "He controlled a difficult pass skillfully.", "spanish": "Él controló un pase difícil con habilidad.", "level": 2},
    {"english": "The midfielder created a chance with a clever pass.", "spanish": "El mediocampista creó una oportunidad con un pase inteligente.", "level": 2},
    {"english": "She pressed high to force a mistake.", "spanish": "Ella presionó alto para forzar un error.", "level": 2},
    {"english": "The team is keeping a compact shape defensively.", "spanish": "El equipo mantiene una forma compacta en defensa.", "level": 2},
    {"english": "He executed a quick one-touch pass.", "spanish": "Él ejecutó un pase de un toque rápido.", "level": 2},
    {"english": "The striker made a run behind the defense.", "spanish": "El delantero hizo una carrera detrás de la defensa.", "level": 2},
    {"english": "She combined well with her teammates.", "spanish": "Ella combinó bien con sus compañeras.", "level": 2},
    {"english": "The goalkeeper caught a powerful header.", "spanish": "El portero atrapó un cabezazo potente.", "level": 2},
    {"english": "He switched the play to exploit space.", "spanish": "Él cambió el juego para explotar el espacio.", "level": 2},
    {"english": "The defender anticipated the striker's movement.", "spanish": "El defensor anticipó el movimiento del delantero.", "level": 2},
    {"english": "She dribbled skillfully to break the defensive line.", "spanish": "Ella dribló hábilmente para romper la línea defensiva.", "level": 2},
    {"english": "The team is practicing set pieces.", "spanish": "El equipo está practicando jugadas a balón parado.", "level": 2},
    {"english": "He passed quickly to exploit the gap in defense.", "spanish": "Él pasó rápido para explotar el hueco en la defensa.", "level": 2},
    {"english": "The striker took a well-timed shot.", "spanish": "El delantero hizo un disparo bien cronometrado.", "level": 2},
    {"english": "She delivered a precise cross to the penalty area.", "spanish": "Ella envió un centro preciso al área de penalti.", "level": 2},
    {"english": "The midfielder controlled the ball under pressure.", "spanish": "El mediocampista controló la pelota bajo presión.", "level": 2},
    {"english": "He made a decisive run into the box.", "spanish": "Él hizo una carrera decisiva al área.", "level": 2},
    {"english": "The goalkeeper launched a counterattack with a long throw.", "spanish": "El portero inició un contraataque con un saque largo.", "level": 2},
    {"english": "She took advantage of the defensive error.", "spanish": "Ella aprovechó el error defensivo.", "level": 2},
    {"english": "The team is focusing on quick transitions.", "spanish": "El equipo se está enfocando en transiciones rápidas.", "level": 2},
    {"english": "He played a clever ball over the top.", "spanish": "Él jugó un balón inteligente por encima de la defensa.", "level": 2},
    {"english": "The midfielder tracked back to help defensively.", "spanish": "El mediocampista retrocedió para ayudar en defensa.", "level": 2},
    {"english": "She is positioning herself to receive the ball.", "spanish": "Ella se está posicionando para recibir la pelota.", "level": 2},
    {"english": "The team used a quick throw-in to catch the opponents off guard.", "spanish": "El equipo utilizó un saque de banda rápido para sorprender a los rivales.", "level": 2},
    {"english": "He made a sliding clearance from the goal line.", "spanish": "Él despejó de manera deslizante desde la línea de gol.", "level": 2},
    {"english": "The forward exploited the gap between defenders.", "spanish": "El delantero explotó el hueco entre defensores.", "level": 2},
    {"english": "She created space by dragging a defender out of position.", "spanish": "Ella creó espacio arrastrando a un defensor fuera de posición.", "level": 2},
    {"english": "The goalkeeper punched the ball away under pressure.", "spanish": "El portero golpeó la pelota lejos bajo presión.", "level": 2},
    {"english": "He timed his tackle perfectly to win the ball.", "spanish": "Él calculó su entrada a la perfección para recuperar la pelota.", "level": 2},
    {"english": "The team maintained high intensity throughout the match.", "spanish": "El equipo mantuvo alta intensidad durante todo el partido.", "level": 2},
    {"english": "She played a clever one-two to bypass the defense.", "spanish": "Ella hizo un uno-dos inteligente para superar la defensa.", "level": 2},
    {"english": "The midfielder controlled the ball with composure.", "spanish": "El mediocampista controló la pelota con calma.", "level": 2},
    {"english": "He exploited the counterattack to score a goal.", "spanish": "Él explotó el contraataque para marcar un gol.", "level": 2},
    {"english": "The team is practicing defensive organization.", "spanish": "El equipo está practicando la organización defensiva.", "level": 2},
    {"english": "She delivered a perfectly weighted pass.", "spanish": "Ella entregó un pase perfectamente medido.", "level": 2},
    {"english": "He executed a perfectly timed run.", "spanish": "Él ejecutó una carrera perfectamente cronometrada.", "level": 2},
    {"english": "The goalkeeper anticipated the striker's shot.", "spanish": "El portero anticipó el tiro del delantero.", "level": 2},
    {"english": "She combined with her teammates to create a scoring opportunity.", "spanish": "Ella combinó con sus compañeras para crear una oportunidad de gol.", "level": 2},
    {"english": "The defender covered the space effectively.", "spanish": "El defensor cubrió el espacio de manera efectiva.", "level": 2},
    {"english": "He struck the ball with accuracy and power.", "spanish": "Él golpeó la pelota con precisión y potencia.", "level": 2},
    {"english": "The team is controlling the midfield to dominate possession.", "spanish": "El equipo está controlando el mediocampo para dominar la posesión.", "level": 2},
    {"english": "She made a well-timed interception to stop the attack.", "spanish": "Ella hizo una intercepción bien cronometrada para detener el ataque.", "level": 2},
    {"english": "He received the ball in a dangerous position.", "spanish": "Él recibió la pelota en una posición peligrosa.", "level": 2},

    {"english": "Despite the heavy rain, the striker maintained his focus and scored a decisive goal.", "spanish": "A pesar de la fuerte lluvia, el delantero mantuvo su concentración y marcó un gol decisivo.", "level": 3},
    {"english": "The midfielder orchestrated the attack, switching play multiple times to exploit gaps in the opponent's formation.", "spanish": "El mediocampista orquestó el ataque, cambiando el juego varias veces para explotar los huecos en la formación del oponente.", "level": 3},
    {"english": "He anticipated the opponent's counterattack and positioned himself perfectly to intercept the ball.", "spanish": "Él anticipó el contraataque del oponente y se posicionó perfectamente para interceptar la pelota.", "level": 3},
    {"english": "The team executed a series of quick one-touch passes, breaking through the tightly packed defense.", "spanish": "El equipo ejecutó una serie de pases de un toque rápido, rompiendo la defensa compacta.", "level": 3},
    {"english": "She delivered a perfectly weighted cross while under pressure, allowing the striker to score with a header.", "spanish": "Ella entregó un centro perfectamente medido bajo presión, permitiendo al delantero marcar con un cabezazo.", "level": 3},
    {"english": "The goalkeeper made a spectacular save, diving full stretch to stop a powerful shot from outside the box.", "spanish": "El portero realizó una espectacular atajada, lanzándose por completo para detener un potente disparo desde fuera del área.", "level": 3},
    {"english": "He executed a clever dummy to deceive the defender and create space for a shot on goal.", "spanish": "Él ejecutó una finta inteligente para engañar al defensor y crear espacio para un disparo a portería.", "level": 3},
    {"english": "The winger exploited the high defensive line, timing his run perfectly to receive the through ball.", "spanish": "El extremo explotó la línea defensiva alta, calculando su carrera a la perfección para recibir el pase filtrado.", "level": 3},
    {"english": "Despite being marked tightly, she managed to control the ball and play a precise pass to the overlapping teammate.", "spanish": "A pesar de estar marcada de cerca, ella logró controlar la pelota y hacer un pase preciso a la compañera que se desdoblaba.", "level": 3},
    {"english": "The team maintained possession for several minutes, patiently probing the defense for a weakness.", "spanish": "El equipo mantuvo la posesión durante varios minutos, buscando pacientemente una debilidad en la defensa.", "level": 3},
    {"english": "He chipped the ball over the goalkeeper, executing a technically perfect finish.", "spanish": "Él picó la pelota sobre el portero, ejecutando una finalización técnicamente perfecta.", "level": 3},
    {"english": "The defender tracked back quickly to prevent a dangerous break, tackling the striker cleanly without committing a foul.", "spanish": "El defensor retrocedió rápidamente para evitar un contraataque peligroso, desarmando al delantero limpiamente sin cometer falta.", "level": 3},
    {"english": "She read the opponent's movement brilliantly, intercepting a pass that could have led to a goal.", "spanish": "Ella leyó brillantemente el movimiento del oponente, interceptando un pase que podría haber llevado a un gol.", "level": 3},
    {"english": "The striker timed his run to perfection, avoiding the offside trap and finishing clinically.", "spanish": "El delantero calculó su carrera a la perfección, evitando el fuera de juego y definiendo clínicamente.", "level": 3},
    {"english": "He executed a quick one-two with the midfielder, opening space to deliver a precise shot on goal.", "spanish": "Él ejecutó un rápido uno-dos con el mediocampista, abriendo espacio para un disparo preciso a portería.", "level": 3},
    {"english": "The team applied high pressing throughout the match, forcing the opponents into mistakes in dangerous areas.", "spanish": "El equipo aplicó una presión alta durante todo el partido, forzando a los oponentes a cometer errores en zonas peligrosas.", "level": 3},
    {"english": "Despite fatigue, he maintained concentration and made the decisive assist in the final minutes.", "spanish": "A pesar del cansancio, él mantuvo la concentración e hizo la asistencia decisiva en los minutos finales.", "level": 3},
    {"english": "She executed a perfect slide tackle, winning the ball cleanly while avoiding any contact with the opponent.", "spanish": "Ella ejecutó una entrada deslizante perfecta, ganando la pelota limpiamente mientras evitaba cualquier contacto con la rival.", "level": 3},
    {"english": "The goalkeeper distributed the ball with precision, initiating a fast counterattack that caught the opposition off guard.", "spanish": "El portero distribuyó la pelota con precisión, iniciando un contraataque rápido que tomó por sorpresa a la oposición.", "level": 3},
    {"english": "He adjusted his positioning dynamically, anticipating both the ball and the opponent's movement.", "spanish": "Él ajustó su posicionamiento de manera dinámica, anticipando tanto la pelota como el movimiento del oponente.", "level": 3},
    {"english": "The midfielder threaded a perfectly timed pass through a crowded defense, setting up a clear chance for the striker.", "spanish": "El mediocampista filtró un pase perfectamente cronometrado a través de una defensa congestionada, creando una oportunidad clara para el delantero.", "level": 3},
    {"english": "Despite intense marking, she managed to turn and deliver a shot that narrowly missed the top corner.", "spanish": "A pesar de una marcación intensa, ella logró girar y disparar, fallando por poco el ángulo superior.", "level": 3},
    {"english": "The team executed a well-rehearsed set piece, confusing the defense and scoring from a corner.", "spanish": "El equipo ejecutó una jugada a balón parado bien ensayada, confundiendo a la defensa y marcando desde un córner.", "level": 3},
    {"english": "He controlled the ball under pressure and delivered a through ball splitting the defense.", "spanish": "Él controló la pelota bajo presión y realizó un pase filtrado que partió la defensa.", "level": 3},
    {"english": "She maintained perfect composure while taking the penalty, placing the ball in the top corner.", "spanish": "Ella mantuvo una compostura perfecta al ejecutar el penal, colocando la pelota en el ángulo superior.", "level": 3},
    {"english": "The defender anticipated the cross, positioning himself to clear the ball with authority.", "spanish": "El defensor anticipó el centro, posicionándose para despejar la pelota con autoridad.", "level": 3},
    {"english": "He exploited the half-space between defenders to receive the ball and create a scoring opportunity.", "spanish": "Él explotó el espacio entre los defensores para recibir la pelota y crear una oportunidad de gol.", "level": 3},
    {"english": "The goalkeeper remained calm under pressure, making a series of crucial saves.", "spanish": "El portero permaneció calmado bajo presión, realizando una serie de atajadas cruciales.", "level": 3},
    {"english": "She performed a deceptive dribble, creating enough space to take a shot from outside the box.", "spanish": "Ella realizó un regate engañoso, creando suficiente espacio para disparar desde fuera del área.", "level": 3},
    {"english": "The team rotated possession effectively, stretching the defense and creating gaps.", "spanish": "El equipo rotó la posesión de manera efectiva, estirando la defensa y creando huecos.", "level": 3},
    {"english": "He executed a perfectly timed header, directing the ball into the far corner.", "spanish": "Él ejecutó un cabezazo perfectamente cronometrado, dirigiendo la pelota al ángulo lejano.", "level": 3},
    {"english": "The striker read the goalkeeper's movement and calmly slotted the ball into the net.", "spanish": "El delantero leyó el movimiento del portero y colocó la pelota con calma en la red.", "level": 3},
    {"english": "She pressured the ball carrier relentlessly, forcing an error in a dangerous position.", "spanish": "Ella presionó al portador de la pelota sin descanso, forzando un error en una posición peligrosa.", "level": 3},
    {"english": "The team exploited the opposition's weak side, switching play multiple times to create an overload.", "spanish": "El equipo explotó el lado débil de la oposición, cambiando el juego varias veces para crear superioridad numérica.", "level": 3},
    {"english": "He used clever movement to drag defenders out of position, opening space for his teammates.", "spanish": "Él usó movimientos inteligentes para sacar a los defensores de posición, abriendo espacio para sus compañeros.", "level": 3},
    {"english": "The goalkeeper came off his line to intercept a dangerous through ball.", "spanish": "El portero salió de su línea para interceptar un pase filtrado peligroso.", "level": 3},
    {"english": "She delivered a precise low cross, finding the striker in a perfect scoring position.", "spanish": "Ella envió un centro bajo preciso, encontrando al delantero en una posición perfecta para marcar.", "level": 3},
    {"english": "He controlled a difficult aerial pass and turned to face the goal under pressure.", "spanish": "Él controló un pase aéreo difícil y se giró para enfrentar la portería bajo presión.", "level": 3},
    {"english": "The team executed coordinated pressing triggers, forcing the opponents into mistakes.", "spanish": "El equipo ejecutó disparadores de presión coordinados, forzando a los oponentes a cometer errores.", "level": 3},
    {"english": "She exploited the space left by the overlapping fullback to make a dangerous run.", "spanish": "Ella explotó el espacio dejado por el lateral desdoblado para hacer una carrera peligrosa.", "level": 3},
    {"english": "He feinted past the defender and placed a perfectly timed shot into the corner.", "spanish": "Él fintó al defensor y colocó un disparo perfectamente cronometrado en el ángulo.", "level": 3},
    {"english": "The midfielder anticipated the second ball and quickly distributed it to the winger.", "spanish": "El mediocampista anticipó el segundo balón y lo distribuyó rápidamente al extremo.", "level": 3},
    {"english": "Despite fatigue, she maintained tactical discipline and closed down passing lanes effectively.", "spanish": "A pesar del cansancio, ella mantuvo la disciplina táctica y cerró las líneas de pase efectivamente.", "level": 3},
    {"english": "He executed a perfectly timed cutback from the byline, creating a clear shooting opportunity.", "spanish": "Él ejecutó un pase atrás perfectamente cronometrado desde la línea de fondo, creando una oportunidad clara de disparo.", "level": 3},
    {"english": "The striker adjusted his position to receive a deflected ball, finishing with composure.", "spanish": "El delantero ajustó su posición para recibir un balón desviado, definiendo con calma.", "level": 3},
    {"english": "She made a series of clever runs, dragging defenders and opening space for teammates.", "spanish": "Ella hizo una serie de carreras inteligentes, arrastrando a los defensores y abriendo espacio para sus compañeras.", "level": 3},
    {"english": "The team transitioned rapidly from defense to attack, catching the opponents unprepared.", "spanish": "El equipo realizó transiciones rápidas de defensa a ataque, tomando por sorpresa a los oponentes.", "level": 3},
    {"english": "He executed a perfectly timed lob over the goalkeeper to score the winning goal.", "spanish": "Él ejecutó un globo perfectamente cronometrado sobre el portero para marcar el gol de la victoria.", "level": 3},
    {"english": "She read the game brilliantly, intercepting a crucial pass and starting a counterattack.", "spanish": "Ella leyó el juego brillantemente, interceptando un pase crucial e iniciando un contraataque.", "level": 3},
    {"english": "The goalkeeper made a reflex save from close range, denying a sure goal.", "spanish": "El portero realizó una atajada de reflejos a corta distancia, negando un gol seguro.", "level": 3},
    {"english": "He delivered a perfectly weighted pass splitting the defense under intense pressure.", "spanish": "Él entregó un pase perfectamente medido que partió la defensa bajo intensa presión.", "level": 3},
    {"english": "The midfielder orchestrated play, switching sides and controlling the tempo with precision.", "spanish": "El mediocampista orquestó el juego, cambiando de lado y controlando el ritmo con precisión.", "level": 3},
    {"english": "She executed a perfectly timed run, avoiding the offside trap and finishing clinically.", "spanish": "Ella ejecutó una carrera perfectamente cronometrada, evitando el fuera de juego y definiendo clínicamente.", "level": 3},
    {"english": "He anticipated the opponent's pass and intercepted it, initiating a dangerous counterattack.", "spanish": "Él anticipó el pase del oponente y lo interceptó, iniciando un contraataque peligroso.", "level": 3},
    {"english": "The striker used clever body positioning to shield the ball and create space for a shot.", "spanish": "El delantero utilizó una colocación corporal inteligente para proteger la pelota y crear espacio para un disparo.", "level": 3},
    {"english": "She maintained composure under intense pressure, delivering a perfectly timed assist.", "spanish": "Ella mantuvo la compostura bajo intensa presión, realizando una asistencia perfectamente cronometrada.", "level": 3},
    {"english": "The team executed a series of overlapping runs, stretching the defense and creating clear chances.", "spanish": "El equipo ejecutó una serie de desdoblamientos, estirando la defensa y creando oportunidades claras.", "level": 3},
    {"english": "He struck the ball with precision, bending it around the wall into the top corner.", "spanish": "Él golpeó la pelota con precisión, curveándola alrededor de la barrera hacia el ángulo superior.", "level": 3},
    {"english": "She timed her interception perfectly, cutting off a dangerous through ball.", "spanish": "Ella calculó su intercepción a la perfección, cortando un pase filtrado peligroso.", "level": 3},
    {"english": "The goalkeeper anticipated the shot, diving low to make a crucial save.", "spanish": "El portero anticipó el disparo, lanzándose bajo para realizar una atajada crucial.", "level": 3},
    {"english": "He exploited the half-space to receive the ball and unleash a powerful shot.", "spanish": "Él explotó el espacio entre líneas para recibir la pelota y lanzar un potente disparo.", "level": 3},
    {"english": "She performed a quick turn under pressure, creating a passing lane for her teammate.", "spanish": "Ella realizó un giro rápido bajo presión, creando una línea de pase para su compañera.", "level": 3},
    {"english": "The team rotated possession intelligently, forcing the opposition to constantly adjust.", "spanish": "El equipo rotó la posesión de manera inteligente, forzando a la oposición a ajustarse constantemente.", "level": 3},
    {"english": "He made a perfectly weighted pass over the defenders, setting up a scoring chance.", "spanish": "Él hizo un pase perfectamente medido por encima de los defensores, creando una oportunidad de gol.", "level": 3},
    {"english": "The striker positioned himself expertly to finish a rebound from the goalkeeper.", "spanish": "El delantero se posicionó expertamente para rematar un rebote del portero.", "level": 3},
    {"english": "She timed her run to avoid the offside trap and received a perfectly weighted pass.", "spanish": "Ella calculó su carrera para evitar el fuera de juego y recibió un pase perfectamente medido.", "level": 3},
    {"english": "The midfielder controlled the game tempo, switching play and exploiting spaces effectively.", "spanish": "El mediocampista controló el tempo del juego, cambiando de lado y explotando espacios efectivamente.", "level": 3},
    {"english": "He executed a perfectly timed slide tackle, winning the ball cleanly without committing a foul.", "spanish": "Él ejecutó una entrada deslizante perfectamente cronometrada, ganando la pelota limpiamente sin cometer falta.", "level": 3},
    {"english": "She combined cleverly with teammates, drawing defenders and creating space for others.", "spanish": "Ella combinó inteligentemente con sus compañeras, atrayendo defensores y creando espacio para otras.", "level": 3},
    {"english": "The goalkeeper made a remarkable save, diving to stop a powerful shot from close range.", "spanish": "El portero realizó una atajada notable, lanzándose para detener un potente disparo a corta distancia.", "level": 3},
    {"english": "He read the game perfectly, intercepting a pass and launching a counterattack.", "spanish": "Él leyó el juego perfectamente, interceptando un pase e iniciando un contraataque.", "level": 3},
    {"english": "The striker executed a perfectly timed volley, sending the ball into the top corner.", "spanish": "El delantero ejecutó una volea perfectamente cronometrada, enviando la pelota al ángulo superior.", "level": 3}
  ],


  "music": [
    {"english": "She plays the guitar every morning.", "spanish": "Ella toca la guitarra todas las mañanas.", "level": 1},
    {"english": "He listens to pop music while studying.", "spanish": "Él escucha música pop mientras estudia.", "level": 1},
    {"english": "They sang a song together at the party.", "spanish": "Cantaron una canción juntos en la fiesta.", "level": 1},
    {"english": "I like to play the piano in the evenings.", "spanish": "Me gusta tocar el piano por las tardes.", "level": 1},
    {"english": "She practices the drums for an hour every day.", "spanish": "Ella practica la batería una hora todos los días.", "level": 1},
    {"english": "He enjoys listening to classical music.", "spanish": "Él disfruta escuchar música clásica.", "level": 1},
    {"english": "The children are learning a new song.", "spanish": "Los niños están aprendiendo una nueva canción.", "level": 1},
    {"english": "I play the violin in a small orchestra.", "spanish": "Toco el violín en una pequeña orquesta.", "level": 1},
    {"english": "She is singing in the school choir.", "spanish": "Ella está cantando en el coro de la escuela.", "level": 1},
    {"english": "He likes to dance to fast music.", "spanish": "A él le gusta bailar con música rápida.", "level": 1},
    {"english": "I listen to music while walking in the park.", "spanish": "Escucho música mientras camino en el parque.", "level": 1},
    {"english": "They played a happy song on the radio.", "spanish": "Tocaron una canción alegre en la radio.", "level": 1},
    {"english": "She learned a new song on the piano.", "spanish": "Ella aprendió una nueva canción en el piano.", "level": 1},
    {"english": "He practices singing every morning.", "spanish": "Él practica canto todas las mañanas.", "level": 1},
    {"english": "We like to play music at parties.", "spanish": "Nos gusta tocar música en las fiestas.", "level": 1},
    {"english": "I am learning to play the guitar.", "spanish": "Estoy aprendiendo a tocar la guitarra.", "level": 1},
    {"english": "She listens to music on her headphones.", "spanish": "Ella escucha música con sus auriculares.", "level": 1},
    {"english": "He sings a song to his little sister.", "spanish": "Él canta una canción a su hermanita.", "level": 1},
    {"english": "I like to play the drums on weekends.", "spanish": "Me gusta tocar la batería los fines de semana.", "level": 1},
    {"english": "They enjoy listening to jazz music.", "spanish": "Disfrutan escuchar música jazz.", "level": 1},
    {"english": "She is learning to play the flute.", "spanish": "Ella está aprendiendo a tocar la flauta.", "level": 1},
    {"english": "He practices the guitar every evening.", "spanish": "Él practica guitarra todas las noches.", "level": 1},
    {"english": "We are singing a new song in class.", "spanish": "Estamos cantando una nueva canción en la clase.", "level": 1},
    {"english": "I like to listen to music before sleeping.", "spanish": "Me gusta escuchar música antes de dormir.", "level": 1},
    {"english": "She plays the piano beautifully.", "spanish": "Ella toca el piano hermosamente.", "level": 1},
    {"english": "He enjoys playing music with friends.", "spanish": "Él disfruta tocar música con amigos.", "level": 1},
    {"english": "I am learning a new song on the guitar.", "spanish": "Estoy aprendiendo una nueva canción en la guitarra.", "level": 1},
    {"english": "They dance happily to the music.", "spanish": "Bailan felices con la música.", "level": 1},
    {"english": "She practices the violin every day.", "spanish": "Ella practica el violín todos los días.", "level": 1},
    {"english": "He likes to listen to music while cooking.", "spanish": "A él le gusta escuchar música mientras cocina.", "level": 1},
    {"english": "I play music for my family.", "spanish": "Toco música para mi familia.", "level": 1},
    {"english": "They are learning to sing a new song.", "spanish": "Están aprendiendo a cantar una nueva canción.", "level": 1},
    {"english": "She enjoys listening to music in her room.", "spanish": "Ella disfruta escuchar música en su habitación.", "level": 1},
    {"english": "He plays the guitar every afternoon.", "spanish": "Él toca la guitarra todas las tardes.", "level": 1},
    {"english": "I like to sing songs with my friends.", "spanish": "Me gusta cantar canciones con mis amigos.", "level": 1},
    {"english": "They are practicing music for the concert.", "spanish": "Están practicando música para el concierto.", "level": 1},
    {"english": "She is learning to play the drums.", "spanish": "Ella está aprendiendo a tocar la batería.", "level": 1},
    {"english": "He enjoys listening to music at the park.", "spanish": "Él disfruta escuchar música en el parque.", "level": 1},
    {"english": "I like to play the flute with my friends.", "spanish": "Me gusta tocar la flauta con mis amigos.", "level": 1},
    {"english": "They sing a song every morning.", "spanish": "Cantamos una canción todas las mañanas.", "level": 1},
    {"english": "She plays the piano with her teacher.", "spanish": "Ella toca el piano con su profesora.", "level": 1},
    {"english": "He listens to music on the bus.", "spanish": "Él escucha música en el autobús.", "level": 1},
    {"english": "I enjoy playing music on weekends.", "spanish": "Disfruto tocar música los fines de semana.", "level": 1},
    {"english": "They practice a new song together.", "spanish": "Practican una nueva canción juntos.", "level": 1},
    {"english": "She sings beautifully in the choir.", "spanish": "Ella canta hermosamente en el coro.", "level": 1},
    {"english": "He plays music for the school festival.", "spanish": "Él toca música para el festival de la escuela.", "level": 1},
    {"english": "I am learning to play the keyboard.", "spanish": "Estoy aprendiendo a tocar el teclado.", "level": 1},
    {"english": "They enjoy dancing to pop music.", "spanish": "Disfrutan bailar con música pop.", "level": 1},
    {"english": "She listens to music while painting.", "spanish": "Ella escucha música mientras pinta.", "level": 1},
    {"english": "He practices the violin every morning.", "spanish": "Él practica el violín todas las mañanas.", "level": 1},
    {"english": "I like to play music on my guitar.", "spanish": "Me gusta tocar música en mi guitarra.", "level": 1},
    {"english": "They are learning new songs at school.", "spanish": "Están aprendiendo nuevas canciones en la escuela.", "level": 1},
    {"english": "She enjoys playing the piano with friends.", "spanish": "Ella disfruta tocar el piano con amigos.", "level": 1},
    {"english": "He listens to music to relax.", "spanish": "Él escucha música para relajarse.", "level": 1},
    {"english": "I practice singing every day.", "spanish": "Practico canto todos los días.", "level": 1},
    {"english": "They play songs on the radio.", "spanish": "Tocan canciones en la radio.", "level": 1},
    {"english": "She likes to learn new songs.", "spanish": "A ella le gusta aprender nuevas canciones.", "level": 1},
    {"english": "He plays the drums in a band.", "spanish": "Él toca la batería en una banda.", "level": 1},
    {"english": "I enjoy singing with my friends.", "spanish": "Disfruto cantar con mis amigos.", "level": 1},
    {"english": "They listen to music in the evening.", "spanish": "Escuchan música por la noche.", "level": 1},
    {"english": "She practices music before school.", "spanish": "Ella practica música antes de la escuela.", "level": 1},
    {"english": "He plays the guitar every night.", "spanish": "Él toca la guitarra todas las noches.", "level": 1},
    {"english": "I like to listen to music while studying.", "spanish": "Me gusta escuchar música mientras estudio.", "level": 1},
    {"english": "They are singing a new song together.", "spanish": "Están cantando una nueva canción juntos.", "level": 1},
    {"english": "She plays music beautifully.", "spanish": "Ella toca música hermosamente.", "level": 1},
    {"english": "He enjoys listening to songs on the radio.", "spanish": "Él disfruta escuchar canciones en la radio.", "level": 1},
    {"english": "I practice music every afternoon.", "spanish": "Practico música todas las tardes.", "level": 1},
    {"english": "They like to play instruments together.", "spanish": "Les gusta tocar instrumentos juntos.", "level": 1},
    {"english": "She sings a song for her family.", "spanish": "Ella canta una canción para su familia.", "level": 1},
    {"english": "He plays piano in the evenings.", "spanish": "Él toca el piano por las noches.", "level": 1},
    {"english": "I enjoy listening to music in the morning.", "spanish": "Disfruto escuchar música por la mañana.", "level": 1},
    {"english": "They practice songs for the concert.", "spanish": "Practican canciones para el concierto.", "level": 1},
    {"english": "She is learning to play the guitar.", "spanish": "Ella está aprendiendo a tocar la guitarra.", "level": 1},
    {"english": "He likes singing with friends.", "spanish": "A él le gusta cantar con amigos.", "level": 1},
    {"english": "I listen to music every day.", "spanish": "Escucho música todos los días.", "level": 1},
    {"english": "They play songs on their instruments.", "spanish": "Tocan canciones en sus instrumentos.", "level": 1},
    {"english": "She enjoys learning new songs.", "spanish": "Ella disfruta aprender nuevas canciones.", "level": 1},
    {"english": "He practices music at home.", "spanish": "Él practica música en casa.", "level": 1},
    {"english": "I play the piano every morning.", "spanish": "Toco el piano todas las mañanas.", "level": 1},
    {"english": "They are singing happily.", "spanish": "Están cantando felices.", "level": 1},
    {"english": "She plays the violin with care.", "spanish": "Ella toca el violín con cuidado.", "level": 1},
    {"english": "He enjoys music before going to bed.", "spanish": "Él disfruta la música antes de dormir.", "level": 1},
    {"english": "I like to play the guitar with friends.", "spanish": "Me gusta tocar la guitarra con amigos.", "level": 1},
    {"english": "They listen to songs every evening.", "spanish": "Escuchan canciones todas las noches.", "level": 1},
    {"english": "She practices singing every afternoon.", "spanish": "Ella practica canto todas las tardes.", "level": 1},
    {"english": "He plays drums in his free time.", "spanish": "Él toca la batería en su tiempo libre.", "level": 1},
    {"english": "I enjoy playing music for my family.", "spanish": "Disfruto tocar música para mi familia.", "level": 1},
    {"english": "They like singing in the school choir.", "spanish": "Les gusta cantar en el coro de la escuela.", "level": 1},
    {"english": "She listens to music while walking.", "spanish": "Ella escucha música mientras camina.", "level": 1},
    {"english": "He practices the piano every evening.", "spanish": "Él practica el piano todas las noches.", "level": 1},
    {"english": "I like to play music on weekends.", "spanish": "Me gusta tocar música los fines de semana.", "level": 1},
    {"english": "They are learning songs together.", "spanish": "Están aprendiendo canciones juntos.", "level": 1},
    {"english": "She enjoys listening to music at home.", "spanish": "Ella disfruta escuchar música en casa.", "level": 1},
    {"english": "He plays the guitar in his room.", "spanish": "Él toca la guitarra en su habitación.", "level": 1},
    {"english": "I practice singing before class.", "spanish": "Practico canto antes de la clase.", "level": 1},
    {"english": "They dance to music at the party.", "spanish": "Bailan con música en la fiesta.", "level": 1},
    {"english": "She plays piano for the school event.", "spanish": "Ella toca el piano para el evento escolar.", "level": 1},
    {"english": "He enjoys learning new songs.", "spanish": "Él disfruta aprender nuevas canciones.", "level": 1},
    {"english": "I listen to music while studying.", "spanish": "Escucho música mientras estudio.", "level": 1},
    {"english": "They practice music every day.", "spanish": "Practican música todos los días.", "level": 1},

      {"english": "She has been practicing the piano for three years.", "spanish": "Ella ha estado practicando el piano durante tres años.", "level": 2},
    {"english": "He prefers listening to jazz over pop music.", "spanish": "Él prefiere escuchar jazz en lugar de música pop.", "level": 2},
    {"english": "They composed a new song together last week.", "spanish": "Compusieron una nueva canción juntos la semana pasada.", "level": 2},
    {"english": "I am learning to play complex chords on the guitar.", "spanish": "Estoy aprendiendo a tocar acordes complejos en la guitarra.", "level": 2},
    {"english": "She recorded her voice for the school project.", "spanish": "Ella grabó su voz para el proyecto escolar.", "level": 2},
    {"english": "He enjoys analyzing the lyrics of his favorite songs.", "spanish": "Él disfruta analizar las letras de sus canciones favoritas.", "level": 2},
    {"english": "We are preparing a music performance for the festival.", "spanish": "Estamos preparando una presentación musical para el festival.", "level": 2},
    {"english": "I listened to the entire album twice yesterday.", "spanish": "Escuché todo el álbum dos veces ayer.", "level": 2},
    {"english": "She practices playing scales to improve her technique.", "spanish": "Ella practica escalas para mejorar su técnica.", "level": 2},
    {"english": "He teaches music theory to beginner students.", "spanish": "Él enseña teoría musical a estudiantes principiantes.", "level": 2},
    {"english": "They recorded a live concert last summer.", "spanish": "Grabaron un concierto en vivo el verano pasado.", "level": 2},
    {"english": "I enjoy composing short melodies on the piano.", "spanish": "Disfruto componer pequeñas melodías en el piano.", "level": 2},
    {"english": "She is studying different music styles for her project.", "spanish": "Ella está estudiando diferentes estilos musicales para su proyecto.", "level": 2},
    {"english": "He practices improvisation to enhance his jazz skills.", "spanish": "Él practica improvisación para mejorar sus habilidades en jazz.", "level": 2},
    {"english": "We are arranging a song for a small orchestra.", "spanish": "Estamos arreglando una canción para una pequeña orquesta.", "level": 2},
    {"english": "I learned to play a complicated piece on the violin.", "spanish": "Aprendí a tocar una pieza complicada en el violín.", "level": 2},
    {"english": "She recorded her guitar performance for the audition.", "spanish": "Ella grabó su interpretación de guitarra para la audición.", "level": 2},
    {"english": "He studies different instruments to become versatile.", "spanish": "Él estudia diferentes instrumentos para volverse versátil.", "level": 2},
    {"english": "They are learning to read sheet music efficiently.", "spanish": "Están aprendiendo a leer partituras de manera eficiente.", "level": 2},
    {"english": "I enjoy analyzing the rhythm and harmony in songs.", "spanish": "Disfruto analizar el ritmo y la armonía en las canciones.", "level": 2},
    {"english": "She plays the piano with passion and precision.", "spanish": "Ella toca el piano con pasión y precisión.", "level": 2},
    {"english": "He has been composing music since he was a child.", "spanish": "Él ha estado componiendo música desde que era niño.", "level": 2},
    {"english": "We are rehearsing for the upcoming music recital.", "spanish": "Estamos ensayando para el próximo recital de música.", "level": 2},
    {"english": "I recorded a cover version of my favorite song.", "spanish": "Grabé una versión cover de mi canción favorita.", "level": 2},
    {"english": "She is studying music history to understand composers.", "spanish": "Ella está estudiando historia de la música para entender a los compositores.", "level": 2},
    {"english": "He practices finger exercises to improve guitar speed.", "spanish": "Él practica ejercicios de dedos para mejorar la velocidad en la guitarra.", "level": 2},
    {"english": "They are learning to play harmonies together.", "spanish": "Están aprendiendo a tocar armonías juntos.", "level": 2},
    {"english": "I enjoy composing new songs during free time.", "spanish": "Disfruto componer nuevas canciones durante mi tiempo libre.", "level": 2},
    {"english": "She performed a challenging piece in front of the class.", "spanish": "Ella interpretó una pieza desafiante frente a la clase.", "level": 2},
    {"english": "He studies music notation to become a better musician.", "spanish": "Él estudia notación musical para ser un mejor músico.", "level": 2},
    {"english": "We listened to a live concert on the radio yesterday.", "spanish": "Escuchamos un concierto en vivo por la radio ayer.", "level": 2},
    {"english": "I am learning to compose songs using my keyboard.", "spanish": "Estoy aprendiendo a componer canciones usando mi teclado.", "level": 2},
    {"english": "She is practicing her singing for the talent show.", "spanish": "Ella está practicando su canto para el concurso de talentos.", "level": 2},
    {"english": "He enjoys writing lyrics for his own music.", "spanish": "Él disfruta escribir letras para su propia música.", "level": 2},
    {"english": "They recorded an original song last weekend.", "spanish": "Grabaron una canción original el fin de semana pasado.", "level": 2},
    {"english": "I like to analyze the melody and harmony in classical pieces.", "spanish": "Me gusta analizar la melodía y armonía en piezas clásicas.", "level": 2},
    {"english": "She practices music theory to understand composition.", "spanish": "Ella practica teoría musical para entender la composición.", "level": 2},
    {"english": "He plays several instruments at the music school.", "spanish": "Él toca varios instrumentos en la escuela de música.", "level": 2},
    {"english": "We are preparing a medley for the music festival.", "spanish": "Estamos preparando un popurrí para el festival de música.", "level": 2},
    {"english": "I studied the techniques of famous guitarists.", "spanish": "Estudié las técnicas de guitarristas famosos.", "level": 2},
    {"english": "She enjoys performing in front of an audience.", "spanish": "Ella disfruta actuar frente a una audiencia.", "level": 2},
    {"english": "He has composed several songs this year.", "spanish": "Ha compuesto varias canciones este año.", "level": 2},
    {"english": "They are learning to play complex rhythms on drums.", "spanish": "Están aprendiendo a tocar ritmos complejos en la batería.", "level": 2},
    {"english": "I recorded my own version of a popular song.", "spanish": "Grabé mi propia versión de una canción popular.", "level": 2},
    {"english": "She studies different genres to expand her skills.", "spanish": "Ella estudia diferentes géneros para ampliar sus habilidades.", "level": 2},
    {"english": "He practices singing while playing the piano.", "spanish": "Él practica canto mientras toca el piano.", "level": 2},
    {"english": "We enjoy creating music together every weekend.", "spanish": "Disfrutamos crear música juntos cada fin de semana.", "level": 2},
    {"english": "I am learning to play jazz improvisations on the piano.", "spanish": "Estoy aprendiendo a tocar improvisaciones de jazz en el piano.", "level": 2},
    {"english": "She recorded a duet with her best friend.", "spanish": "Ella grabó un dueto con su mejor amiga.", "level": 2},
    {"english": "He analyzes the structure of songs to improve composition.", "spanish": "Él analiza la estructura de las canciones para mejorar la composición.", "level": 2},
    {"english": "They are preparing a music presentation for school.", "spanish": "Están preparando una presentación musical para la escuela.", "level": 2},
    {"english": "I enjoy practicing music every morning before school.", "spanish": "Disfruto practicar música cada mañana antes de la escuela.", "level": 2},
    {"english": "She composes music for short films.", "spanish": "Ella compone música para cortometrajes.", "level": 2},
    {"english": "He studies advanced guitar techniques every day.", "spanish": "Él estudia técnicas avanzadas de guitarra todos los días.", "level": 2},
    {"english": "We performed a medley of famous songs last night.", "spanish": "Interpretamos un popurrí de canciones famosas anoche.", "level": 2},
    {"english": "I am learning to write music using notation software.", "spanish": "Estoy aprendiendo a escribir música usando un software de notación.", "level": 2},
    {"english": "She enjoys practicing with different instruments.", "spanish": "Ella disfruta practicar con diferentes instrumentos.", "level": 2},
    {"english": "He recorded a live performance at the concert.", "spanish": "Él grabó una presentación en vivo en el concierto.", "level": 2},
    {"english": "They are learning to harmonize their voices.", "spanish": "Están aprendiendo a armonizar sus voces.", "level": 2},
    {"english": "I like to compose instrumental music for relaxation.", "spanish": "Me gusta componer música instrumental para relajarme.", "level": 2},
    {"english": "She plays the cello with excellent technique.", "spanish": "Ella toca el violonchelo con excelente técnica.", "level": 2},
    {"english": "He enjoys experimenting with different music styles.", "spanish": "Él disfruta experimentar con diferentes estilos musicales.", "level": 2},
    {"english": "We recorded an original song for the school festival.", "spanish": "Grabamos una canción original para el festival escolar.", "level": 2},
    {"english": "I am learning to play advanced piano pieces.", "spanish": "Estoy aprendiendo a tocar piezas avanzadas de piano.", "level": 2},
    {"english": "She studies music composition at the university.", "spanish": "Ella estudia composición musical en la universidad.", "level": 2},
    {"english": "He practices the trumpet to play in the school band.", "spanish": "Él practica la trompeta para tocar en la banda escolar.", "level": 2},
    {"english": "They enjoy playing music for special events.", "spanish": "Disfrutan tocar música para eventos especiales.", "level": 2},
    {"english": "I like to analyze different arrangements of songs.", "spanish": "Me gusta analizar diferentes arreglos de canciones.", "level": 2},
    {"english": "She performed a solo in front of the audience.", "spanish": "Ella interpretó un solo frente a la audiencia.", "level": 2},
    {"english": "He practices vocal exercises every morning.", "spanish": "Él practica ejercicios vocales todas las mañanas.", "level": 2},
    {"english": "We are learning to play songs by ear.", "spanish": "Estamos aprendiendo a tocar canciones de oído.", "level": 2},
    {"english": "I recorded a song using multiple instruments.", "spanish": "Grabé una canción usando varios instrumentos.", "level": 2},
    {"english": "She enjoys arranging music for her small band.", "spanish": "Ella disfruta arreglar música para su pequeña banda.", "level": 2},
    {"english": "He studies rhythm patterns to improve drumming skills.", "spanish": "Él estudia patrones rítmicos para mejorar sus habilidades de batería.", "level": 2},
    {"english": "They are practicing for the upcoming music competition.", "spanish": "Están practicando para la próxima competencia de música.", "level": 2},
    {"english": "I like to play music that tells a story.", "spanish": "Me gusta tocar música que cuente una historia.", "level": 2},
    {"english": "She practices improvisation to enhance creativity.", "spanish": "Ella practica improvisación para aumentar la creatividad.", "level": 2},
    {"english": "He enjoys composing instrumental pieces for relaxation.", "spanish": "Él disfruta componer piezas instrumentales para relajarse.", "level": 2},
    {"english": "We recorded our own version of a famous song.", "spanish": "Grabamos nuestra propia versión de una canción famosa.", "level": 2},
    {"english": "I am learning to play songs in different keys.", "spanish": "Estoy aprendiendo a tocar canciones en diferentes tonalidades.", "level": 2},
    {"english": "She studies the techniques of various singers.", "spanish": "Ella estudia las técnicas de varios cantantes.", "level": 2},
    {"english": "He plays piano and sings at the same time.", "spanish": "Él toca el piano y canta al mismo tiempo.", "level": 2},
    {"english": "They enjoy practicing music together every weekend.", "spanish": "Disfrutan practicar música juntos cada fin de semana.", "level": 2},
    {"english": "I like to compose music inspired by nature.", "spanish": "Me gusta componer música inspirada en la naturaleza.", "level": 2},
    {"english": "She recorded a song for the online music contest.", "spanish": "Ella grabó una canción para el concurso musical en línea.", "level": 2},
    {"english": "He studies harmony and chord progressions daily.", "spanish": "Él estudia armonía y progresiones de acordes diariamente.", "level": 2},
    {"english": "We performed a piece by a famous composer.", "spanish": "Interpretamos una pieza de un compositor famoso.", "level": 2},
    {"english": "I enjoy experimenting with electronic music sounds.", "spanish": "Disfruto experimentar con sonidos de música electrónica.", "level": 2},
    {"english": "She is learning advanced music theory concepts.", "spanish": "Ella está aprendiendo conceptos avanzados de teoría musical.", "level": 2},
    {"english": "He practices piano scales to improve finger strength.", "spanish": "Él practica escalas de piano para mejorar la fuerza de los dedos.", "level": 2},
    {"english": "They are composing a song for their school project.", "spanish": "Están componiendo una canción para su proyecto escolar.", "level": 2},

      {"english": "Despite the heavy rain, the orchestra performed the symphony flawlessly.", "spanish": "A pesar de la fuerte lluvia, la orquesta interpretó la sinfonía a la perfección.", "level": 3},
    {"english": "After years of practice, she mastered the art of jazz improvisation.", "spanish": "Después de años de práctica, ella dominó el arte de la improvisación de jazz.", "level": 3},
    {"english": "He analyzed the harmonic structure of the classical piece to understand its complexity.", "spanish": "Él analizó la estructura armónica de la pieza clásica para entender su complejidad.", "level": 3},
    {"english": "They composed a soundtrack for the independent film using a variety of instruments.", "spanish": "Compusieron la banda sonora de la película independiente utilizando una variedad de instrumentos.", "level": 3},
    {"english": "I studied advanced counterpoint techniques to improve my composition skills.", "spanish": "Estudié técnicas avanzadas de contrapunto para mejorar mis habilidades de composición.", "level": 3},
    {"english": "She performed a demanding violin concerto in front of a large audience.", "spanish": "Ella interpretó un exigente concierto para violín frente a una gran audiencia.", "level": 3},
    {"english": "He experimented with unconventional rhythms to create a unique musical piece.", "spanish": "Él experimentó con ritmos no convencionales para crear una pieza musical única.", "level": 3},
    {"english": "The choir rehearsed for hours to perfect the complex vocal harmonies.", "spanish": "El coro ensayó durante horas para perfeccionar las complejas armonías vocales.", "level": 3},
    {"english": "I enjoy studying the evolution of musical styles across different centuries.", "spanish": "Disfruto estudiar la evolución de los estilos musicales a lo largo de los siglos.", "level": 3},
    {"english": "She incorporated electronic sounds into her classical compositions.", "spanish": "Ella incorporó sonidos electrónicos en sus composiciones clásicas.", "level": 3},
    {"english": "He teaches advanced music theory to university students.", "spanish": "Él enseña teoría musical avanzada a estudiantes universitarios.", "level": 3},
    {"english": "They collaborated on a fusion project combining jazz, rock, and classical music.", "spanish": "Colaboraron en un proyecto de fusión que combinaba jazz, rock y música clásica.", "level": 3},
    {"english": "I am analyzing the modal interchange in modern jazz compositions.", "spanish": "Estoy analizando la modulación modal en composiciones modernas de jazz.", "level": 3},
    {"english": "She recorded a complex layering of vocals and instruments for the album.", "spanish": "Ella grabó una compleja superposición de voces e instrumentos para el álbum.", "level": 3},
    {"english": "He is learning to conduct an orchestra while playing the piano simultaneously.", "spanish": "Él está aprendiendo a dirigir una orquesta mientras toca el piano simultáneamente.", "level": 3},
    {"english": "The pianist interpreted the contemporary piece with exceptional expression.", "spanish": "El pianista interpretó la pieza contemporánea con una expresión excepcional.", "level": 3},
    {"english": "We experimented with microtonal scales to create a new sound palette.", "spanish": "Experimentamos con escalas microtonales para crear una nueva paleta sonora.", "level": 3},
    {"english": "I studied the improvisational techniques of legendary jazz musicians.", "spanish": "Estudié las técnicas de improvisación de músicos legendarios de jazz.", "level": 3},
    {"english": "She arranged the orchestral score to highlight each instrument's unique timbre.", "spanish": "Ella arregló la partitura orquestal para resaltar el timbre único de cada instrumento.", "level": 3},
    {"english": "He composed a multipart suite that explores various moods and textures.", "spanish": "Él compuso una suite multipartita que explora varios estados de ánimo y texturas.", "level": 3},
    {"english": "The singer delivered a technically challenging performance without errors.", "spanish": "El cantante ofreció una actuación técnicamente desafiante sin errores.", "level": 3},
    {"english": "We are exploring avant-garde techniques in contemporary music composition.", "spanish": "Estamos explorando técnicas vanguardistas en la composición musical contemporánea.", "level": 3},
    {"english": "I transcribed the complex improvisation of the saxophonist note by note.", "spanish": "Transcribí la compleja improvisación del saxofonista nota por nota.", "level": 3},
    {"english": "She practices polyrhythms to master intricate drum patterns.", "spanish": "Ella practica polirritmos para dominar patrones complejos de batería.", "level": 3},
    {"english": "He analyzed the orchestration techniques used by Beethoven in his symphonies.", "spanish": "Él analizó las técnicas de orquestación utilizadas por Beethoven en sus sinfonías.", "level": 3},
    {"english": "They incorporated traditional instruments into modern compositions.", "spanish": "Incorporaron instrumentos tradicionales en composiciones modernas.", "level": 3},
    {"english": "I enjoy interpreting the emotional content of challenging classical pieces.", "spanish": "Disfruto interpretar el contenido emocional de piezas clásicas desafiantes.", "level": 3},
    {"english": "She recorded a multitrack composition combining live and digital instruments.", "spanish": "Ella grabó una composición multitrack combinando instrumentos en vivo y digitales.", "level": 3},
    {"english": "He experiments with unconventional tunings to create original harmonic textures.", "spanish": "Él experimenta con afinaciones no convencionales para crear texturas armónicas originales.", "level": 3},
    {"english": "We analyzed the counterpoint in Renaissance choral works.", "spanish": "Analizamos el contrapunto en obras corales del Renacimiento.", "level": 3},
    {"english": "I am learning advanced techniques in orchestration and arrangement.", "spanish": "Estoy aprendiendo técnicas avanzadas de orquestación y arreglo.", "level": 3},
    {"english": "She composed a piece that transitions smoothly between multiple musical genres.", "spanish": "Ella compuso una pieza que transita suavemente entre múltiples géneros musicales.", "level": 3},
    {"english": "He practiced improvisation over complex chord changes for several hours.", "spanish": "Practicó improvisación sobre cambios de acordes complejos durante varias horas.", "level": 3},
    {"english": "They performed a contemporary opera that challenged traditional conventions.", "spanish": "Interpretaron una ópera contemporánea que desafiaba las convenciones tradicionales.", "level": 3},
    {"english": "I am analyzing rhythm and phrasing in Baroque keyboard compositions.", "spanish": "Estoy analizando el ritmo y la fraseología en composiciones barrocas para teclado.", "level": 3},
    {"english": "She recorded an experimental track using layered sound effects.", "spanish": "Ella grabó una pista experimental usando efectos de sonido superpuestos.", "level": 3},
    {"english": "He studies modulation techniques to create tension and release in music.", "spanish": "Él estudia técnicas de modulación para crear tensión y resolución en la música.", "level": 3},
    {"english": "We rehearsed the symphonic piece with attention to every subtle detail.", "spanish": "Ensayamos la pieza sinfónica prestando atención a cada detalle sutil.", "level": 3},
    {"english": "I transcribed a complex jazz solo to understand the improvisation approach.", "spanish": "Transcribí un solo de jazz complejo para entender el enfoque de improvisación.", "level": 3},
    {"english": "She experiments with blending acoustic and electronic sounds creatively.", "spanish": "Ella experimenta combinando sonidos acústicos y electrónicos de manera creativa.", "level": 3},
    {"english": "He composes elaborate fugues that follow classical counterpoint rules.", "spanish": "Él compone elaboradas fugas que siguen las reglas del contrapunto clásico.", "level": 3},
    {"english": "They performed a multimedia musical performance integrating visuals and sound.", "spanish": "Realizaron una actuación musical multimedia integrando imágenes y sonido.", "level": 3},
    {"english": "I practice advanced sight-reading to tackle challenging sheet music.", "spanish": "Practico lectura a primera vista avanzada para abordar partituras desafiantes.", "level": 3},
    {"english": "She analyzed jazz standards to develop her own improvisational style.", "spanish": "Ella analizó standards de jazz para desarrollar su propio estilo de improvisación.", "level": 3},
    {"english": "He arranged a complex piece for a small chamber ensemble.", "spanish": "Él arregló una pieza compleja para un pequeño conjunto de cámara.", "level": 3},
    {"english": "We explored non-traditional scales to compose a unique musical work.", "spanish": "Exploramos escalas no tradicionales para componer una obra musical única.", "level": 3},
    {"english": "I recorded a layered composition using orchestral and synthesized instruments.", "spanish": "Grabé una composición superpuesta usando instrumentos orquestales y sintetizados.", "level": 3},
    {"english": "She is learning to improvise over intricate jazz chord progressions.", "spanish": "Ella está aprendiendo a improvisar sobre progresiones de acordes complejas de jazz.", "level": 3},
    {"english": "He studied the orchestration techniques of Ravel and Stravinsky.", "spanish": "Él estudió las técnicas de orquestación de Ravel y Stravinsky.", "level": 3},
    {"english": "They practiced advanced ensemble coordination for the concert.", "spanish": "Practicaron coordinación avanzada de conjunto para el concierto.", "level": 3},
    {"english": "I am exploring thematic development in symphonic compositions.", "spanish": "Estoy explorando el desarrollo temático en composiciones sinfónicas.", "level": 3},
    {"english": "She performed an improvisational piece that required high technical skill.", "spanish": "Ella interpretó una pieza improvisada que requería alta habilidad técnica.", "level": 3},
    {"english": "He composed a suite integrating diverse cultural musical elements.", "spanish": "Él compuso una suite integrando diversos elementos musicales culturales.", "level": 3},
    {"english": "We recorded a polyphonic composition emphasizing independent lines.", "spanish": "Grabamos una composición polifónica enfatizando líneas independientes.", "level": 3},
    {"english": "I analyzed the counter-melodies to understand complex orchestration.", "spanish": "Analicé las contramelodías para entender la orquestación compleja.", "level": 3},
    {"english": "She experimented with rhythmic displacement to create tension in music.", "spanish": "Ella experimentó con desplazamiento rítmico para crear tensión en la música.", "level": 3},
    {"english": "He practices advanced improvisation techniques daily on the piano.", "spanish": "Él practica técnicas avanzadas de improvisación a diario en el piano.", "level": 3},
    {"english": "They composed a multi-movement piece exploring different textures.", "spanish": "Compusieron una pieza de múltiples movimientos explorando diferentes texturas.", "level": 3},
    {"english": "I am studying polytonality to expand my compositional vocabulary.", "spanish": "Estoy estudiando politonalidad para ampliar mi vocabulario compositivo.", "level": 3},
    {"english": "She recorded a complex vocal arrangement with precise timing.", "spanish": "Ella grabó un arreglo vocal complejo con sincronización precisa.", "level": 3},
    {"english": "He analyzed the use of suspension and resolution in orchestral works.", "spanish": "Él analizó el uso de suspensiones y resoluciones en obras orquestales.", "level": 3},
    {"english": "We experimented with unusual instrumentation for a contemporary piece.", "spanish": "Experimentamos con instrumentación inusual para una pieza contemporánea.", "level": 3},
    {"english": "I composed a piece using extended techniques on the cello.", "spanish": "Compuse una pieza usando técnicas extendidas en el violonchelo.", "level": 3},
    {"english": "She studied the modal interchange in advanced jazz compositions.", "spanish": "Ella estudió la modulación modal en composiciones avanzadas de jazz.", "level": 3},
    {"english": "He is learning to create dynamic contrasts in orchestral arrangements.", "spanish": "Él está aprendiendo a crear contrastes dinámicos en arreglos orquestales.", "level": 3},
    {"english": "They performed a contemporary piece integrating improvisation and fixed notation.", "spanish": "Interpretaron una pieza contemporánea integrando improvisación y notación fija.", "level": 3},
    {"english": "I enjoy analyzing the interplay between melody, harmony, and rhythm.", "spanish": "Disfruto analizar la interacción entre melodía, armonía y ritmo.", "level": 3},
    {"english": "She recorded a multitrack jazz composition with layered solos.", "spanish": "Ella grabó una composición de jazz multitrack con solos superpuestos.", "level": 3},
    {"english": "He composed a fugue that adheres to classical contrapuntal principles.", "spanish": "Él compuso una fuga que sigue los principios contrapuntísticos clásicos.", "level": 3},
    {"english": "We explored polyrhythmic textures to add complexity to our music.", "spanish": "Exploramos texturas polirrítmicas para añadir complejidad a nuestra música.", "level": 3},
    {"english": "I analyzed the voice leading in late Romantic symphonies.", "spanish": "Analicé la conducción de voces en sinfonías del Romanticismo tardío.", "level": 3},
    {"english": "She performed a technically demanding piano sonata with precision.", "spanish": "Ella interpretó una sonata de piano técnicamente exigente con precisión.", "level": 3},
    {"english": "He experiments with harmonic overtones to enrich musical textures.", "spanish": "Él experimenta con sobretonos armónicos para enriquecer las texturas musicales.", "level": 3},
    {"english": "They composed an avant-garde piece using non-standard scales.", "spanish": "Compusieron una pieza vanguardista usando escalas no estándar.", "level": 3},
    {"english": "I am studying advanced orchestral techniques to improve my scores.", "spanish": "Estoy estudiando técnicas orquestales avanzadas para mejorar mis partituras.", "level": 3},
    {"english": "She recorded a layered composition emphasizing counterpoint.", "spanish": "Ella grabó una composición superpuesta enfatizando el contrapunto.", "level": 3},
    {"english": "He practices advanced jazz improvisation over complex chord changes.", "spanish": "Él practica improvisación avanzada de jazz sobre cambios de acordes complejos.", "level": 3},
    {"english": "We analyzed orchestration techniques in 20th-century compositions.", "spanish": "Analizamos técnicas de orquestación en composiciones del siglo XX.", "level": 3},
    {"english": "I composed a piece that transitions smoothly between multiple time signatures.", "spanish": "Compuse una pieza que transita suavemente entre múltiples compases.", "level": 3},
    {"english": "She performed a challenging improvisation over a complex harmonic framework.", "spanish": "Ella interpretó una improvisación desafiante sobre un marco armónico complejo.", "level": 3},
    {"english": "He studies extended jazz harmonies to create richer textures.", "spanish": "Él estudia armonías extendidas de jazz para crear texturas más ricas.", "level": 3},
    {"english": "They are preparing a complex orchestral arrangement for the concert hall.", "spanish": "Están preparando un arreglo orquestal complejo para la sala de conciertos.", "level": 3},
    {"english": "I enjoy analyzing microtonal elements in experimental compositions.", "spanish": "Disfruto analizar elementos microtonales en composiciones experimentales.", "level": 3},
    {"english": "She arranged a contemporary piece to highlight the unique qualities of each instrument.", "spanish": "Ella arregló una pieza contemporánea para resaltar las cualidades únicas de cada instrumento.", "level": 3},
    {"english": "He composed a suite exploring multiple musical ideas and textures.", "spanish": "Él compuso una suite explorando múltiples ideas y texturas musicales.", "level": 3},
    {"english": "We rehearsed the intricate symphonic work until every detail was precise.", "spanish": "Ensayamos la compleja obra sinfónica hasta que cada detalle fuera preciso.", "level": 3},
    {"english": "I am learning to apply advanced counterpoint in my own compositions.", "spanish": "Estoy aprendiendo a aplicar contrapunto avanzado en mis propias composiciones.", "level": 3}
  ],
  "medicine": [
    {"english": "Doctors help people stay healthy.", "spanish": "Los médicos ayudan a las personas a mantenerse saludables.", "level": 1},
    {"english": "Nurses take care of patients in hospitals.", "spanish": "Las enfermeras cuidan a los pacientes en los hospitales.", "level": 1},
    {"english": "He takes medicine every morning.", "spanish": "Él toma medicina todas las mañanas.", "level": 1},
    {"english": "She has a fever and needs to rest.", "spanish": "Ella tiene fiebre y necesita descansar.", "level": 1},
    {"english": "The clinic opens at eight o'clock.", "spanish": "La clínica abre a las ocho en punto.", "level": 1},
    {"english": "They wash their hands before eating.", "spanish": "Se lavan las manos antes de comer.", "level": 1},
    {"english": "The patient needs a check-up.", "spanish": "El paciente necesita un chequeo.", "level": 1},
    {"english": "He broke his arm while playing soccer.", "spanish": "Se rompió el brazo jugando al fútbol.", "level": 1},
    {"english": "She feels better after taking the medicine.", "spanish": "Se siente mejor después de tomar la medicina.", "level": 1},
    {"english": "The hospital has many doctors and nurses.", "spanish": "El hospital tiene muchos médicos y enfermeras.", "level": 1},
    {"english": "He is allergic to peanuts.", "spanish": "Él es alérgico a los cacahuetes.", "level": 1},
    {"english": "She visits the dentist every six months.", "spanish": "Ella visita al dentista cada seis meses.", "level": 1},
    {"english": "The baby is crying because he is hungry.", "spanish": "El bebé está llorando porque tiene hambre.", "level": 1},
    {"english": "He needs a prescription from the doctor.", "spanish": "Él necesita una receta del médico.", "level": 1},
    {"english": "The nurse gives the patient a shot.", "spanish": "La enfermera le pone una inyección al paciente.", "level": 1},
    {"english": "She has a cold and a sore throat.", "spanish": "Ella tiene un resfriado y dolor de garganta.", "level": 1},
    {"english": "They wash the wounds to prevent infection.", "spanish": "Lavan las heridas para prevenir infecciones.", "level": 1},
    {"english": "He is in the hospital for surgery.", "spanish": "Él está en el hospital para una cirugía.", "level": 1},
    {"english": "The doctor listens to the patient's heart.", "spanish": "El doctor escucha el corazón del paciente.", "level": 1},
    {"english": "She drinks water to stay hydrated.", "spanish": "Ella bebe agua para mantenerse hidratada.", "level": 1},
    {"english": "He takes vitamins every day.", "spanish": "Él toma vitaminas todos los días.", "level": 1},
    {"english": "The patient is recovering from the flu.", "spanish": "El paciente se está recuperando de la gripe.", "level": 1},
    {"english": "She has a headache and needs rest.", "spanish": "Ella tiene dolor de cabeza y necesita descansar.", "level": 1},
    {"english": "The clinic provides medical care for children.", "spanish": "La clínica brinda atención médica para niños.", "level": 1},
    {"english": "He wears a mask to avoid germs.", "spanish": "Él usa una mascarilla para evitar gérmenes.", "level": 1},
    {"english": "She checks her blood pressure regularly.", "spanish": "Ella revisa su presión arterial regularmente.", "level": 1},
    {"english": "The doctor gives advice for a healthy diet.", "spanish": "El doctor da consejos para una dieta saludable.", "level": 1},
    {"english": "He feels pain in his stomach.", "spanish": "Él siente dolor en el estómago.", "level": 1},
    {"english": "She needs to take medicine twice a day.", "spanish": "Ella necesita tomar medicina dos veces al día.", "level": 1},
    {"english": "The nurse measures the patient's temperature.", "spanish": "La enfermera mide la temperatura del paciente.", "level": 1},
    {"english": "He has a rash on his arm.", "spanish": "Él tiene un sarpullido en el brazo.", "level": 1},
    {"english": "She goes to the pharmacy to buy medicine.", "spanish": "Ella va a la farmacia a comprar medicina.", "level": 1},
    {"english": "The hospital room is clean and bright.", "spanish": "La habitación del hospital es limpia y luminosa.", "level": 1},
    {"english": "He rests in bed because he is sick.", "spanish": "Él descansa en la cama porque está enfermo.", "level": 1},
    {"english": "She eats fruits and vegetables to stay healthy.", "spanish": "Ella come frutas y verduras para mantenerse saludable.", "level": 1},
    {"english": "The doctor examines the patient's eyes.", "spanish": "El doctor examina los ojos del paciente.", "level": 1},
    {"english": "He washes his hands before cooking.", "spanish": "Él se lava las manos antes de cocinar.", "level": 1},
    {"english": "She takes care of her sick grandmother.", "spanish": "Ella cuida a su abuela enferma.", "level": 1},
    {"english": "The clinic offers free vaccines for children.", "spanish": "La clínica ofrece vacunas gratis para los niños.", "level": 1},
    {"english": "He wears a bandage on his injured knee.", "spanish": "Él lleva un vendaje en la rodilla lesionada.", "level": 1},
    {"english": "She follows the doctor's instructions carefully.", "spanish": "Ella sigue las instrucciones del médico cuidadosamente.", "level": 1},
    {"english": "The patient waits in the waiting room.", "spanish": "El paciente espera en la sala de espera.", "level": 1},
    {"english": "He avoids sugar to protect his teeth.", "spanish": "Él evita el azúcar para proteger sus dientes.", "level": 1},
    {"english": "She feels dizzy after standing up quickly.", "spanish": "Ella se siente mareada después de levantarse rápido.", "level": 1},
    {"english": "The nurse checks the patient's heartbeat.", "spanish": "La enfermera revisa el ritmo cardíaco del paciente.", "level": 1},
    {"english": "He has a cough and a runny nose.", "spanish": "Él tiene tos y secreción nasal.", "level": 1},
    {"english": "She goes to the hospital for a check-up.", "spanish": "Ella va al hospital para un chequeo.", "level": 1},
    {"english": "The doctor writes a prescription for antibiotics.", "spanish": "El doctor escribe una receta de antibióticos.", "level": 1},
    {"english": "He needs to rest after the surgery.", "spanish": "Él necesita descansar después de la cirugía.", "level": 1},
    {"english": "She drinks herbal tea to feel better.", "spanish": "Ella bebe té de hierbas para sentirse mejor.", "level": 1},
    {"english": "The hospital has an emergency room open 24 hours.", "spanish": "El hospital tiene una sala de emergencias abierta las 24 horas.", "level": 1},
    {"english": "He avoids junk food to maintain his health.", "spanish": "Él evita la comida chatarra para mantener su salud.", "level": 1},
    {"english": "She feels tired because she has a cold.", "spanish": "Ella se siente cansada porque tiene un resfriado.", "level": 1},
    {"english": "The nurse gives instructions on how to take the medicine.", "spanish": "La enfermera da instrucciones sobre cómo tomar la medicina.", "level": 1},
    {"english": "He uses a thermometer to check his temperature.", "spanish": "Él usa un termómetro para revisar su temperatura.", "level": 1},
    {"english": "She wears gloves when handling medical equipment.", "spanish": "Ella usa guantes al manejar equipo médico.", "level": 1},
    {"english": "The patient is feeling better after the treatment.", "spanish": "El paciente se siente mejor después del tratamiento.", "level": 1},
    {"english": "He takes a short walk to improve his health.", "spanish": "Él da un paseo corto para mejorar su salud.", "level": 1},
    {"english": "She has a healthy diet with fruits and vegetables.", "spanish": "Ella tiene una dieta saludable con frutas y verduras.", "level": 1},
    {"english": "The doctor listens carefully to the patient's symptoms.", "spanish": "El doctor escucha atentamente los síntomas del paciente.", "level": 1},
    {"english": "He applies a bandage to the cut on his hand.", "spanish": "Él aplica un vendaje en el corte de su mano.", "level": 1},
    {"english": "She takes medicine when she has a headache.", "spanish": "Ella toma medicina cuando tiene dolor de cabeza.", "level": 1},
    {"english": "The hospital provides care for sick and injured people.", "spanish": "El hospital brinda atención a personas enfermas y heridas.", "level": 1},
    {"english": "He brushes his teeth twice a day.", "spanish": "Él se cepilla los dientes dos veces al día.", "level": 1},
    {"english": "She rests in bed when she feels sick.", "spanish": "Ella descansa en la cama cuando se siente enferma.", "level": 1},
    {"english": "The nurse helps the patient with daily tasks.", "spanish": "La enfermera ayuda al paciente con tareas diarias.", "level": 1},
    {"english": "He wears a mask to protect others from germs.", "spanish": "Él usa una mascarilla para proteger a otros de los gérmenes.", "level": 1},
    {"english": "She drinks water to prevent dehydration.", "spanish": "Ella bebe agua para prevenir la deshidratación.", "level": 1},
    {"english": "The doctor examines the patient carefully.", "spanish": "El doctor examina al paciente cuidadosamente.", "level": 1},
    {"english": "He avoids contact with sick people to stay healthy.", "spanish": "Él evita el contacto con personas enfermas para mantenerse saludable.", "level": 1},
    {"english": "She takes care of her teeth by brushing and flossing.", "spanish": "Ella cuida sus dientes cepillándose y usando hilo dental.", "level": 1},
    {"english": "The patient needs to rest and drink fluids.", "spanish": "El paciente necesita descansar y beber líquidos.", "level": 1},
    {"english": "He has an appointment with the doctor tomorrow.", "spanish": "Él tiene una cita con el médico mañana.", "level": 1},
    {"english": "She avoids eating too much sugar.", "spanish": "Ella evita comer demasiado azúcar.", "level": 1},
    {"english": "The nurse checks the patient's breathing.", "spanish": "La enfermera revisa la respiración del paciente.", "level": 1},
    {"english": "He follows a healthy lifestyle with exercise.", "spanish": "Él sigue un estilo de vida saludable con ejercicio.", "level": 1},
    {"english": "She has a small cut and needs a bandage.", "spanish": "Ella tiene un corte pequeño y necesita un vendaje.", "level": 1},
    {"english": "The doctor advises regular check-ups for prevention.", "spanish": "El doctor aconseja chequeos regulares para prevención.", "level": 1},
    {"english": "He feels better after a good night's sleep.", "spanish": "Él se siente mejor después de una buena noche de sueño.", "level": 1},
    {"english": "She drinks tea to soothe her throat.", "spanish": "Ella bebe té para calmar su garganta.", "level": 1},
    {"english": "The patient takes medicine as prescribed by the doctor.", "spanish": "El paciente toma medicina según lo prescrito por el médico.", "level": 1},
    {"english": "He goes to the hospital for a medical test.", "spanish": "Él va al hospital para un examen médico.", "level": 1},
    {"english": "She wears a mask in the hospital to stay safe.", "spanish": "Ella usa mascarilla en el hospital para mantenerse segura.", "level": 1},
    {"english": "The nurse helps the patient take their medicine.", "spanish": "La enfermera ayuda al paciente a tomar su medicina.", "level": 1},
    {"english": "He avoids smoking to keep his lungs healthy.", "spanish": "Él evita fumar para mantener sus pulmones saludables.", "level": 1},
    {"english": "She exercises regularly to stay fit.", "spanish": "Ella hace ejercicio regularmente para mantenerse en forma.", "level": 1},
    {"english": "The doctor gives instructions for recovery.", "spanish": "El doctor da instrucciones para la recuperación.", "level": 1},
    {"english": "He drinks water after exercising.", "spanish": "Él bebe agua después de hacer ejercicio.", "level": 1},
    {"english": "She eats healthy food to stay strong.", "spanish": "Ella come comida saludable para mantenerse fuerte.", "level": 1},
    {"english": "The patient rests after a medical procedure.", "spanish": "El paciente descansa después de un procedimiento médico.", "level": 1},
    {"english": "He checks his temperature when he feels sick.", "spanish": "Él revisa su temperatura cuando se siente enfermo.", "level": 1},
    {"english": "She follows a balanced diet for good health.", "spanish": "Ella sigue una dieta balanceada para buena salud.", "level": 1},
    {"english": "The nurse helps the patient walk after surgery.", "spanish": "La enfermera ayuda al paciente a caminar después de la cirugía.", "level": 1},
    {"english": "He avoids junk food and eats fruits.", "spanish": "Él evita la comida chatarra y come frutas.", "level": 1},
    {"english": "She goes to the doctor for a regular check-up.", "spanish": "Ella va al doctor para un chequeo regular.", "level": 1},
    {"english": "The hospital staff is friendly and helpful.", "spanish": "El personal del hospital es amable y servicial.", "level": 1},
    {"english": "He takes medicine to control his blood pressure.", "spanish": "Él toma medicina para controlar su presión arterial.", "level": 1},
    {"english": "She feels better after resting for a while.", "spanish": "Ella se siente mejor después de descansar un rato.", "level": 1},
    {"english": "The doctor recommends exercise for good health.", "spanish": "El doctor recomienda ejercicio para buena salud.", "level": 1},
    {"english": "He washes his hands to prevent illness.", "spanish": "Él se lava las manos para prevenir enfermedades.", "level": 1},

    {"english": "The patient presents with acute abdominal pain.", "spanish": "El paciente se presenta con dolor abdominal agudo.", "level": 2},
    {"english": "The physician ordered a complete blood count.", "spanish": "El médico ordenó un hemograma completo.", "level": 2},
    {"english": "The nurse administered the intravenous antibiotics.", "spanish": "La enfermera administró los antibióticos por vía intravenosa.", "level": 2},
    {"english": "He is scheduled for a cardiac catheterization.", "spanish": "Está programado para una cateterización cardíaca.", "level": 2},
    {"english": "The patient exhibits signs of respiratory distress.", "spanish": "El paciente muestra signos de dificultad respiratoria.", "level": 2},
    {"english": "She has a history of hypertension and diabetes.", "spanish": "Ella tiene antecedentes de hipertensión y diabetes.", "level": 2},
    {"english": "The surgeon performed a laparoscopic appendectomy.", "spanish": "El cirujano realizó una apendicectomía laparoscópica.", "level": 2},
    {"english": "The ECG shows signs of myocardial infarction.", "spanish": "El ECG muestra signos de infarto de miocardio.", "level": 2},
    {"english": "The patient requires oxygen therapy.", "spanish": "El paciente requiere oxigenoterapia.", "level": 2},
    {"english": "She was diagnosed with chronic obstructive pulmonary disease.", "spanish": "Se le diagnosticó enfermedad pulmonar obstructiva crónica.", "level": 2},
    {"english": "The doctor prescribed an antihypertensive medication.", "spanish": "El médico prescribió un medicamento antihipertensivo.", "level": 2},
    {"english": "He is recovering from a cerebrovascular accident.", "spanish": "Se está recuperando de un accidente cerebrovascular.", "level": 2},
    {"english": "The lab results indicate elevated liver enzymes.", "spanish": "Los resultados de laboratorio indican enzimas hepáticas elevadas.", "level": 2},
    {"english": "She underwent magnetic resonance imaging of the brain.", "spanish": "Ella se sometió a una resonancia magnética cerebral.", "level": 2},
    {"english": "The patient has a pulmonary embolism.", "spanish": "El paciente tiene una embolia pulmonar.", "level": 2},
    {"english": "The physician explained the risks of the procedure.", "spanish": "El médico explicó los riesgos del procedimiento.", "level": 2},
    {"english": "He is being treated for bacterial pneumonia.", "spanish": "Está siendo tratado por neumonía bacteriana.", "level": 2},
    {"english": "The nurse monitored the patient's vital signs.", "spanish": "La enfermera monitoreó los signos vitales del paciente.", "level": 2},
    {"english": "She has an elevated white blood cell count.", "spanish": "Ella tiene un recuento elevado de glóbulos blancos.", "level": 2},
    {"english": "The patient requires intravenous fluids.", "spanish": "El paciente requiere líquidos intravenosos.", "level": 2},
    {"english": "The cardiologist recommended a stress test.", "spanish": "El cardiólogo recomendó una prueba de esfuerzo.", "level": 2},
    {"english": "He suffers from chronic kidney disease.", "spanish": "Sufre de enfermedad renal crónica.", "level": 2},
    {"english": "The patient is on anticoagulant therapy.", "spanish": "El paciente está en terapia anticoagulante.", "level": 2},
    {"english": "She experienced an adverse drug reaction.", "spanish": "Ella experimentó una reacción adversa a un medicamento.", "level": 2},
    {"english": "The surgeon performed a coronary artery bypass graft.", "spanish": "El cirujano realizó un injerto de derivación de la arteria coronaria.", "level": 2},
    {"english": "The patient is undergoing chemotherapy for cancer.", "spanish": "El paciente está recibiendo quimioterapia para el cáncer.", "level": 2},
    {"english": "The lab tests confirmed the presence of a bacterial infection.", "spanish": "Los análisis de laboratorio confirmaron la presencia de una infección bacteriana.", "level": 2},
    {"english": "She was admitted to the intensive care unit.", "spanish": "Ella fue admitida en la unidad de cuidados intensivos.", "level": 2},
    {"english": "The physician ordered a chest X-ray.", "spanish": "El médico ordenó una radiografía de tórax.", "level": 2},
    {"english": "He presented with acute chest pain.", "spanish": "Se presentó con dolor torácico agudo.", "level": 2},
    {"english": "The nurse inserted a urinary catheter.", "spanish": "La enfermera insertó un catéter urinario.", "level": 2},
    {"english": "The patient has a history of asthma.", "spanish": "El paciente tiene antecedentes de asma.", "level": 2},
    {"english": "She developed postoperative complications.", "spanish": "Ella desarrolló complicaciones postoperatorias.", "level": 2},
    {"english": "The doctor administered a pain-relief injection.", "spanish": "El médico administró una inyección analgésica.", "level": 2},
    {"english": "He was diagnosed with type 2 diabetes mellitus.", "spanish": "Fue diagnosticado con diabetes mellitus tipo 2.", "level": 2},
    {"english": "The patient requires regular blood sugar monitoring.", "spanish": "El paciente requiere monitoreo regular de la glucosa en sangre.", "level": 2},
    {"english": "She was treated with antiviral medication.", "spanish": "Fue tratada con medicación antiviral.", "level": 2},
    {"english": "The nurse provided wound care instructions.", "spanish": "La enfermera proporcionó instrucciones para el cuidado de heridas.", "level": 2},
    {"english": "He has a high cholesterol level.", "spanish": "Él tiene un nivel alto de colesterol.", "level": 2},
    {"english": "The patient is scheduled for a colonoscopy.", "spanish": "El paciente está programado para una colonoscopia.", "level": 2},
    {"english": "She experienced shortness of breath.", "spanish": "Ella experimentó dificultad para respirar.", "level": 2},
    {"english": "The physician recommended lifestyle modifications.", "spanish": "El médico recomendó modificaciones en el estilo de vida.", "level": 2},
    {"english": "He is being evaluated for liver disease.", "spanish": "Está siendo evaluado por enfermedad hepática.", "level": 2},
    {"english": "The patient reports recurrent headaches.", "spanish": "El paciente reporta dolores de cabeza recurrentes.", "level": 2},
    {"english": "She underwent a thyroid function test.", "spanish": "Se sometió a un examen de función tiroidea.", "level": 2},
    {"english": "The doctor performed a neurological examination.", "spanish": "El médico realizó un examen neurológico.", "level": 2},
    {"english": "He requires regular dialysis sessions.", "spanish": "Él requiere sesiones regulares de diálisis.", "level": 2},
    {"english": "The patient has signs of dehydration.", "spanish": "El paciente presenta signos de deshidratación.", "level": 2},
    {"english": "She was given a prescription for antihistamines.", "spanish": "Se le dio una receta de antihistamínicos.", "level": 2},
    {"english": "The nurse checked the patient's oxygen saturation.", "spanish": "La enfermera verificó la saturación de oxígeno del paciente.", "level": 2},
    {"english": "He is recovering from a surgical procedure.", "spanish": "Se está recuperando de un procedimiento quirúrgico.", "level": 2},
    {"english": "The patient reports abdominal bloating.", "spanish": "El paciente reporta distensión abdominal.", "level": 2},
    {"english": "She experienced nausea and vomiting.", "spanish": "Ella experimentó náuseas y vómitos.", "level": 2},
    {"english": "The physician recommended a low-sodium diet.", "spanish": "El médico recomendó una dieta baja en sodio.", "level": 2},
    {"english": "He underwent a magnetic resonance angiography.", "spanish": "Se sometió a una angiografía por resonancia magnética.", "level": 2},
    {"english": "The patient requires pain management therapy.", "spanish": "El paciente requiere terapia para el manejo del dolor.", "level": 2},
    {"english": "She has a family history of cardiovascular disease.", "spanish": "Ella tiene antecedentes familiares de enfermedad cardiovascular.", "level": 2},
    {"english": "The doctor evaluated the patient's reflexes.", "spanish": "El médico evaluó los reflejos del paciente.", "level": 2},
    {"english": "He is being monitored for arrhythmia.", "spanish": "Está siendo monitoreado por arritmia.", "level": 2},
    {"english": "The patient experienced dizziness and vertigo.", "spanish": "El paciente experimentó mareos y vértigo.", "level": 2},
    {"english": "She requires vaccination against influenza.", "spanish": "Ella requiere vacunación contra la influenza.", "level": 2},
    {"english": "The nurse prepared the patient for surgery.", "spanish": "La enfermera preparó al paciente para la cirugía.", "level": 2},
    {"english": "He is receiving intravenous nutrition.", "spanish": "Está recibiendo nutrición intravenosa.", "level": 2},
    {"english": "The patient is experiencing chronic pain.", "spanish": "El paciente experimenta dolor crónico.", "level": 2},
    {"english": "She underwent a biopsy to confirm the diagnosis.", "spanish": "Se sometió a una biopsia para confirmar el diagnóstico.", "level": 2},
    {"english": "The physician prescribed anti-inflammatory medication.", "spanish": "El médico prescribió medicación antiinflamatoria.", "level": 2},
    {"english": "He has elevated blood pressure readings.", "spanish": "Él tiene lecturas elevadas de presión arterial.", "level": 2},
    {"english": "The patient experienced an allergic reaction.", "spanish": "El paciente experimentó una reacción alérgica.", "level": 2},
    {"english": "She requires physical therapy after surgery.", "spanish": "Ella requiere fisioterapia después de la cirugía.", "level": 2},
    {"english": "The doctor recommended a follow-up visit in two weeks.", "spanish": "El médico recomendó una visita de seguimiento en dos semanas.", "level": 2},
    {"english": "He has a diagnosis of osteoarthritis.", "spanish": "Él tiene un diagnóstico de osteoartritis.", "level": 2},
    {"english": "The nurse recorded the patient's intake and output.", "spanish": "La enfermera registró la ingesta y eliminación del paciente.", "level": 2},
    {"english": "The patient is on a restricted diet.", "spanish": "El paciente sigue una dieta restringida.", "level": 2},
    {"english": "She is being treated for an acute urinary tract infection.", "spanish": "Ella está siendo tratada por una infección urinaria aguda.", "level": 2},
    {"english": "The physician administered a local anesthetic.", "spanish": "El médico administró un anestésico local.", "level": 2},
    {"english": "He is undergoing rehabilitation after a stroke.", "spanish": "Está en rehabilitación después de un accidente cerebrovascular.", "level": 2},
    {"english": "The patient experienced sudden chest tightness.", "spanish": "El paciente experimentó opresión torácica súbita.", "level": 2},
    {"english": "She was prescribed an inhaler for asthma.", "spanish": "Se le recetó un inhalador para el asma.", "level": 2},
    {"english": "The doctor explained the importance of medication adherence.", "spanish": "El médico explicó la importancia de la adherencia a la medicación.", "level": 2},
    {"english": "He has been diagnosed with a benign tumor.", "spanish": "Ha sido diagnosticado con un tumor benigno.", "level": 2},
    {"english": "The patient reports fatigue and weakness.", "spanish": "El paciente reporta fatiga y debilidad.", "level": 2},
    {"english": "She is being evaluated for gastrointestinal bleeding.", "spanish": "Está siendo evaluada por sangrado gastrointestinal.", "level": 2},
    {"english": "The nurse monitored the patient for signs of infection.", "spanish": "La enfermera monitoreó al paciente en busca de signos de infección.", "level": 2},
    {"english": "He is on a regimen of anticoagulant medication.", "spanish": "Está en un régimen de medicación anticoagulante.", "level": 2},
    {"english": "The doctor requested a liver function panel.", "spanish": "El médico solicitó un panel de función hepática.", "level": 2},
    {"english": "She has chronic back pain requiring regular therapy.", "spanish": "Ella tiene dolor lumbar crónico que requiere terapia regular.", "level": 2},
    {"english": "The patient experienced dizziness when standing.", "spanish": "El paciente experimentó mareos al ponerse de pie.", "level": 2},
    {"english": "He requires monitoring of his electrolyte levels.", "spanish": "Requiere monitoreo de sus niveles de electrolitos.", "level": 2},
    {"english": "The physician explained the pathophysiology of the disease.", "spanish": "El médico explicó la fisiopatología de la enfermedad.", "level": 2},
    {"english": "She is being treated for a severe allergic reaction.", "spanish": "Está siendo tratada por una reacción alérgica grave.", "level": 2},
    {"english": "The patient is on a course of intravenous antibiotics.", "spanish": "El paciente está en un curso de antibióticos intravenosos.", "level": 2},
    {"english": "He underwent endoscopy to examine the gastrointestinal tract.", "spanish": "Se sometió a una endoscopia para examinar el tracto gastrointestinal.", "level": 2},
    {"english": "The nurse explained the procedure to the patient.", "spanish": "La enfermera explicó el procedimiento al paciente.", "level": 2},
    {"english": "She requires close observation after the operation.", "spanish": "Requiere observación cercana después de la operación.", "level": 2},
    {"english": "The patient reports intermittent chest pain.", "spanish": "El paciente reporta dolor torácico intermitente.", "level": 2},
    {"english": "He is receiving corticosteroid therapy for inflammation.", "spanish": "Está recibiendo terapia con corticosteroides para la inflamación.", "level": 2},
    {"english": "The physician instructed the patient to monitor blood glucose.", "spanish": "El médico instruyó al paciente a monitorear la glucosa en sangre.", "level": 2},
    {"english": "She underwent a bone density scan.", "spanish": "Se sometió a una densitometría ósea.", "level": 2},
    {"english": "The patient exhibits symptoms of dehydration.", "spanish": "El paciente presenta síntomas de deshidratación.", "level": 2},
    {"english": "He was prescribed a beta-blocker for hypertension.", "spanish": "Se le recetó un beta-bloqueante para la hipertensión.", "level": 2},
    {"english": "The nurse observed the patient's postural changes.", "spanish": "La enfermera observó los cambios posturales del paciente.", "level": 2},
    {"english": "She experienced severe migraine attacks.", "spanish": "Experimentó ataques de migraña severos.", "level": 2},
    {"english": "The doctor evaluated the patient for neuropathy.", "spanish": "El médico evaluó al paciente por neuropatía.", "level": 2},
    {"english": "He is being treated for acute renal failure.", "spanish": "Está siendo tratado por insuficiencia renal aguda.", "level": 2},
    {"english": "The patient requires oxygen saturation monitoring.", "spanish": "El paciente requiere monitoreo de saturación de oxígeno.", "level": 2},
    {"english": "She received a blood transfusion.", "spanish": "Recibió una transfusión de sangre.", "level": 2},
    {"english": "The physician recommended colon cancer screening.", "spanish": "El médico recomendó tamizaje para cáncer de colon.", "level": 2},
    {"english": "He developed postoperative fever.", "spanish": "Desarrolló fiebre postoperatoria.", "level": 2},
    {"english": "The nurse documented the patient's symptoms accurately.", "spanish": "La enfermera documentó los síntomas del paciente con precisión.", "level": 2},
    {"english": "She is on long-term anticoagulant therapy.", "spanish": "Está en terapia anticoagulante a largo plazo.", "level": 2},
    {"english": "The patient was evaluated for a possible stroke.", "spanish": "El paciente fue evaluado por un posible accidente cerebrovascular.", "level": 2},
    {"english": "He is receiving intravenous pain medication.", "spanish": "Está recibiendo medicación para el dolor por vía intravenosa.", "level": 2},
    {"english": "The doctor assessed the patient's neurological status.", "spanish": "El médico evaluó el estado neurológico del paciente.", "level": 2},
    {"english": "She was prescribed a diuretic for edema.", "spanish": "Se le recetó un diurético para el edema.", "level": 2},
    {"english": "The patient is being monitored for signs of infection.", "spanish": "El paciente está siendo monitoreado por signos de infección.", "level": 2},
    {"english": "He has a history of chronic obstructive pulmonary disease.", "spanish": "Tiene antecedentes de enfermedad pulmonar obstructiva crónica.", "level": 2},
    {"english": "The nurse explained the importance of medication adherence.", "spanish": "La enfermera explicó la importancia de la adherencia a la medicación.", "level": 2},
    {"english": "She is scheduled for a mammography screening.", "spanish": "Está programada para un tamizaje de mamografía.", "level": 2},
    {"english": "The patient exhibited hypotension during the procedure.", "spanish": "El paciente presentó hipotensión durante el procedimiento.", "level": 2},
    {"english": "He is being evaluated for diabetic neuropathy.", "spanish": "Está siendo evaluado por neuropatía diabética.", "level": 2},
    {"english": "The physician recommended vaccination against hepatitis B.", "spanish": "El médico recomendó vacunación contra la hepatitis B.", "level": 2},
    {"english": "She experienced postprandial hyperglycemia.", "spanish": "Experimentó hiperglucemia posprandial.", "level": 2},
    {"english": "The nurse monitored the patient's infusion rate.", "spanish": "La enfermera monitoreó la velocidad de infusión del paciente.", "level": 2},
    {"english": "He is recovering from a traumatic brain injury.", "spanish": "Se está recuperando de una lesión cerebral traumática.", "level": 2},
    {"english": "The patient requires a gastrostomy tube for nutrition.", "spanish": "El paciente requiere una sonda de gastrostomía para nutrición.", "level": 2},
    {"english": "She underwent echocardiography to assess heart function.", "spanish": "Se sometió a una ecocardiografía para evaluar la función cardíaca.", "level": 2},
    {"english": "The physician diagnosed a pulmonary infection.", "spanish": "El médico diagnosticó una infección pulmonar.", "level": 2},
    {"english": "He experienced syncope during exertion.", "spanish": "Experimentó síncope durante el esfuerzo.", "level": 2},
    {"english": "The patient is on strict bed rest.", "spanish": "El paciente está en reposo absoluto.", "level": 2},
    {"english": "She was prescribed an ACE inhibitor for hypertension.", "spanish": "Se le recetó un inhibidor de la ECA para la hipertensión.", "level": 2},
    {"english": "The nurse monitored the patient's neurological signs.", "spanish": "La enfermera monitoreó los signos neurológicos del paciente.", "level": 2},
    {"english": "He is being treated for acute heart failure.", "spanish": "Está siendo tratado por insuficiencia cardíaca aguda.", "level": 2},
    {"english": "The patient exhibits tachycardia.", "spanish": "El paciente presenta taquicardia.", "level": 2},
    {"english": "She underwent a lumbar puncture for cerebrospinal fluid analysis.", "spanish": "Se sometió a una punción lumbar para análisis de líquido cefalorraquídeo.", "level": 2},

    {"english": "The patient underwent a coronary angioplasty with stent placement.", "spanish": "El paciente se sometió a una angioplastia coronaria con colocación de stent.", "level": 3},
    {"english": "He was diagnosed with acute myeloid leukemia after bone marrow biopsy.", "spanish": "Fue diagnosticado con leucemia mieloide aguda tras una biopsia de médula ósea.", "level": 3},
    {"english": "The neurosurgeon performed a craniotomy to remove a glioblastoma.", "spanish": "El neurocirujano realizó una craneotomía para extirpar un glioblastoma.", "level": 3},
    {"english": "The patient presents with disseminated intravascular coagulation.", "spanish": "El paciente presenta coagulación intravascular diseminada.", "level": 3},
    {"english": "She is receiving immunotherapy for metastatic melanoma.", "spanish": "Está recibiendo inmunoterapia para melanoma metastásico.", "level": 3},
    {"english": "The intensive care team managed septic shock with vasopressors.", "spanish": "El equipo de cuidados intensivos manejó un shock séptico con vasopresores.", "level": 3},
    {"english": "He developed acute respiratory distress syndrome after aspiration.", "spanish": "Desarrolló síndrome de dificultad respiratoria aguda tras una aspiración.", "level": 3},
    {"english": "The patient underwent laparoscopic cholecystectomy for gallstones.", "spanish": "El paciente se sometió a una colecistectomía laparoscópica por cálculos biliares.", "level": 3},
    {"english": "She was diagnosed with autoimmune hepatitis based on serology and biopsy.", "spanish": "Fue diagnosticada con hepatitis autoinmune según serología y biopsia.", "level": 3},
    {"english": "The cardiologist identified atrial fibrillation with rapid ventricular response.", "spanish": "El cardiólogo identificó fibrilación auricular con respuesta ventricular rápida.", "level": 3},
    {"english": "He requires extracorporeal membrane oxygenation for severe hypoxemia.", "spanish": "Requiere oxigenación por membrana extracorpórea debido a hipoxemia severa.", "level": 3},
    {"english": "The patient is on a regimen of targeted molecular therapy for lung cancer.", "spanish": "El paciente sigue un régimen de terapia molecular dirigida para cáncer de pulmón.", "level": 3},
    {"english": "She developed acute kidney injury secondary to rhabdomyolysis.", "spanish": "Desarrolló lesión renal aguda secundaria a rabdomiólisis.", "level": 3},
    {"english": "The physician recommended thromboprophylaxis to prevent deep vein thrombosis.", "spanish": "El médico recomendó tromboprofilaxis para prevenir trombosis venosa profunda.", "level": 3},
    {"english": "He underwent a stereotactic biopsy of a brain lesion.", "spanish": "Se sometió a una biopsia estereotáctica de una lesión cerebral.", "level": 3},
    {"english": "The patient exhibits signs of acute pancreatitis with elevated amylase levels.", "spanish": "El paciente presenta signos de pancreatitis aguda con niveles elevados de amilasa.", "level": 3},
    {"english": "She was treated with monoclonal antibodies for rheumatoid arthritis.", "spanish": "Fue tratada con anticuerpos monoclonales para artritis reumatoide.", "level": 3},
    {"english": "The neonate required surfactant therapy for respiratory distress syndrome.", "spanish": "El neonato requirió terapia con surfactante para el síndrome de dificultad respiratoria.", "level": 3},
    {"english": "He has a history of refractory hypertension despite multiple antihypertensives.", "spanish": "Tiene antecedentes de hipertensión refractaria a pesar de múltiples antihipertensivos.", "level": 3},
    {"english": "The patient underwent a transesophageal echocardiogram to assess valve function.", "spanish": "El paciente se sometió a un ecocardiograma transesofágico para evaluar la función valvular.", "level": 3},
    {"english": "She developed hepatotoxicity after prolonged use of high-dose acetaminophen.", "spanish": "Desarrolló hepatotoxicidad tras el uso prolongado de altas dosis de acetaminofén.", "level": 3},
    {"english": "The oncologist prescribed adjuvant chemotherapy following tumor resection.", "spanish": "El oncólogo prescribió quimioterapia adyuvante tras la resección del tumor.", "level": 3},
    {"english": "He is being monitored for neurogenic shock after spinal cord injury.", "spanish": "Está siendo monitoreado por shock neurogénico tras una lesión medular.", "level": 3},
    {"english": "The patient presents with severe electrolyte imbalance and metabolic acidosis.", "spanish": "El paciente presenta un desequilibrio electrolítico severo y acidosis metabólica.", "level": 3},
    {"english": "She underwent total hip arthroplasty due to osteonecrosis.", "spanish": "Se sometió a artroplastia total de cadera debido a osteonecrosis.", "level": 3},
    {"english": "The physician ordered continuous renal replacement therapy for acute renal failure.", "spanish": "El médico ordenó terapia de reemplazo renal continuo por insuficiencia renal aguda.", "level": 3},
    {"english": "He developed ventilator-associated pneumonia in the ICU.", "spanish": "Desarrolló neumonía asociada al ventilador en la UCI.", "level": 3},
    {"english": "The patient underwent endovascular coiling for a cerebral aneurysm.", "spanish": "El paciente se sometió a embolización endovascular para un aneurisma cerebral.", "level": 3},
    {"english": "She is receiving combination antiretroviral therapy for HIV infection.", "spanish": "Está recibiendo terapia antirretroviral combinada para la infección por VIH.", "level": 3},
    {"english": "The patient shows signs of disseminated tuberculosis.", "spanish": "El paciente muestra signos de tuberculosis diseminada.", "level": 3},
    {"english": "He was treated with corticosteroid pulse therapy for multiple sclerosis flare.", "spanish": "Fue tratado con terapia de pulso con corticosteroides por un brote de esclerosis múltiple.", "level": 3},
    {"english": "The surgeon performed a radical mastectomy with lymph node dissection.", "spanish": "El cirujano realizó una mastectomía radical con disección de ganglios linfáticos.", "level": 3},
    {"english": "The patient exhibits signs of septic encephalopathy.", "spanish": "El paciente presenta signos de encefalopatía séptica.", "level": 3},
    {"english": "She underwent high-resolution CT scan for interstitial lung disease evaluation.", "spanish": "Se sometió a una tomografía computarizada de alta resolución para evaluar enfermedad pulmonar intersticial.", "level": 3},
    {"english": "He is receiving intravenous immunoglobulin for autoimmune neuropathy.", "spanish": "Está recibiendo inmunoglobulina intravenosa por neuropatía autoinmune.", "level": 3},
    {"english": "The patient developed anaphylactic shock after exposure to a bee sting.", "spanish": "El paciente desarrolló un shock anafiláctico tras la picadura de una abeja.", "level": 3},
    {"english": "She is being evaluated for adrenal insufficiency with ACTH stimulation test.", "spanish": "Está siendo evaluada por insuficiencia suprarrenal mediante prueba de estimulación con ACTH.", "level": 3},
    {"english": "The physician recommended a percutaneous nephrolithotomy for kidney stones.", "spanish": "El médico recomendó una nefrolitotomía percutánea para cálculos renales.", "level": 3},
    {"english": "He underwent a bone marrow transplant for aplastic anemia.", "spanish": "Se sometió a un trasplante de médula ósea por anemia aplásica.", "level": 3},
    {"english": "The patient exhibits hypercapnia and hypoxemia requiring mechanical ventilation.", "spanish": "El paciente presenta hipercapnia e hipoxemia que requieren ventilación mecánica.", "level": 3},
    {"english": "She received plasmapheresis for severe autoimmune hemolytic anemia.", "spanish": "Recibió plasmaféresis por anemia hemolítica autoinmune grave.", "level": 3},
    {"english": "The physician evaluated the patient for cardiomyopathy with echocardiography.", "spanish": "El médico evaluó al paciente por miocardiopatía mediante ecocardiografía.", "level": 3},
    {"english": "He is undergoing targeted therapy with tyrosine kinase inhibitors.", "spanish": "Está recibiendo terapia dirigida con inhibidores de tirosina quinasa.", "level": 3},
    {"english": "The patient developed pulmonary edema requiring diuretics.", "spanish": "El paciente desarrolló edema pulmonar que requiere diuréticos.", "level": 3},
    {"english": "She underwent a thoracentesis for pleural effusion.", "spanish": "Se sometió a una toracocentesis por derrame pleural.", "level": 3},
    {"english": "The patient is being monitored for acute liver failure.", "spanish": "El paciente está siendo monitoreado por insuficiencia hepática aguda.", "level": 3},
    {"english": "He was diagnosed with myasthenia gravis confirmed by EMG.", "spanish": "Fue diagnosticado con miastenia gravis confirmada por electromiografía.", "level": 3},
    {"english": "The physician prescribed antifungal therapy for invasive candidiasis.", "spanish": "El médico prescribió terapia antifúngica para candidiasis invasiva.", "level": 3},
    {"english": "She developed neurogenic pulmonary edema after head trauma.", "spanish": "Desarrolló edema pulmonar neurogénico tras un trauma craneal.", "level": 3},
    {"english": "The patient underwent minimally invasive mitral valve repair.", "spanish": "El paciente se sometió a una reparación mínimamente invasiva de la válvula mitral.", "level": 3},
    {"english": "He requires continuous glucose monitoring for type 1 diabetes.", "spanish": "Requiere monitoreo continuo de glucosa por diabetes tipo 1.", "level": 3},
    {"english": "The patient exhibits pancytopenia requiring hematology evaluation.", "spanish": "El paciente presenta pancitopenia que requiere evaluación hematológica.", "level": 3},
    {"english": "She was diagnosed with systemic lupus erythematosus after serologic tests.", "spanish": "Fue diagnosticada con lupus eritematoso sistémico tras pruebas serológicas.", "level": 3},
    {"english": "The physician recommended endoscopic retrograde cholangiopancreatography.", "spanish": "El médico recomendó colangiopancreatografía retrógrada endoscópica.", "level": 3},
    {"english": "He developed disseminated intravascular coagulation secondary to sepsis.", "spanish": "Desarrolló coagulación intravascular diseminada secundaria a sepsis.", "level": 3},
    {"english": "The patient underwent stereotactic radiosurgery for a brain metastasis.", "spanish": "El paciente se sometió a radiocirugía estereotáctica por una metástasis cerebral.", "level": 3},
    {"english": "She is being treated with monoclonal antibodies for Crohn's disease.", "spanish": "Está siendo tratada con anticuerpos monoclonales por enfermedad de Crohn.", "level": 3},
    {"english": "The cardiologist performed a transcatheter aortic valve replacement.", "spanish": "El cardiólogo realizó un reemplazo valvular aórtico por catéter.", "level": 3},
    {"english": "He exhibits signs of multi-organ failure in the ICU.", "spanish": "Presenta signos de insuficiencia multiorgánica en la UCI.", "level": 3},
    {"english": "The patient received chemoradiation therapy for esophageal carcinoma.", "spanish": "El paciente recibió quimiorradioterapia para carcinoma esofágico.", "level": 3},
    {"english": "She developed diabetic ketoacidosis requiring ICU admission.", "spanish": "Desarrolló cetoacidosis diabética que requirió ingreso en UCI.", "level": 3},
    {"english": "The physician recommended lumbar decompression surgery for spinal stenosis.", "spanish": "El médico recomendó cirugía de descompresión lumbar por estenosis espinal.", "level": 3},
    {"english": "He is receiving intravenous vasopressors for hypotensive shock.", "spanish": "Está recibiendo vasopresores intravenosos por shock hipotensivo.", "level": 3},
    {"english": "The patient underwent percutaneous coronary intervention for STEMI.", "spanish": "El paciente se sometió a intervención coronaria percutánea por infarto con elevación del ST.", "level": 3},
    {"english": "She was diagnosed with pulmonary arterial hypertension based on catheterization.", "spanish": "Fue diagnosticada con hipertensión arterial pulmonar según cateterismo.", "level": 3},
    {"english": "The patient exhibits refractory seizures requiring anticonvulsant therapy.", "spanish": "El paciente presenta convulsiones refractarias que requieren terapia anticonvulsiva.", "level": 3},
    {"english": "He underwent hepatic resection for hepatocellular carcinoma.", "spanish": "Se sometió a resección hepática por carcinoma hepatocelular.", "level": 3},
    {"english": "The physician recommended prophylactic anticoagulation post-surgery.", "spanish": "El médico recomendó anticoagulación profiláctica post-cirugía.", "level": 3},
    {"english": "She developed acute respiratory failure requiring mechanical ventilation.", "spanish": "Desarrolló insuficiencia respiratoria aguda que requirió ventilación mecánica.", "level": 3},
    {"english": "The patient is receiving continuous renal replacement therapy for sepsis-induced AKI.", "spanish": "El paciente está recibiendo terapia de reemplazo renal continuo por IRA inducida por sepsis.", "level": 3},
    {"english": "He was treated with high-dose corticosteroids for acute lupus nephritis.", "spanish": "Fue tratado con corticosteroides en dosis altas por nefritis lúpica aguda.", "level": 3},
    {"english": "The cardiologist performed an electrophysiology study to assess arrhythmia.", "spanish": "El cardiólogo realizó un estudio de electrofisiología para evaluar arritmia.", "level": 3},
    {"english": "She underwent a bone marrow aspiration to evaluate hematologic malignancy.", "spanish": "Se sometió a aspiración de médula ósea para evaluar malignidad hematológica.", "level": 3},
    {"english": "The patient exhibits signs of hyperthyroidism with tachycardia and tremors.", "spanish": "El paciente presenta signos de hipertiroidismo con taquicardia y temblores.", "level": 3},
    {"english": "He is being treated with biologic therapy for severe psoriasis.", "spanish": "Está siendo tratado con terapia biológica por psoriasis severa.", "level": 3},
    {"english": "The physician recommended surgical resection of the pancreatic tumor.", "spanish": "El médico recomendó resección quirúrgica del tumor pancreático.", "level": 3}
  ],
  "programming": [
    {"english": "I am learning Python.", "spanish": "Estoy aprendiendo Python.", "level": 1},
    {"english": "The computer is running slowly.", "spanish": "La computadora está funcionando lentamente.", "level": 1},
    {"english": "He wrote his first program.", "spanish": "Escribió su primer programa.", "level": 1},
    {"english": "The variable stores data.", "spanish": "La variable almacena datos.", "level": 1},
    {"english": "She is debugging the code.", "spanish": "Ella está depurando el código.", "level": 1},
    {"english": "I installed a new text editor.", "spanish": "Instalé un nuevo editor de texto.", "level": 1},
    {"english": "The program has an error.", "spanish": "El programa tiene un error.", "level": 1},
    {"english": "He saved the file.", "spanish": "Guardó el archivo.", "level": 1},
    {"english": "The function returns a value.", "spanish": "La función devuelve un valor.", "level": 1},
    {"english": "I am learning how to write loops.", "spanish": "Estoy aprendiendo a escribir bucles.", "level": 1},
    {"english": "She opened the project.", "spanish": "Ella abrió el proyecto.", "level": 1},
    {"english": "The code is easy to read.", "spanish": "El código es fácil de leer.", "level": 1},
    {"english": "He is practicing programming every day.", "spanish": "Él practica programación todos los días.", "level": 1},
    {"english": "The program needs more comments.", "spanish": "El programa necesita más comentarios.", "level": 1},
    {"english": "I like learning new programming languages.", "spanish": "Me gusta aprender nuevos lenguajes de programación.", "level": 1},
    {"english": "The computer executed the command.", "spanish": "La computadora ejecutó el comando.", "level": 1},
    {"english": "She is learning how to use variables.", "spanish": "Ella está aprendiendo a usar variables.", "level": 1},
    {"english": "The program printed the result.", "spanish": "El programa imprimió el resultado.", "level": 1},
    {"english": "He deleted the wrong file.", "spanish": "Eliminó el archivo incorrecto.", "level": 1},
    {"english": "I am learning how to write functions.", "spanish": "Estoy aprendiendo a escribir funciones.", "level": 1},
    {"english": "The computer stores information.", "spanish": "La computadora almacena información.", "level": 1},
    {"english": "She is fixing the bug.", "spanish": "Ella está arreglando el error.", "level": 1},
    {"english": "The program uses a loop.", "spanish": "El programa usa un bucle.", "level": 1},
    {"english": "He is reading a programming book.", "spanish": "Él está leyendo un libro de programación.", "level": 1},
    {"english": "I opened the file in the editor.", "spanish": "Abrí el archivo en el editor.", "level": 1},
    {"english": "The computer processed the data.", "spanish": "La computadora procesó los datos.", "level": 1},
    {"english": "She is learning to code in JavaScript.", "spanish": "Ella está aprendiendo a programar en JavaScript.", "level": 1},
    {"english": "The variable name is too long.", "spanish": "El nombre de la variable es demasiado largo.", "level": 1},
    {"english": "He wrote a small program.", "spanish": "Escribió un programa pequeño.", "level": 1},
    {"english": "I am practicing writing code.", "spanish": "Estoy practicando escribir código.", "level": 1},
    {"english": "The program needs to run faster.", "spanish": "El programa necesita ejecutarse más rápido.", "level": 1},
    {"english": "She saved the changes.", "spanish": "Ella guardó los cambios.", "level": 1},
    {"english": "The code has many errors.", "spanish": "El código tiene muchos errores.", "level": 1},
    {"english": "He is learning about loops.", "spanish": "Él está aprendiendo sobre bucles.", "level": 1},
    {"english": "I installed Python on my computer.", "spanish": "Instalé Python en mi computadora.", "level": 1},
    {"english": "The program crashed.", "spanish": "El programa se bloqueó.", "level": 1},
    {"english": "She is writing her first function.", "spanish": "Ella está escribiendo su primera función.", "level": 1},
    {"english": "The computer is very fast.", "spanish": "La computadora es muy rápida.", "level": 1},
    {"english": "He fixed the code.", "spanish": "Él arregló el código.", "level": 1},
    {"english": "I am learning how to use lists.", "spanish": "Estoy aprendiendo a usar listas.", "level": 1},
    {"english": "The function prints a message.", "spanish": "La función imprime un mensaje.", "level": 1},
    {"english": "She opened the project folder.", "spanish": "Ella abrió la carpeta del proyecto.", "level": 1},
    {"english": "The code is simple.", "spanish": "El código es simple.", "level": 1},
    {"english": "He is practicing debugging.", "spanish": "Él está practicando depuración.", "level": 1},
    {"english": "I wrote a program yesterday.", "spanish": "Escribí un programa ayer.", "level": 1},
    {"english": "The computer executed the program.", "spanish": "La computadora ejecutó el programa.", "level": 1},
    {"english": "She is learning programming step by step.", "spanish": "Ella está aprendiendo programación paso a paso.", "level": 1},
    {"english": "The variable stores a number.", "spanish": "La variable almacena un número.", "level": 1},
    {"english": "He deleted the file by mistake.", "spanish": "Eliminó el archivo por error.", "level": 1},
    {"english": "I am learning basic programming concepts.", "spanish": "Estoy aprendiendo conceptos básicos de programación.", "level": 1},
    {"english": "The program printed the correct result.", "spanish": "El programa imprimió el resultado correcto.", "level": 1},
    {"english": "She opened the code editor.", "spanish": "Ella abrió el editor de código.", "level": 1},
    {"english": "The function returns a number.", "spanish": "La función devuelve un número.", "level": 1},
    {"english": "He is learning about variables.", "spanish": "Él está aprendiendo sobre variables.", "level": 1},
    {"english": "I saved the file.", "spanish": "Guardé el archivo.", "level": 1},
    {"english": "The computer processed the program.", "spanish": "La computadora procesó el programa.", "level": 1},
    {"english": "She is practicing writing loops.", "spanish": "Ella está practicando escribir bucles.", "level": 1},
    {"english": "The program has a bug.", "spanish": "El programa tiene un error.", "level": 1},
    {"english": "He wrote a function.", "spanish": "Él escribió una función.", "level": 1},
    {"english": "I am learning to code.", "spanish": "Estoy aprendiendo a programar.", "level": 1},
    {"english": "The variable stores text.", "spanish": "La variable almacena texto.", "level": 1},
    {"english": "She fixed the bug.", "spanish": "Ella arregló el error.", "level": 1},
    {"english": "The code is working.", "spanish": "El código está funcionando.", "level": 1},
    {"english": "He is learning Python basics.", "spanish": "Él está aprendiendo los conceptos básicos de Python.", "level": 1},
    {"english": "I opened the project in the editor.", "spanish": "Abrí el proyecto en el editor.", "level": 1},
    {"english": "The program printed a message.", "spanish": "El programa imprimió un mensaje.", "level": 1},
    {"english": "She is learning how to write code.", "spanish": "Ella está aprendiendo a escribir código.", "level": 1},
    {"english": "The computer stores files.", "spanish": "La computadora almacena archivos.", "level": 1},
    {"english": "He is practicing programming every day.", "spanish": "Él practica programación todos los días.", "level": 1},
    {"english": "I saved the changes.", "spanish": "Guardé los cambios.", "level": 1},
    {"english": "The code is correct.", "spanish": "El código es correcto.", "level": 1},
    {"english": "She is debugging her program.", "spanish": "Ella está depurando su programa.", "level": 1},
    {"english": "The program runs without errors.", "spanish": "El programa se ejecuta sin errores.", "level": 1},
    {"english": "He wrote a simple program.", "spanish": "Escribió un programa simple.", "level": 1},
    {"english": "I am learning about functions.", "spanish": "Estoy aprendiendo sobre funciones.", "level": 1},
    {"english": "The computer executed the command.", "spanish": "La computadora ejecutó el comando.", "level": 1},
    {"english": "She opened a new file.", "spanish": "Ella abrió un archivo nuevo.", "level": 1},
    {"english": "The variable contains a value.", "spanish": "La variable contiene un valor.", "level": 1},
    {"english": "He is learning basic coding skills.", "spanish": "Él está aprendiendo habilidades básicas de programación.", "level": 1},
    {"english": "I wrote a program using Python.", "spanish": "Escribí un programa usando Python.", "level": 1},
    {"english": "The program needs more testing.", "spanish": "El programa necesita más pruebas.", "level": 1},
    {"english": "She is learning how to use loops.", "spanish": "Ella está aprendiendo a usar bucles.", "level": 1},
    {"english": "The code prints the result.", "spanish": "El código imprime el resultado.", "level": 1},
    {"english": "He saved the project.", "spanish": "Él guardó el proyecto.", "level": 1},
    {"english": "I am practicing coding every day.", "spanish": "Estoy practicando programación todos los días.", "level": 1},
    {"english": "The program executed successfully.", "spanish": "El programa se ejecutó correctamente.", "level": 1},
    {"english": "She is learning to write simple programs.", "spanish": "Ella está aprendiendo a escribir programas simples.", "level": 1},
    {"english": "The computer is running the program.", "spanish": "La computadora está ejecutando el programa.", "level": 1},
    {"english": "He is learning programming fundamentals.", "spanish": "Él está aprendiendo los fundamentos de la programación.", "level": 1},
    {"english": "I opened the code file.", "spanish": "Abrí el archivo de código.", "level": 1},
    {"english": "The function returns a string.", "spanish": "La función devuelve una cadena.", "level": 1},
    {"english": "She fixed the code error.", "spanish": "Ella arregló el error del código.", "level": 1},
    {"english": "The program printed the output.", "spanish": "El programa imprimió la salida.", "level": 1},
    {"english": "He is learning Python syntax.", "spanish": "Él está aprendiendo la sintaxis de Python.", "level": 1},

    {"english": "The loop iterates over the list.", "spanish": "El bucle itera sobre la lista.", "level": 2},
    {"english": "We use an if statement to check a condition.", "spanish": "Usamos una instrucción if para comprobar una condición.", "level": 2},
    {"english": "The function takes two arguments.", "spanish": "La función recibe dos argumentos.", "level": 2},
    {"english": "He initialized the dictionary with default values.", "spanish": "Inicializó el diccionario con valores predeterminados.", "level": 2},
    {"english": "We need to handle exceptions properly.", "spanish": "Necesitamos manejar las excepciones correctamente.", "level": 2},
    {"english": "The code block executes only if the condition is true.", "spanish": "El bloque de código se ejecuta solo si la condición es verdadera.", "level": 2},
    {"english": "She is learning about nested loops.", "spanish": "Ella está aprendiendo sobre bucles anidados.", "level": 2},
    {"english": "The function returns a boolean value.", "spanish": "La función devuelve un valor booleano.", "level": 2},
    {"english": "He is debugging a runtime error.", "spanish": "Él está depurando un error en tiempo de ejecución.", "level": 2},
    {"english": "We can use list comprehension to simplify the code.", "spanish": "Podemos usar comprensión de listas para simplificar el código.", "level": 2},
    {"english": "The program reads data from a file.", "spanish": "El programa lee datos de un archivo.", "level": 2},
    {"english": "She wrote a recursive function.", "spanish": "Ella escribió una función recursiva.", "level": 2},
    {"english": "The variable is global and can be accessed anywhere.", "spanish": "La variable es global y puede ser accedida desde cualquier lugar.", "level": 2},
    {"english": "He is testing the algorithm for efficiency.", "spanish": "Él está probando el algoritmo para ver su eficiencia.", "level": 2},
    {"english": "We need to import the required modules.", "spanish": "Necesitamos importar los módulos requeridos.", "level": 2},
    {"english": "The function raises an exception if the input is invalid.", "spanish": "La función lanza una excepción si la entrada es inválida.", "level": 2},
    {"english": "She is learning about classes and objects.", "spanish": "Ella está aprendiendo sobre clases y objetos.", "level": 2},
    {"english": "The code uses a while loop to repeat the task.", "spanish": "El código usa un bucle while para repetir la tarea.", "level": 2},
    {"english": "He defined a method inside the class.", "spanish": "Definió un método dentro de la clase.", "level": 2},
    {"english": "We need to close the file after reading.", "spanish": "Necesitamos cerrar el archivo después de leerlo.", "level": 2},
    {"english": "The function parameters have default values.", "spanish": "Los parámetros de la función tienen valores predeterminados.", "level": 2},
    {"english": "She is iterating over a dictionary.", "spanish": "Ella está iterando sobre un diccionario.", "level": 2},
    {"english": "The algorithm sorts the list in ascending order.", "spanish": "El algoritmo ordena la lista en orden ascendente.", "level": 2},
    {"english": "We use a try-except block to catch errors.", "spanish": "Usamos un bloque try-except para capturar errores.", "level": 2},
    {"english": "He is learning about function decorators.", "spanish": "Él está aprendiendo sobre decoradores de funciones.", "level": 2},
    {"english": "The code defines a class for the object.", "spanish": "El código define una clase para el objeto.", "level": 2},
    {"english": "She is testing the function with different inputs.", "spanish": "Ella está probando la función con diferentes entradas.", "level": 2},
    {"english": "We can use a for loop with range to repeat actions.", "spanish": "Podemos usar un bucle for con range para repetir acciones.", "level": 2},
    {"english": "The program stores data in a list.", "spanish": "El programa almacena datos en una lista.", "level": 2},
    {"english": "He is debugging the logic of the program.", "spanish": "Él está depurando la lógica del programa.", "level": 2},
    {"english": "The function returns multiple values.", "spanish": "La función devuelve múltiples valores.", "level": 2},
    {"english": "She is learning about inheritance in classes.", "spanish": "Ella está aprendiendo sobre herencia en clases.", "level": 2},
    {"english": "We need to import a library for this feature.", "spanish": "Necesitamos importar una biblioteca para esta función.", "level": 2},
    {"english": "The loop continues until the condition is false.", "spanish": "El bucle continúa hasta que la condición sea falsa.", "level": 2},
    {"english": "He is learning about data structures.", "spanish": "Él está aprendiendo sobre estructuras de datos.", "level": 2},
    {"english": "The program reads input from the user.", "spanish": "El programa lee la entrada del usuario.", "level": 2},
    {"english": "She is practicing writing functions with parameters.", "spanish": "Ella está practicando escribir funciones con parámetros.", "level": 2},
    {"english": "The algorithm searches for a value in the list.", "spanish": "El algoritmo busca un valor en la lista.", "level": 2},
    {"english": "We use break to exit a loop early.", "spanish": "Usamos break para salir de un bucle anticipadamente.", "level": 2},
    {"english": "He is learning how to handle exceptions.", "spanish": "Él está aprendiendo a manejar excepciones.", "level": 2},
    {"english": "The class has several methods.", "spanish": "La clase tiene varios métodos.", "level": 2},
    {"english": "She defined an __init__ method for the class.", "spanish": "Ella definió un método __init__ para la clase.", "level": 2},
    {"english": "The program writes output to a file.", "spanish": "El programa escribe la salida en un archivo.", "level": 2},
    {"english": "We need to check if the key exists in the dictionary.", "spanish": "Necesitamos verificar si la clave existe en el diccionario.", "level": 2},
    {"english": "He is learning about modular programming.", "spanish": "Él está aprendiendo sobre programación modular.", "level": 2},
    {"english": "The loop increments the counter by one.", "spanish": "El bucle incrementa el contador en uno.", "level": 2},
    {"english": "She is learning about Python libraries.", "spanish": "Ella está aprendiendo sobre bibliotecas de Python.", "level": 2},
    {"english": "The function checks if the input is valid.", "spanish": "La función verifica si la entrada es válida.", "level": 2},
    {"english": "We can use recursion to solve this problem.", "spanish": "Podemos usar recursión para resolver este problema.", "level": 2},
    {"english": "He defined a class variable.", "spanish": "Definió una variable de clase.", "level": 2},
    {"english": "The code uses multiple functions.", "spanish": "El código usa múltiples funciones.", "level": 2},
    {"english": "She is learning about algorithm complexity.", "spanish": "Ella está aprendiendo sobre la complejidad de los algoritmos.", "level": 2},
    {"english": "The program loops through each item in the list.", "spanish": "El programa recorre cada elemento de la lista.", "level": 2},
    {"english": "We need to import JSON module to handle data.", "spanish": "Necesitamos importar el módulo JSON para manejar datos.", "level": 2},
    {"english": "He is learning how to use sets.", "spanish": "Él está aprendiendo a usar conjuntos.", "level": 2},
    {"english": "The function calculates the sum of two numbers.", "spanish": "La función calcula la suma de dos números.", "level": 2},
    {"english": "She is writing a program with multiple functions.", "spanish": "Ella está escribiendo un programa con múltiples funciones.", "level": 2},
    {"english": "The loop skips even numbers using continue.", "spanish": "El bucle omite los números pares usando continue.", "level": 2},
    {"english": "We use a dictionary to store key-value pairs.", "spanish": "Usamos un diccionario para almacenar pares clave-valor.", "level": 2},
    {"english": "He is learning about Python modules.", "spanish": "Él está aprendiendo sobre módulos de Python.", "level": 2},
    {"english": "The program sorts a list of numbers.", "spanish": "El programa ordena una lista de números.", "level": 2},
    {"english": "She is practicing writing class methods.", "spanish": "Ella está practicando escribir métodos de clase.", "level": 2},
    {"english": "The function modifies the list in place.", "spanish": "La función modifica la lista en su lugar.", "level": 2},
    {"english": "We need to test the function with edge cases.", "spanish": "Necesitamos probar la función con casos límite.", "level": 2},
    {"english": "He is learning about mutable and immutable types.", "spanish": "Él está aprendiendo sobre tipos mutables e inmutables.", "level": 2},
    {"english": "The program reads data line by line.", "spanish": "El programa lee los datos línea por línea.", "level": 2},
    {"english": "She is debugging a logic error.", "spanish": "Ella está depurando un error lógico.", "level": 2},
    {"english": "The class inherits from a parent class.", "spanish": "La clase hereda de una clase padre.", "level": 2},
    {"english": "We can use a generator to handle large datasets.", "spanish": "Podemos usar un generador para manejar grandes conjuntos de datos.", "level": 2},
    {"english": "He is learning about Python data types.", "spanish": "Él está aprendiendo sobre tipos de datos en Python.", "level": 2},
    {"english": "The function returns a list of results.", "spanish": "La función devuelve una lista de resultados.", "level": 2},
    {"english": "She wrote a function to calculate the factorial.", "spanish": "Ella escribió una función para calcular el factorial.", "level": 2},
    {"english": "The loop continues while the condition is true.", "spanish": "El bucle continúa mientras la condición sea verdadera.", "level": 2},
    {"english": "We need to handle errors gracefully.", "spanish": "Necesitamos manejar los errores de manera elegante.", "level": 2},
    {"english": "He is learning about Python string methods.", "spanish": "Él está aprendiendo sobre métodos de cadenas en Python.", "level": 2},
    {"english": "The program checks if a number is even or odd.", "spanish": "El programa verifica si un número es par o impar.", "level": 2},
    {"english": "She is practicing using nested functions.", "spanish": "Ella está practicando usar funciones anidadas.", "level": 2},
    {"english": "The function accepts keyword arguments.", "spanish": "La función acepta argumentos con nombre.", "level": 2},
    {"english": "We can use lambda functions for simple tasks.", "spanish": "Podemos usar funciones lambda para tareas simples.", "level": 2},
    {"english": "He is learning about list slicing.", "spanish": "Él está aprendiendo sobre segmentación de listas.", "level": 2},
    {"english": "The program prints the output in a formatted way.", "spanish": "El programa imprime la salida de manera formateada.", "level": 2},
    {"english": "She is writing a class with attributes.", "spanish": "Ella está escribiendo una clase con atributos.", "level": 2},
    {"english": "The function converts a string to an integer.", "spanish": "La función convierte una cadena a un entero.", "level": 2},
    {"english": "We need to optimize the algorithm for speed.", "spanish": "Necesitamos optimizar el algoritmo para velocidad.", "level": 2},
    {"english": "He is learning about Python sets.", "spanish": "Él está aprendiendo sobre conjuntos en Python.", "level": 2},
    {"english": "The program iterates through each key in the dictionary.", "spanish": "El programa itera por cada clave del diccionario.", "level": 2},
    {"english": "She is learning how to use Python's built-in functions.", "spanish": "Ella está aprendiendo a usar las funciones integradas de Python.", "level": 2},
    {"english": "The function calculates the average of numbers.", "spanish": "La función calcula el promedio de los números.", "level": 2},
    {"english": "We can use recursion to solve complex problems.", "spanish": "Podemos usar recursión para resolver problemas complejos.", "level": 2},
    {"english": "He is debugging a syntax error.", "spanish": "Él está depurando un error de sintaxis.", "level": 2},
    {"english": "The class encapsulates data and methods.", "spanish": "La clase encapsula datos y métodos.", "level": 2},
    {"english": "She is learning about Python loops.", "spanish": "Ella está aprendiendo sobre bucles en Python.", "level": 2},
    {"english": "The program raises an exception if input is invalid.", "spanish": "El programa lanza una excepción si la entrada es inválida.", "level": 2},
    {"english": "We need to test all edge cases.", "spanish": "Necesitamos probar todos los casos límite.", "level": 2},
    {"english": "He is practicing writing efficient algorithms.", "spanish": "Él está practicando escribir algoritmos eficientes.", "level": 2},
    {"english": "The function returns a tuple of values.", "spanish": "La función devuelve una tupla de valores.", "level": 2},
    {"english": "She is learning about Python dictionaries.", "spanish": "Ella está aprendiendo sobre diccionarios en Python.", "level": 2},
    {"english": "The program reads a CSV file.", "spanish": "El programa lee un archivo CSV.", "level": 2},
    {"english": "We can use map and filter to process lists.", "spanish": "Podemos usar map y filter para procesar listas.", "level": 2},
    {"english": "He is learning about Python exceptions.", "spanish": "Él está aprendiendo sobre excepciones en Python.", "level": 2},
    {"english": "The loop stops when the condition is false.", "spanish": "El bucle se detiene cuando la condición es falsa.", "level": 2},
    {"english": "She is writing a program with classes and objects.", "spanish": "Ella está escribiendo un programa con clases y objetos.", "level": 2},
    {"english": "The function splits a string into words.", "spanish": "La función divide una cadena en palabras.", "level": 2},
    {"english": "We need to close all opened files.", "spanish": "Necesitamos cerrar todos los archivos abiertos.", "level": 2},
    {"english": "He is learning about Python modules and packages.", "spanish": "Él está aprendiendo sobre módulos y paquetes en Python.", "level": 2},
    {"english": "The program concatenates two strings.", "spanish": "El programa concatena dos cadenas.", "level": 2},
    {"english": "She is debugging a complex function.", "spanish": "Ella está depurando una función compleja.", "level": 2},
    {"english": "The function uses a for loop to iterate.", "spanish": "La función usa un bucle for para iterar.", "level": 2},
    {"english": "We can use Python's built-in methods for strings.", "spanish": "Podemos usar los métodos integrados de Python para cadenas.", "level": 2},

    {"english": "The recursive function calls itself with a reduced parameter.", "spanish": "La función recursiva se llama a sí misma con un parámetro reducido.", "level": 3},
    {"english": "He is implementing a binary search algorithm.", "spanish": "Él está implementando un algoritmo de búsqueda binaria.", "level": 3},
    {"english": "The class uses inheritance to extend functionality.", "spanish": "La clase usa herencia para extender la funcionalidad.", "level": 3},
    {"english": "We need to handle exceptions for multiple error types.", "spanish": "Necesitamos manejar excepciones para múltiples tipos de error.", "level": 3},
    {"english": "She is optimizing the function to reduce time complexity.", "spanish": "Ella está optimizando la función para reducir la complejidad temporal.", "level": 3},
    {"english": "The program uses a generator to efficiently handle large datasets.", "spanish": "El programa usa un generador para manejar grandes conjuntos de datos de manera eficiente.", "level": 3},
    {"english": "He defined a metaclass to customize class creation.", "spanish": "Definió una metaclase para personalizar la creación de clases.", "level": 3},
    {"english": "We implement polymorphism to allow multiple object behaviors.", "spanish": "Implementamos polimorfismo para permitir múltiples comportamientos de objetos.", "level": 3},
    {"english": "The decorator modifies the behavior of the original function.", "spanish": "El decorador modifica el comportamiento de la función original.", "level": 3},
    {"english": "She is handling asynchronous calls using asyncio.", "spanish": "Ella está manejando llamadas asincrónicas usando asyncio.", "level": 3},
    {"english": "The program serializes objects using the pickle module.", "spanish": "El programa serializa objetos usando el módulo pickle.", "level": 3},
    {"english": "He is designing a class hierarchy with multiple levels of inheritance.", "spanish": "Él está diseñando una jerarquía de clases con múltiples niveles de herencia.", "level": 3},
    {"english": "We use context managers to handle resources safely.", "spanish": "Usamos gestores de contexto para manejar recursos de manera segura.", "level": 3},
    {"english": "The function implements memoization to improve efficiency.", "spanish": "La función implementa memoización para mejorar la eficiencia.", "level": 3},
    {"english": "She is debugging a multi-threaded program.", "spanish": "Ella está depurando un programa multihilo.", "level": 3},
    {"english": "The program uses list comprehension with conditional statements.", "spanish": "El programa usa comprensión de listas con instrucciones condicionales.", "level": 3},
    {"english": "He is learning about abstract base classes.", "spanish": "Él está aprendiendo sobre clases base abstractas.", "level": 3},
    {"english": "The function raises a custom exception for invalid input.", "spanish": "La función lanza una excepción personalizada para entradas inválidas.", "level": 3},
    {"english": "We use a priority queue to manage tasks by importance.", "spanish": "Usamos una cola de prioridad para gestionar tareas por importancia.", "level": 3},
    {"english": "She is applying decorators with parameters.", "spanish": "Ella está aplicando decoradores con parámetros.", "level": 3},
    {"english": "The algorithm implements quicksort for efficient sorting.", "spanish": "El algoritmo implementa quicksort para ordenar de manera eficiente.", "level": 3},
    {"english": "He is analyzing the time complexity of recursive functions.", "spanish": "Él está analizando la complejidad temporal de funciones recursivas.", "level": 3},
    {"english": "The program handles multiple client connections using sockets.", "spanish": "El programa maneja múltiples conexiones de clientes usando sockets.", "level": 3},
    {"english": "She is designing a module with encapsulated helper functions.", "spanish": "Ella está diseñando un módulo con funciones auxiliares encapsuladas.", "level": 3},
    {"english": "The class overrides a method from its parent class.", "spanish": "La clase sobrescribe un método de su clase padre.", "level": 3},
    {"english": "He is using functools.reduce to aggregate list values.", "spanish": "Él está usando functools.reduce para agregar valores de una lista.", "level": 3},
    {"english": "We can use asynchronous generators to yield data efficiently.", "spanish": "Podemos usar generadores asincrónicos para devolver datos de manera eficiente.", "level": 3},
    {"english": "The program implements a singleton pattern.", "spanish": "El programa implementa un patrón singleton.", "level": 3},
    {"english": "She is learning about Python's descriptor protocol.", "spanish": "Ella está aprendiendo sobre el protocolo de descriptores de Python.", "level": 3},
    {"english": "The function uses type hints for better code clarity.", "spanish": "La función usa anotaciones de tipos para mayor claridad del código.", "level": 3},
    {"english": "He is implementing a graph traversal algorithm.", "spanish": "Él está implementando un algoritmo de recorrido de grafos.", "level": 3},
    {"english": "The class uses composition to reuse functionality.", "spanish": "La clase usa composición para reutilizar funcionalidad.", "level": 3},
    {"english": "She is debugging a coroutine that yields results.", "spanish": "Ella está depurando una corrutina que devuelve resultados.", "level": 3},
    {"english": "The program applies functional programming techniques.", "spanish": "El programa aplica técnicas de programación funcional.", "level": 3},
    {"english": "He is learning about Python's GIL and thread safety.", "spanish": "Él está aprendiendo sobre el GIL de Python y la seguridad de hilos.", "level": 3},
    {"english": "We use a hash map to achieve O(1) lookup time.", "spanish": "Usamos un mapa hash para lograr un tiempo de búsqueda O(1).", "level": 3},
    {"english": "The function decorates another function dynamically.", "spanish": "La función decora otra función dinámicamente.", "level": 3},
    {"english": "She is writing unit tests for edge cases.", "spanish": "Ella está escribiendo pruebas unitarias para casos límite.", "level": 3},
    {"english": "The program uses a recursive depth-first search algorithm.", "spanish": "El programa usa un algoritmo de búsqueda en profundidad recursiva.", "level": 3},
    {"english": "He is learning about generators and iterators.", "spanish": "Él está aprendiendo sobre generadores e iteradores.", "level": 3},
    {"english": "The class implements multiple interfaces.", "spanish": "La clase implementa múltiples interfaces.", "level": 3},
    {"english": "She is handling asynchronous exceptions using try-except.", "spanish": "Ella está manejando excepciones asincrónicas usando try-except.", "level": 3},
    {"english": "The function leverages Python's built-in itertools module.", "spanish": "La función aprovecha el módulo itertools integrado de Python.", "level": 3},
    {"english": "We can implement caching to improve performance.", "spanish": "Podemos implementar caché para mejorar el rendimiento.", "level": 3},
    {"english": "He is learning about Python's memory management.", "spanish": "Él está aprendiendo sobre la gestión de memoria en Python.", "level": 3},
    {"english": "The program uses a linked list for dynamic data storage.", "spanish": "El programa usa una lista enlazada para almacenamiento dinámico de datos.", "level": 3},
    {"english": "She is applying the observer pattern for event handling.", "spanish": "Ella está aplicando el patrón observador para manejo de eventos.", "level": 3},
    {"english": "The function uses recursion with memoization.", "spanish": "La función usa recursión con memoización.", "level": 3},
    {"english": "He is designing a multi-layered class structure.", "spanish": "Él está diseñando una estructura de clases de múltiples capas.", "level": 3},
    {"english": "We use asyncio.gather to run multiple coroutines concurrently.", "spanish": "Usamos asyncio.gather para ejecutar múltiples corrutinas concurrentemente.", "level": 3},
    {"english": "The class implements __str__ and __repr__ methods.", "spanish": "La clase implementa los métodos __str__ y __repr__.", "level": 3},
    {"english": "She is learning about Python's iterator protocol.", "spanish": "Ella está aprendiendo sobre el protocolo de iteradores de Python.", "level": 3},
    {"english": "The program dynamically loads modules at runtime.", "spanish": "El programa carga módulos dinámicamente en tiempo de ejecución.", "level": 3},
    {"english": "He is implementing a custom context manager.", "spanish": "Él está implementando un gestor de contexto personalizado.", "level": 3},
    {"english": "The function handles concurrent requests efficiently.", "spanish": "La función maneja solicitudes concurrentes de manera eficiente.", "level": 3},
    {"english": "She is applying dependency injection to decouple components.", "spanish": "Ella está aplicando inyección de dependencias para desacoplar componentes.", "level": 3},
    {"english": "The algorithm uses dynamic programming to solve subproblems.", "spanish": "El algoritmo usa programación dinámica para resolver subproblemas.", "level": 3},
    {"english": "He is learning about Python's descriptor and property system.", "spanish": "Él está aprendiendo sobre el sistema de descriptores y propiedades de Python.", "level": 3},
    {"english": "The class uses multiple inheritance carefully.", "spanish": "La clase usa herencia múltiple cuidadosamente.", "level": 3},
    {"english": "She is debugging race conditions in a multithreaded program.", "spanish": "Ella está depurando condiciones de carrera en un programa multihilo.", "level": 3},
    {"english": "The program implements a producer-consumer pattern.", "spanish": "El programa implementa un patrón productor-consumidor.", "level": 3},
    {"english": "He is learning how to profile Python code for performance.", "spanish": "Él está aprendiendo a perfilar código Python para rendimiento.", "level": 3},
    {"english": "The function handles nested data structures recursively.", "spanish": "La función maneja estructuras de datos anidadas recursivamente.", "level": 3},
    {"english": "She is applying asynchronous context managers.", "spanish": "Ella está aplicando gestores de contexto asincrónicos.", "level": 3},
    {"english": "The class defines class-level and instance-level attributes.", "spanish": "La clase define atributos a nivel de clase y a nivel de instancia.", "level": 3},
    {"english": "We use Python's functools.lru_cache to cache function results.", "spanish": "Usamos functools.lru_cache de Python para cachear resultados de funciones.", "level": 3},
    {"english": "He is designing an event-driven architecture.", "spanish": "Él está diseñando una arquitectura orientada a eventos.", "level": 3},
    {"english": "The program uses type annotations for complex data structures.", "spanish": "El programa usa anotaciones de tipo para estructuras de datos complejas.", "level": 3},
    {"english": "She is learning about Python's async iterators.", "spanish": "Ella está aprendiendo sobre iteradores asincrónicos de Python.", "level": 3},
    {"english": "The function dynamically dispatches based on input type.", "spanish": "La función hace despacho dinámico según el tipo de entrada.", "level": 3},
    {"english": "He is implementing a balanced binary search tree.", "spanish": "Él está implementando un árbol de búsqueda binario equilibrado.", "level": 3},
    {"english": "The class uses composition over inheritance for flexibility.", "spanish": "La clase usa composición sobre herencia para mayor flexibilidad.", "level": 3},
    {"english": "She is debugging deadlocks in a concurrent program.", "spanish": "Ella está depurando bloqueos en un programa concurrente.", "level": 3},
    {"english": "The function applies higher-order functions.", "spanish": "La función aplica funciones de orden superior.", "level": 3},
    {"english": "He is learning about Python's garbage collection mechanism.", "spanish": "Él está aprendiendo sobre el mecanismo de recolección de basura de Python.", "level": 3},
    {"english": "The program implements a task scheduler using asyncio.", "spanish": "El programa implementa un planificador de tareas usando asyncio.", "level": 3},
    {"english": "She is writing a DSL (Domain Specific Language) parser.", "spanish": "Ella está escribiendo un parser para un DSL (Lenguaje Específico de Dominio).", "level": 3},
    {"english": "The class overrides __eq__ and __hash__ for proper comparison.", "spanish": "La clase sobrescribe __eq__ y __hash__ para comparaciones correctas.", "level": 3},
    {"english": "He is learning about Python's data model and magic methods.", "spanish": "Él está aprendiendo sobre el modelo de datos de Python y los métodos mágicos.", "level": 3},
    {"english": "The function is optimized using vectorized operations.", "spanish": "La función está optimizada usando operaciones vectorizadas.", "level": 3},
    {"english": "She is handling multiple asynchronous streams concurrently.", "spanish": "Ella está manejando múltiples flujos asincrónicos de manera concurrente.", "level": 3},
    {"english": "The program dynamically generates classes at runtime.", "spanish": "El programa genera clases dinámicamente en tiempo de ejecución.", "level": 3},
    {"english": "He is implementing a cache with eviction policies.", "spanish": "Él está implementando un caché con políticas de expulsión.", "level": 3},
    {"english": "The function uses advanced list slicing techniques.", "spanish": "La función usa técnicas avanzadas de segmentación de listas.", "level": 3},
    {"english": "She is designing a modular package with submodules.", "spanish": "Ella está diseñando un paquete modular con submódulos.", "level": 3},
    {"english": "The program handles exceptions across multiple layers.", "spanish": "El programa maneja excepciones a través de múltiples capas.", "level": 3},
    {"english": "He is learning about coroutines and event loops.", "spanish": "Él está aprendiendo sobre corrutinas y bucles de eventos.", "level": 3},
    {"english": "The class implements data encapsulation and abstraction.", "spanish": "La clase implementa encapsulación de datos y abstracción.", "level": 3},
    {"english": "She is applying functional composition to simplify code.", "spanish": "Ella está aplicando composición funcional para simplificar el código.", "level": 3},
    {"english": "The program uses a deque for efficient insertions and deletions.", "spanish": "El programa usa un deque para inserciones y eliminaciones eficientes.", "level": 3}
  ],
  "cars": [
    {"english": "The car engine starts with a key.", "spanish": "El motor del coche arranca con una llave.", "level": 1},
    {"english": "He checks the tire pressure every week.", "spanish": "Él revisa la presión de los neumáticos cada semana.", "level": 1},
    {"english": "The brake pads need to be replaced.", "spanish": "Las pastillas de freno necesitan ser reemplazadas.", "level": 1},
    {"english": "She fills the fuel tank with gasoline.", "spanish": "Ella llena el tanque de combustible con gasolina.", "level": 1},
    {"english": "The headlights turn on automatically.", "spanish": "Los faros se encienden automáticamente.", "level": 1},
    {"english": "He opens the car door with the remote control.", "spanish": "Él abre la puerta del coche con el control remoto.", "level": 1},
    {"english": "The windshield wipers remove rain from the glass.", "spanish": "Los limpiaparabrisas quitan la lluvia del vidrio.", "level": 1},
    {"english": "She adjusts the rearview mirror before driving.", "spanish": "Ella ajusta el espejo retrovisor antes de conducir.", "level": 1},
    {"english": "The battery provides power to start the engine.", "spanish": "La batería proporciona energía para arrancar el motor.", "level": 1},
    {"english": "He uses the seatbelt for safety.", "spanish": "Él usa el cinturón de seguridad para protegerse.", "level": 1},
    {"english": "The car has a manual transmission.", "spanish": "El coche tiene una transmisión manual.", "level": 1},
    {"english": "She checks the oil level regularly.", "spanish": "Ella revisa el nivel de aceite regularmente.", "level": 1},
    {"english": "The tires have a tread for better grip.", "spanish": "Los neumáticos tienen un dibujo para mejor agarre.", "level": 1},
    {"english": "He starts the car with a push-button ignition.", "spanish": "Él arranca el coche con un encendido por botón.", "level": 1},
    {"english": "The car horn warns other drivers.", "spanish": "La bocina del coche advierte a otros conductores.", "level": 1},
    {"english": "She fills the windshield washer reservoir.", "spanish": "Ella llena el depósito del limpiaparabrisas.", "level": 1},
    {"english": "The exhaust emits gases from the engine.", "spanish": "El escape emite gases del motor.", "level": 1},
    {"english": "He checks the brake fluid level.", "spanish": "Él revisa el nivel del líquido de frenos.", "level": 1},
    {"english": "The car has an air conditioning system.", "spanish": "El coche tiene un sistema de aire acondicionado.", "level": 1},
    {"english": "She opens the trunk to put luggage inside.", "spanish": "Ella abre el maletero para meter equipaje.", "level": 1},
    {"english": "The side mirrors help to see behind the car.", "spanish": "Los espejos laterales ayudan a ver detrás del coche.", "level": 1},
    {"english": "He checks the coolant level in the radiator.", "spanish": "Él revisa el nivel del refrigerante en el radiador.", "level": 1},
    {"english": "The car doors lock automatically when driving.", "spanish": "Las puertas del coche se bloquean automáticamente al conducir.", "level": 1},
    {"english": "She turns the steering wheel to change direction.", "spanish": "Ella gira el volante para cambiar de dirección.", "level": 1},
    {"english": "The engine makes a sound when it starts.", "spanish": "El motor hace un sonido al arrancar.", "level": 1},
    {"english": "He fills the tires with air using a pump.", "spanish": "Él llena los neumáticos de aire usando una bomba.", "level": 1},
    {"english": "The car has seat heating for winter.", "spanish": "El coche tiene calefacción en los asientos para el invierno.", "level": 1},
    {"english": "She uses the handbrake when parking on a hill.", "spanish": "Ella usa el freno de mano al estacionar en una colina.", "level": 1},
    {"english": "The car has a navigation system.", "spanish": "El coche tiene un sistema de navegación.", "level": 1},
    {"english": "He checks the engine temperature gauge.", "spanish": "Él revisa el indicador de temperatura del motor.", "level": 1},
    {"english": "The windshield is clean for clear vision.", "spanish": "El parabrisas está limpio para tener visión clara.", "level": 1},
    {"english": "She turns on the indicators before turning.", "spanish": "Ella enciende los intermitentes antes de girar.", "level": 1},
    {"english": "The car has a fuel-efficient engine.", "spanish": "El coche tiene un motor eficiente en combustible.", "level": 1},
    {"english": "He checks the tire rotation to prevent wear.", "spanish": "Él revisa la rotación de los neumáticos para evitar desgaste.", "level": 1},
    {"english": "The car dashboard shows speed and fuel level.", "spanish": "El tablero del coche muestra la velocidad y el nivel de combustible.", "level": 1},
    {"english": "She replaces the windshield wipers when worn.", "spanish": "Ella reemplaza los limpiaparabrisas cuando están desgastados.", "level": 1},
    {"english": "The headlights help to see at night.", "spanish": "Los faros ayudan a ver de noche.", "level": 1},
    {"english": "He opens the fuel cap to fill gasoline.", "spanish": "Él abre la tapa de combustible para llenar gasolina.", "level": 1},
    {"english": "The car uses spark plugs to ignite fuel.", "spanish": "El coche usa bujías para encender el combustible.", "level": 1},
    {"english": "She checks the car battery connections.", "spanish": "Ella revisa las conexiones de la batería del coche.", "level": 1},
    {"english": "The tires are inflated to the recommended pressure.", "spanish": "Los neumáticos están inflados a la presión recomendada.", "level": 1},
    {"english": "He adjusts the seat for comfortable driving.", "spanish": "Él ajusta el asiento para conducir cómodamente.", "level": 1},
    {"english": "The car has automatic braking for safety.", "spanish": "El coche tiene frenos automáticos para seguridad.", "level": 1},
    {"english": "She turns on the engine with a start button.", "spanish": "Ella enciende el motor con un botón de arranque.", "level": 1},
    {"english": "The rear lights signal when braking.", "spanish": "Las luces traseras indican al frenar.", "level": 1},
    {"english": "He uses a GPS to find the destination.", "spanish": "Él usa un GPS para encontrar el destino.", "level": 1},
    {"english": "The car interior is clean and organized.", "spanish": "El interior del coche está limpio y organizado.", "level": 1},
    {"english": "She checks the car oil for maintenance.", "spanish": "Ella revisa el aceite del coche para mantenimiento.", "level": 1},
    {"english": "The engine needs regular maintenance.", "spanish": "El motor necesita mantenimiento regular.", "level": 1},
    {"english": "He fills the windshield washer with water.", "spanish": "Él llena el depósito del limpiaparabrisas con agua.", "level": 1},
    {"english": "The car doors open with a handle.", "spanish": "Las puertas del coche se abren con una manija.", "level": 1},
    {"english": "She uses the parking brake when the car is stopped.", "spanish": "Ella usa el freno de estacionamiento cuando el coche está detenido.", "level": 1},
    {"english": "The car has airbags for driver and passengers.", "spanish": "El coche tiene airbags para conductor y pasajeros.", "level": 1},
    {"english": "He checks the dashboard warning lights.", "spanish": "Él revisa las luces de advertencia del tablero.", "level": 1},
    {"english": "The car uses a transmission to change gears.", "spanish": "El coche usa una transmisión para cambiar de marcha.", "level": 1},
    {"english": "She cleans the car windows for better vision.", "spanish": "Ella limpia las ventanas del coche para mejor visión.", "level": 1},
    {"english": "The tires provide traction on the road.", "spanish": "Los neumáticos proporcionan tracción en la carretera.", "level": 1},
    {"english": "He checks the brakes before a long drive.", "spanish": "Él revisa los frenos antes de un viaje largo.", "level": 1},
    {"english": "The car engine uses oil for lubrication.", "spanish": "El motor del coche usa aceite para lubricación.", "level": 1},
    {"english": "She opens the hood to check the engine.", "spanish": "Ella abre el capó para revisar el motor.", "level": 1},
    {"english": "The car has a fuel gauge to show the tank level.", "spanish": "El coche tiene un indicador de combustible para mostrar el nivel del tanque.", "level": 1},
    {"english": "He adjusts the mirrors for safe driving.", "spanish": "Él ajusta los espejos para conducir de forma segura.", "level": 1},
    {"english": "The car radio plays music.", "spanish": "La radio del coche reproduce música.", "level": 1},
    {"english": "She checks the tire tread depth.", "spanish": "Ella revisa la profundidad del dibujo de los neumáticos.", "level": 1},
    {"english": "The engine fan cools the motor.", "spanish": "El ventilador del motor enfría el motor.", "level": 1},
    {"english": "He uses the cruise control on the highway.", "spanish": "Él usa el control de crucero en la autopista.", "level": 1},
    {"english": "The car has automatic windows.", "spanish": "El coche tiene ventanas automáticas.", "level": 1},
    {"english": "She locks the car doors for security.", "spanish": "Ella bloquea las puertas del coche por seguridad.", "level": 1},
    {"english": "The tires need to be balanced.", "spanish": "Los neumáticos necesitan estar balanceados.", "level": 1},
    {"english": "He opens the glove compartment to get documents.", "spanish": "Él abre la guantera para sacar documentos.", "level": 1},
    {"english": "The car headlights improve night visibility.", "spanish": "Los faros del coche mejoran la visibilidad nocturna.", "level": 1},
    {"english": "She starts the engine and drives carefully.", "spanish": "Ella arranca el motor y conduce con cuidado.", "level": 1},
    {"english": "The engine oil should be changed regularly.", "spanish": "El aceite del motor debe cambiarse regularmente.", "level": 1},
    {"english": "He uses the brake pedal to stop the car.", "spanish": "Él usa el pedal de freno para detener el coche.", "level": 1},
    {"english": "The car uses a fan belt to power accessories.", "spanish": "El coche usa una correa de ventilador para alimentar accesorios.", "level": 1},
    {"english": "She checks the wiper blades before rain.", "spanish": "Ella revisa las escobillas del limpiaparabrisas antes de la lluvia.", "level": 1},
    {"english": "The car dashboard shows engine warnings.", "spanish": "El tablero del coche muestra advertencias del motor.", "level": 1},
    {"english": "He fills the car with diesel fuel.", "spanish": "Él llena el coche con combustible diésel.", "level": 1},
    {"english": "The tires should be rotated periodically.", "spanish": "Los neumáticos deben rotarse periódicamente.", "level": 1},
    {"english": "She checks the tire for punctures.", "spanish": "Ella revisa el neumático por pinchazos.", "level": 1},
    {"english": "The car has a dashboard clock.", "spanish": "El coche tiene un reloj en el tablero.", "level": 1},
    {"english": "He adjusts the seat position before driving.", "spanish": "Él ajusta la posición del asiento antes de conducir.", "level": 1},
    {"english": "The engine emits a sound when it accelerates.", "spanish": "El motor emite un sonido al acelerar.", "level": 1},
    {"english": "She uses the car jack to lift the vehicle.", "spanish": "Ella usa el gato del coche para levantar el vehículo.", "level": 1},
    {"english": "The fuel pump delivers gasoline to the engine.", "spanish": "La bomba de combustible entrega gasolina al motor.", "level": 1},
    {"english": "He checks the car lights before night driving.", "spanish": "Él revisa las luces del coche antes de conducir de noche.", "level": 1},
    {"english": "The engine air filter prevents dust from entering.", "spanish": "El filtro de aire del motor evita que entre polvo.", "level": 1},
    {"english": "She fills the car with engine oil.", "spanish": "Ella llena el coche con aceite de motor.", "level": 1},
    {"english": "The car uses a radiator to cool the engine.", "spanish": "El coche usa un radiador para enfriar el motor.", "level": 1},
    {"english": "He replaces the car battery when needed.", "spanish": "Él reemplaza la batería del coche cuando es necesario.", "level": 1},
    {"english": "The windshield is heated to remove frost.", "spanish": "El parabrisas está calefaccionado para quitar escarcha.", "level": 1},
    {"english": "She opens the car window to get fresh air.", "spanish": "Ella abre la ventana del coche para obtener aire fresco.", "level": 1},
    {"english": "The car engine uses a timing belt.", "spanish": "El motor del coche usa una correa de distribución.", "level": 1},

    {"english": "The mechanic inspected the suspension system for any damage.", "spanish": "El mecánico inspeccionó el sistema de suspensión por posibles daños.", "level": 2},
    {"english": "Modern engines use electronic fuel injection for better efficiency.", "spanish": "Los motores modernos usan inyección electrónica de combustible para mayor eficiencia.", "level": 2},
    {"english": "He replaced the worn brake discs to improve stopping power.", "spanish": "Él reemplazó los discos de freno desgastados para mejorar la capacidad de frenado.", "level": 2},
    {"english": "The car has an anti-lock braking system to prevent skidding.", "spanish": "El coche tiene un sistema de frenos antibloqueo para evitar derrapes.", "level": 2},
    {"english": "She checked the transmission fluid for proper level and condition.", "spanish": "Ella revisó el líquido de transmisión para asegurar el nivel y estado adecuados.", "level": 2},
    {"english": "The turbocharger increases the engine's power without increasing size.", "spanish": "El turbocompresor aumenta la potencia del motor sin incrementar su tamaño.", "level": 2},
    {"english": "He adjusted the wheel alignment to prevent uneven tire wear.", "spanish": "Él ajustó la alineación de las ruedas para evitar desgaste irregular de los neumáticos.", "level": 2},
    {"english": "The car's hybrid system combines a gasoline engine with an electric motor.", "spanish": "El sistema híbrido del coche combina un motor de gasolina con un motor eléctrico.", "level": 2},
    {"english": "She replaced the air filter to ensure proper engine airflow.", "spanish": "Ella reemplazó el filtro de aire para asegurar un flujo de aire adecuado al motor.", "level": 2},
    {"english": "The exhaust system includes a catalytic converter to reduce emissions.", "spanish": "El sistema de escape incluye un convertidor catalítico para reducir emisiones.", "level": 2},
    {"english": "He checked the spark plugs to ensure efficient combustion.", "spanish": "Él revisó las bujías para asegurar una combustión eficiente.", "level": 2},
    {"english": "The car has a variable valve timing system for better performance.", "spanish": "El coche tiene un sistema de tiempo variable de válvulas para mejorar el rendimiento.", "level": 2},
    {"english": "She inspected the drive belt for cracks or signs of wear.", "spanish": "Ella inspeccionó la correa de transmisión por grietas o signos de desgaste.", "level": 2},
    {"english": "The engine cooling system uses a thermostat to regulate temperature.", "spanish": "El sistema de refrigeración del motor usa un termostato para regular la temperatura.", "level": 2},
    {"english": "He performed a diagnostic check to identify any engine faults.", "spanish": "Él realizó un diagnóstico para identificar fallos en el motor.", "level": 2},
    {"english": "The fuel pump delivers a precise amount of fuel to the injectors.", "spanish": "La bomba de combustible entrega una cantidad precisa de combustible a los inyectores.", "level": 2},
    {"english": "She topped up the windshield washer fluid before a long trip.", "spanish": "Ella rellenó el líquido del limpiaparabrisas antes de un viaje largo.", "level": 2},
    {"english": "The car's electronic control unit manages engine performance.", "spanish": "La unidad de control electrónico del coche gestiona el rendimiento del motor.", "level": 2},
    {"english": "He inspected the brake lines for leaks or damage.", "spanish": "Él inspeccionó las líneas de freno por fugas o daños.", "level": 2},
    {"english": "The air conditioning system uses a compressor to circulate refrigerant.", "spanish": "El sistema de aire acondicionado usa un compresor para circular el refrigerante.", "level": 2},
    {"english": "She monitored the battery voltage to prevent electrical issues.", "spanish": "Ella monitoreó el voltaje de la batería para evitar problemas eléctricos.", "level": 2},
    {"english": "The suspension system absorbs shocks for a smooth ride.", "spanish": "El sistema de suspensión absorbe los impactos para un viaje suave.", "level": 2},
    {"english": "He flushed the radiator to remove old coolant and debris.", "spanish": "Él vació el radiador para eliminar refrigerante viejo y residuos.", "level": 2},
    {"english": "The car's differential allows the wheels to rotate at different speeds.", "spanish": "El diferencial del coche permite que las ruedas giren a diferentes velocidades.", "level": 2},
    {"english": "She replaced the brake fluid to maintain hydraulic pressure.", "spanish": "Ella reemplazó el líquido de frenos para mantener la presión hidráulica.", "level": 2},
    {"english": "The car uses disc brakes for improved stopping power.", "spanish": "El coche usa frenos de disco para mejorar la capacidad de frenado.", "level": 2},
    {"english": "He checked the wheel bearings for smooth rotation.", "spanish": "Él revisó los rodamientos de las ruedas para una rotación suave.", "level": 2},
    {"english": "The timing belt synchronizes the movement of the engine valves.", "spanish": "La correa de distribución sincroniza el movimiento de las válvulas del motor.", "level": 2},
    {"english": "She adjusted the headlights to avoid blinding other drivers.", "spanish": "Ella ajustó los faros para no deslumbrar a otros conductores.", "level": 2},
    {"english": "The car's fuel economy improves with regular maintenance.", "spanish": "La economía de combustible del coche mejora con mantenimiento regular.", "level": 2},
    {"english": "He inspected the exhaust for corrosion or leaks.", "spanish": "Él inspeccionó el escape por corrosión o fugas.", "level": 2},
    {"english": "The engine's oil pump circulates lubricant under pressure.", "spanish": "La bomba de aceite del motor circula lubricante bajo presión.", "level": 2},
    {"english": "She checked the tire sidewalls for cracks or bulges.", "spanish": "Ella revisó los flancos de los neumáticos por grietas o protuberancias.", "level": 2},
    {"english": "The car has a traction control system to prevent wheel spin.", "spanish": "El coche tiene un sistema de control de tracción para evitar que las ruedas patinen.", "level": 2},
    {"english": "He replaced the cabin air filter to improve ventilation.", "spanish": "Él reemplazó el filtro de aire de la cabina para mejorar la ventilación.", "level": 2},
    {"english": "The vehicle's ABS prevents wheels from locking during braking.", "spanish": "El ABS del vehículo evita que las ruedas se bloqueen durante el frenado.", "level": 2},
    {"english": "She checked the engine mounts for wear or damage.", "spanish": "Ella revisó los soportes del motor por desgaste o daños.", "level": 2},
    {"english": "The car's steering system uses hydraulic assistance.", "spanish": "El sistema de dirección del coche utiliza asistencia hidráulica.", "level": 2},
    {"english": "He measured the brake rotor thickness to ensure safety.", "spanish": "Él midió el grosor del rotor de freno para garantizar seguridad.", "level": 2},
    {"english": "The car uses a catalytic converter to reduce harmful emissions.", "spanish": "El coche usa un convertidor catalítico para reducir emisiones dañinas.", "level": 2},
    {"english": "She replaced the worn wiper blades to improve visibility.", "spanish": "Ella reemplazó las escobillas desgastadas para mejorar la visibilidad.", "level": 2},
    {"english": "The engine's fuel injectors deliver precise amounts of fuel.", "spanish": "Los inyectores del motor entregan cantidades precisas de combustible.", "level": 2},
    {"english": "He monitored the car's oil pressure with a gauge.", "spanish": "Él monitoreó la presión del aceite del coche con un indicador.", "level": 2},
    {"english": "The transmission cooler prevents overheating of the gearbox.", "spanish": "El enfriador de transmisión evita el sobrecalentamiento de la caja de cambios.", "level": 2},
    {"english": "She inspected the CV joints for wear and tear.", "spanish": "Ella inspeccionó las juntas homocinéticas por desgaste.", "level": 2},
    {"english": "The car's engine control module optimizes performance.", "spanish": "El módulo de control del motor del coche optimiza el rendimiento.", "level": 2},
    {"english": "He checked the fuel lines for cracks or leaks.", "spanish": "Él revisó las líneas de combustible por grietas o fugas.", "level": 2},
    {"english": "The vehicle's cooling fan operates when the engine gets hot.", "spanish": "El ventilador de refrigeración del vehículo funciona cuando el motor se calienta.", "level": 2},
    {"english": "She replaced the old spark plugs to improve combustion efficiency.", "spanish": "Ella reemplazó las bujías viejas para mejorar la eficiencia de combustión.", "level": 2},
    {"english": "The brake calipers apply pressure to the discs for stopping.", "spanish": "Las pinzas de freno aplican presión a los discos para detener el vehículo.", "level": 2},
    {"english": "He checked the alternator output to ensure proper charging.", "spanish": "Él revisó la salida del alternador para asegurar una carga adecuada.", "level": 2},
    {"english": "The car's fuel system includes a filter to remove impurities.", "spanish": "El sistema de combustible del coche incluye un filtro para eliminar impurezas.", "level": 2},
    {"english": "She inspected the undercarriage for rust or damage.", "spanish": "Ella inspeccionó el chasis por óxido o daños.", "level": 2},
    {"english": "The engine's camshaft controls the timing of the valves.", "spanish": "El árbol de levas del motor controla el tiempo de las válvulas.", "level": 2},
    {"english": "He checked the drive shaft for straightness and lubrication.", "spanish": "Él revisó el eje de transmisión por rectitud y lubricación.", "level": 2},
    {"english": "The car's electronic stability control improves handling.", "spanish": "El control electrónico de estabilidad del coche mejora la maniobrabilidad.", "level": 2},
    {"english": "She replaced the worn suspension bushings to reduce noise.", "spanish": "Ella reemplazó los bujes de suspensión desgastados para reducir el ruido.", "level": 2},
    {"english": "The engine uses a cooling thermostat to maintain optimal temperature.", "spanish": "El motor usa un termostato de refrigeración para mantener la temperatura óptima.", "level": 2},
    {"english": "He checked the power steering fluid to ensure smooth operation.", "spanish": "Él revisó el líquido de la dirección asistida para asegurar un funcionamiento suave.", "level": 2},
    {"english": "The car's muffler reduces engine noise.", "spanish": "El silenciador del coche reduce el ruido del motor.", "level": 2},
    {"english": "She inspected the fuel injectors for clogging or leaks.", "spanish": "Ella inspeccionó los inyectores de combustible por obstrucciones o fugas.", "level": 2},
    {"english": "The engine oil filter removes contaminants from the lubricant.", "spanish": "El filtro de aceite del motor elimina contaminantes del lubricante.", "level": 2},
    {"english": "He checked the car's chassis alignment after an accident.", "spanish": "Él revisó la alineación del chasis del coche después de un accidente.", "level": 2},
    {"english": "The car's headlight leveling system adjusts beam height automatically.", "spanish": "El sistema de nivelación de faros del coche ajusta la altura del haz automáticamente.", "level": 2},
    {"english": "She topped up the engine coolant to prevent overheating.", "spanish": "Ella rellenó el refrigerante del motor para evitar sobrecalentamiento.", "level": 2},
    {"english": "The ABS sensors monitor wheel speed to prevent lockup.", "spanish": "Los sensores del ABS monitorean la velocidad de las ruedas para evitar el bloqueo.", "level": 2},
    {"english": "He checked the ignition coils for proper voltage and function.", "spanish": "Él revisó las bobinas de encendido por voltaje y funcionamiento adecuados.", "level": 2},
    {"english": "The car's cruise control maintains a steady speed on highways.", "spanish": "El control de crucero del coche mantiene una velocidad constante en autopistas.", "level": 2},
    {"english": "She inspected the brake hoses for cracks or leaks.", "spanish": "Ella inspeccionó las mangueras de freno por grietas o fugas.", "level": 2},
    {"english": "The engine intake manifold distributes air to the cylinders.", "spanish": "El colector de admisión del motor distribuye aire a los cilindros.", "level": 2},
    {"english": "He replaced the worn timing chain to prevent engine damage.", "spanish": "Él reemplazó la cadena de distribución desgastada para evitar daños al motor.", "level": 2},
    {"english": "The car's fuel economy is influenced by tire pressure.", "spanish": "La economía de combustible del coche se ve influenciada por la presión de los neumáticos.", "level": 2},
    {"english": "She checked the alternator belt for wear and tension.", "spanish": "Ella revisó la correa del alternador por desgaste y tensión.", "level": 2},
    {"english": "The engine control unit adjusts fuel and ignition timing.", "spanish": "La unidad de control del motor ajusta el combustible y el tiempo de encendido.", "level": 2},
    {"english": "He inspected the wheel hubs for smooth rotation and lubrication.", "spanish": "Él inspeccionó los bujes de las ruedas por rotación suave y lubricación.", "level": 2},
    {"english": "The car's ventilation system circulates fresh air inside the cabin.", "spanish": "El sistema de ventilación del coche circula aire fresco dentro de la cabina.", "level": 2},
    {"english": "She replaced the worn drive belts to maintain engine performance.", "spanish": "Ella reemplazó las correas de transmisión desgastadas para mantener el rendimiento del motor.", "level": 2},
    {"english": "The engine oil cooler prevents oil from overheating during high performance.", "spanish": "El enfriador de aceite del motor evita el sobrecalentamiento del aceite durante alto rendimiento.", "level": 2},
    {"english": "He checked the vehicle's underbody for leaks or corrosion.", "spanish": "Él revisó la parte inferior del vehículo por fugas o corrosión.", "level": 2},
    {"english": "The car's traction system adjusts power to each wheel automatically.", "spanish": "El sistema de tracción del coche ajusta automáticamente la potencia a cada rueda.", "level": 2},
    {"english": "She inspected the exhaust manifold for cracks or leaks.", "spanish": "Ella inspeccionó el colector de escape por grietas o fugas.", "level": 2},
    {"english": "The engine uses a fuel pressure regulator to maintain consistent fuel delivery.", "spanish": "El motor usa un regulador de presión de combustible para mantener un suministro constante.", "level": 2},
    {"english": "He replaced the worn suspension shocks to restore ride comfort.", "spanish": "Él reemplazó los amortiguadores desgastados para restaurar la comodidad del viaje.", "level": 2},
    {"english": "The car's onboard computer monitors engine and transmission systems.", "spanish": "La computadora a bordo del coche monitorea los sistemas del motor y la transmisión.", "level": 2},
    {"english": "She checked the engine's cylinder compression to ensure efficiency.", "spanish": "Ella revisó la compresión de los cilindros del motor para garantizar eficiencia.", "level": 2},
    {"english": "The vehicle's safety system includes airbags and seatbelt pretensioners.", "spanish": "El sistema de seguridad del vehículo incluye airbags y pretensores de cinturón.", "level": 2},
    {"english": "He inspected the fuel rail for leaks or blockages.", "spanish": "Él inspeccionó el riel de combustible por fugas u obstrucciones.", "level": 2},
    {"english": "The car's cooling system has a radiator and electric fans.", "spanish": "El sistema de refrigeración del coche tiene un radiador y ventiladores eléctricos.", "level": 2},
    {"english": "She monitored the engine temperature using the dashboard gauge.", "spanish": "Ella monitoreó la temperatura del motor usando el indicador del tablero.", "level": 2},

    {"english": "The engine control unit continuously adjusts the air-fuel ratio and ignition timing based on sensor data to optimize performance and emissions.", "spanish": "La unidad de control del motor ajusta continuamente la relación aire-combustible y el tiempo de encendido según los datos de los sensores para optimizar el rendimiento y las emisiones.", "level": 3},
    {"english": "Modern vehicles use electronic stability control systems that actively manage individual wheel braking and engine torque to prevent skidding during extreme maneuvers.", "spanish": "Los vehículos modernos usan sistemas de control de estabilidad electrónica que gestionan activamente el frenado de cada rueda y el torque del motor para evitar derrapes durante maniobras extremas.", "level": 3},
    {"english": "The turbocharged engine employs an intercooler to lower the temperature of compressed air, increasing air density and improving combustion efficiency.", "spanish": "El motor turboalimentado emplea un intercooler para reducir la temperatura del aire comprimido, aumentando la densidad del aire y mejorando la eficiencia de combustión.", "level": 3},
    {"english": "She performed a comprehensive diagnostic using an OBD-II scanner to identify misfires, sensor failures, and transmission anomalies.", "spanish": "Ella realizó un diagnóstico completo usando un escáner OBD-II para identificar fallos de encendido, fallas de sensores y anomalías en la transmisión.", "level": 3},
    {"english": "The hybrid powertrain seamlessly integrates a high-voltage electric motor with a gasoline engine, optimizing fuel consumption and reducing emissions under varying load conditions.", "spanish": "El tren motriz híbrido integra de manera fluida un motor eléctrico de alto voltaje con un motor de gasolina, optimizando el consumo de combustible y reduciendo emisiones bajo condiciones de carga variables.", "level": 3},
    {"english": "Advanced driver-assistance systems use LIDAR, radar, and camera inputs to detect obstacles, maintain lane position, and manage adaptive cruise control.", "spanish": "Los sistemas avanzados de asistencia al conductor utilizan entradas de LIDAR, radar y cámara para detectar obstáculos, mantener la posición en el carril y gestionar el control de crucero adaptativo.", "level": 3},
    {"english": "He replaced the variable valve timing actuator to restore precise timing and maximize torque output at different engine speeds.", "spanish": "Él reemplazó el actuador de tiempo variable de válvulas para restaurar la sincronización precisa y maximizar el par motor a diferentes revoluciones.", "level": 3},
    {"english": "The dual-clutch transmission allows lightning-fast gear shifts by pre-selecting the next gear while maintaining torque delivery.", "spanish": "La transmisión de doble embrague permite cambios de marcha ultrarrápidos al preseleccionar la siguiente marcha mientras mantiene la entrega de torque.", "level": 3},
    {"english": "He inspected the high-pressure fuel pump and injectors to ensure precise atomization and consistent cylinder filling under high engine load.", "spanish": "Él inspeccionó la bomba de combustible de alta presión y los inyectores para asegurar una atomización precisa y un llenado constante de los cilindros bajo alta carga del motor.", "level": 3},
    {"english": "The adaptive suspension system actively adjusts shock absorber stiffness and ride height based on driving conditions and road surface quality.", "spanish": "El sistema de suspensión adaptativa ajusta activamente la rigidez de los amortiguadores y la altura de conducción según las condiciones de manejo y la calidad de la superficie de la carretera.", "level": 3},
    {"english": "She calibrated the electronic power steering system to optimize feedback and minimize driver effort during high-speed maneuvers.", "spanish": "Ella calibró el sistema de dirección asistida electrónica para optimizar la retroalimentación y minimizar el esfuerzo del conductor durante maniobras a alta velocidad.", "level": 3},
    {"english": "The vehicle’s regenerative braking system converts kinetic energy into electrical energy, storing it in the high-voltage battery to improve overall efficiency.", "spanish": "El sistema de frenado regenerativo del vehículo convierte la energía cinética en energía eléctrica, almacenándola en la batería de alto voltaje para mejorar la eficiencia general.", "level": 3},
    {"english": "He inspected the turbocharger wastegate to prevent overboost conditions that could damage pistons or valves.", "spanish": "Él inspeccionó la válvula de descarga del turbocompresor para evitar condiciones de sobrepresión que podrían dañar los pistones o las válvulas.", "level": 3},
    {"english": "The car’s collision avoidance system uses predictive algorithms to apply brakes or steer autonomously when a potential crash is detected.", "spanish": "El sistema de evitación de colisiones del coche utiliza algoritmos predictivos para accionar los frenos o dirigir de manera autónoma cuando se detecta un posible accidente.", "level": 3},
    {"english": "She checked the differential gear oil for proper viscosity to ensure smooth torque distribution between the wheels.", "spanish": "Ella revisó el aceite del engranaje diferencial para asegurar la viscosidad adecuada y una distribución suave del torque entre las ruedas.", "level": 3},
    {"english": "The high-performance engine uses direct fuel injection combined with variable valve timing to maximize efficiency and power output.", "spanish": "El motor de alto rendimiento usa inyección directa de combustible combinada con tiempo variable de válvulas para maximizar la eficiencia y la potencia.", "level": 3},
    {"english": "He inspected the high-voltage battery pack for cell degradation and temperature irregularities to prevent performance loss.", "spanish": "Él inspeccionó el paquete de baterías de alto voltaje por degradación de celdas e irregularidades de temperatura para prevenir pérdida de rendimiento.", "level": 3},
    {"english": "The car’s lane-keeping assist system uses camera input to detect lane markings and apply gentle steering corrections.", "spanish": "El sistema de mantenimiento de carril del coche utiliza la cámara para detectar las marcas del carril y aplicar correcciones suaves de dirección.", "level": 3},
    {"english": "She flushed the cooling system with specialized coolant to remove corrosion deposits and improve thermal management.", "spanish": "Ella vació el sistema de refrigeración con refrigerante especializado para eliminar depósitos de corrosión y mejorar la gestión térmica.", "level": 3},
    {"english": "The active aerodynamics system adjusts spoilers and air intakes to reduce drag and increase downforce at high speeds.", "spanish": "El sistema de aerodinámica activa ajusta alerones y entradas de aire para reducir la resistencia y aumentar la carga aerodinámica a altas velocidades.", "level": 3},
    {"english": "He tested the exhaust gas recirculation system to ensure it reduces nitrogen oxide emissions effectively.", "spanish": "Él probó el sistema de recirculación de gases de escape para asegurar que reduzca eficazmente las emisiones de óxidos de nitrógeno.", "level": 3},
    {"english": "The vehicle’s adaptive headlights swivel based on steering input to illuminate the road during cornering.", "spanish": "Los faros adaptativos del vehículo giran según la dirección del volante para iluminar la carretera durante las curvas.", "level": 3},
    {"english": "She analyzed the engine vibration data to detect misalignment, unbalanced components, or impending mechanical failures.", "spanish": "Ella analizó los datos de vibración del motor para detectar desalineación, componentes desequilibrados o fallas mecánicas inminentes.", "level": 3},
    {"english": "The car’s all-wheel-drive system distributes torque dynamically to optimize traction in slippery conditions.", "spanish": "El sistema de tracción total del coche distribuye el torque de manera dinámica para optimizar la tracción en condiciones resbaladizas.", "level": 3},
    {"english": "He calibrated the adaptive cruise control sensors to maintain safe distances in varying traffic conditions.", "spanish": "Él calibró los sensores del control de crucero adaptativo para mantener distancias seguras en condiciones de tráfico variables.", "level": 3},
    {"english": "The advanced braking system integrates hydraulic, electronic, and regenerative components to maximize stopping efficiency.", "spanish": "El sistema de frenos avanzado integra componentes hidráulicos, electrónicos y regenerativos para maximizar la eficiencia de frenado.", "level": 3},
    {"english": "She monitored the thermal management of the electric drivetrain to prevent overheating during sustained high-performance driving.", "spanish": "Ella monitoreó la gestión térmica del tren motriz eléctrico para prevenir sobrecalentamiento durante conducción de alto rendimiento sostenida.", "level": 3},
    {"english": "The engine’s variable geometry turbocharger adapts the turbine flow to maintain optimal boost across all RPM ranges.", "spanish": "El turbocompresor de geometría variable del motor adapta el flujo de la turbina para mantener la presión óptima en todas las revoluciones.", "level": 3},
    {"english": "He performed a full suspension geometry check using laser alignment tools to ensure precise handling characteristics.", "spanish": "Él realizó una verificación completa de la geometría de la suspensión usando herramientas de alineación láser para asegurar características de manejo precisas.", "level": 3},
    {"english": "The hybrid regenerative braking system optimizes energy recovery while maintaining consistent brake feel and vehicle stability.", "spanish": "El sistema de frenado regenerativo híbrido optimiza la recuperación de energía mientras mantiene una sensación de frenado constante y la estabilidad del vehículo.", "level": 3},
    {"english": "She inspected the cylinder head for cracks, warping, and proper gasket sealing to prevent coolant or oil leaks.", "spanish": "Ella inspeccionó la culata por grietas, deformaciones y correcto sellado de la junta para prevenir fugas de refrigerante o aceite.", "level": 3},
    {"english": "The vehicle’s advanced infotainment system integrates navigation, diagnostics, and telematics data for a connected driving experience.", "spanish": "El avanzado sistema de infoentretenimiento del vehículo integra navegación, diagnóstico y datos telemáticos para una experiencia de conducción conectada.", "level": 3},
    {"english": "He tested the fuel injection timing and pressure under load to ensure optimal combustion and emissions compliance.", "spanish": "Él probó el tiempo y la presión de inyección de combustible bajo carga para asegurar combustión óptima y cumplimiento de emisiones.", "level": 3},
    {"english": "The car’s collision mitigation system actively applies braking and torque reduction to minimize impact severity.", "spanish": "El sistema de mitigación de colisiones del coche aplica activamente frenos y reducción de torque para minimizar la gravedad del impacto.", "level": 3},
    {"english": "She analyzed the drivetrain efficiency using telemetry to detect energy losses and optimize power delivery.", "spanish": "Ella analizó la eficiencia del tren motriz usando telemetría para detectar pérdidas de energía y optimizar la entrega de potencia.", "level": 3},
    {"english": "The engine’s direct injection system sprays fuel at high pressure directly into the combustion chamber to improve power and reduce knock.", "spanish": "El sistema de inyección directa del motor pulveriza combustible a alta presión directamente en la cámara de combustión para mejorar la potencia y reducir detonaciones.", "level": 3},
    {"english": "He inspected the brake-by-wire system for proper electronic signal transmission and hydraulic response.", "spanish": "Él inspeccionó el sistema de freno por cable por la correcta transmisión de señales electrónicas y respuesta hidráulica.", "level": 3},
    {"english": "The adaptive suspension control module continuously monitors vehicle dynamics and road conditions to optimize ride comfort and handling.", "spanish": "El módulo de control de suspensión adaptativa monitorea continuamente la dinámica del vehículo y las condiciones de la carretera para optimizar la comodidad y el manejo.", "level": 3},
    {"english": "She checked the high-voltage inverter for proper voltage conversion and thermal stability in the electric drivetrain.", "spanish": "Ella revisó el inversor de alto voltaje para asegurar conversión de voltaje adecuada y estabilidad térmica en el tren motriz eléctrico.", "level": 3},
    {"english": "The vehicle’s active rear differential dynamically adjusts torque distribution to maximize traction and cornering performance.", "spanish": "El diferencial trasero activo del vehículo ajusta dinámicamente la distribución de torque para maximizar tracción y rendimiento en curvas.", "level": 3},
    {"english": "He evaluated the engine lubrication system under extreme conditions to ensure consistent oil flow and prevent bearing failure.", "spanish": "Él evaluó el sistema de lubricación del motor bajo condiciones extremas para asegurar flujo de aceite constante y prevenir fallas en los cojinetes.", "level": 3},
    {"english": "The car’s semi-autonomous driving system integrates radar, ultrasonic sensors, and cameras to maintain lane position, adapt speed, and detect hazards.", "spanish": "El sistema de conducción semiautónoma del coche integra radar, sensores ultrasónicos y cámaras para mantener la posición en el carril, adaptar la velocidad y detectar peligros.", "level": 3},
    {"english": "She tested the exhaust after-treatment system including the catalytic converter and particulate filter for emission compliance.", "spanish": "Ella probó el sistema de post-tratamiento de escape, incluyendo el convertidor catalítico y el filtro de partículas, para cumplimiento de emisiones.", "level": 3},
    {"english": "The engine management system uses closed-loop feedback from oxygen sensors to optimize combustion and fuel efficiency.", "spanish": "El sistema de gestión del motor utiliza retroalimentación en circuito cerrado de los sensores de oxígeno para optimizar la combustión y la eficiencia de combustible.", "level": 3},
    {"english": "He checked the variable geometry intake manifold to ensure it adapts airflow for different engine speeds and loads.", "spanish": "Él revisó el colector de admisión de geometría variable para asegurar que adapte el flujo de aire a diferentes revoluciones y cargas del motor.", "level": 3},
    {"english": "The vehicle’s predictive maintenance system analyzes sensor data to anticipate component wear and schedule timely service.", "spanish": "El sistema de mantenimiento predictivo del vehículo analiza datos de sensores para anticipar desgaste de componentes y programar servicio oportuno.", "level": 3}
  ]
}
